// 纯JS省市区三级联动
// 2011-11-30 by http://www.cnblogs.com/zjfree

var initProvince_UserCenter = function(divLable){
	$("#"+divLable).html("");
	var Pro_ul = document.body.querySelector('#'+divLable);
	for(var i=0; i<provinceList.length; i++){
		var addHtml = "{pro_name}";
		var proName = provinceList[i].name;
		addHtml = addHtml.replace('{pro_name}', proName);
		var li = document.createElement('li');
		li.innerHTML = addHtml;
		li.className = "DFPACcityList";
		li.id = i;
		Pro_ul.appendChild(li);
	}
	eachLiAddProvinceClick2();
}


function eachLiAddProvinceClick2(){
	$.each(document.querySelectorAll('.DFPACcityList'), function() {
		this.addEventListener('tap',function(){
			var id = $(this).attr("id");
			var proName = $(this).html();
			var username = GetPageParams("username");
			var usersex = GetPageParams("usersex");
			var userphone = GetPageParams("userphone");
			var DFMIbtnDate = GetPageParams("DFMIbtnDate");
			var usercity = GetPageParams("usercity");
			var url = 'DFArea.html?proId=' + id+'&username='+username+'&usersex='+usersex+'&userphone='+userphone+'&DFMIbtnDate='+DFMIbtnDate;
			url = encodeURI(url);
			window.location.href = url;
		});
	});
}

function loadCity_UserCenter(id, proName, divLable) {
	$("#"+divLable).html("");
	var City_ul = document.body.querySelector('#'+divLable);
	var Pro_cityList = provinceList[id].cityList;
	for(var i=0; i<Pro_cityList.length; i++){
		var addHtml = "{city_name}";
		var cityName = Pro_cityList[i].name;
		addHtml = addHtml.replace('{city_name}', cityName);
		var li = document.createElement('li');
		li.innerHTML = addHtml;
		li.className = "DFPACcityList";
		li.id = proName + "_"+ i;
		
		City_ul.appendChild(li);
	}
	eachLiAddCityClick2();
}
function eachLiAddCityClick2(){
	$.each(document.querySelectorAll('.DFPACcityList'), function() {
		this.addEventListener('tap',function(){
			var id = $(this).attr("id");
			var cityName = $(this).html();		
			var username = GetPageParams("username");
			var usersex = GetPageParams("usersex");
			var userphone = GetPageParams("userphone");
			var DFMIbtnDate = GetPageParams("DFMIbtnDate");
			var usercity = GetPageParams("usercity");
			var url = 'DFmodifyInformation.html?proId=' + id+'&username='+username+'&usersex='+usersex+'&userphone='+userphone+'&DFMIbtnDate='+DFMIbtnDate;
			url = encodeURI(url);
			window.location.href = url;
		});
	});
}
var initProvince = function(divLable){
	$("#"+divLable).html("");
	var Pro_ul = document.body.querySelector('#'+divLable);
	for(var i=0; i<jxsAreaList.length; i++){
		var addHtml = "{pro_name}";
		var proName = jxsAreaList[i].name;
		addHtml = addHtml.replace('{pro_name}', proName);
		var li = document.createElement('li');
		li.innerHTML = addHtml;
		li.className = "listBtn loadCity";
		li.id = i;
		Pro_ul.appendChild(li);
	}
	//for(var i=0; i<provinceList.length; i++){
	//	var addHtml = "{pro_name}";
	//	var proName = provinceList[i].name;
	//	addHtml = addHtml.replace('{pro_name}', proName);
	//	var li = document.createElement('li');
	//	li.innerHTML = addHtml;
	//	li.className = "listBtn loadCity";
	//	li.id = i;
	//	Pro_ul.appendChild(li);
	//}
	eachLiAddProvinceClick();
	myScroll.refresh();
	myScrollOne.refresh();
}

function eachLiAddProvinceClick(){
	$.each(document.querySelectorAll('.loadCity'), function() {
		this.addEventListener('tap',function(){
			var id = $(this).attr("id");
			var proName = $(this).html();
			$(this).addClass('scrollerbj');
			$(this).siblings().removeClass('scrollerbj');
			loadCity(id, proName, "city_name");
			$('.DFSNMaskMeu').show();
			$('.rightBigContent').show();
		});
	});
}

function loadCity(id, proName, divLable) {
	$("#"+divLable).html("");
	var City_ul = document.body.querySelector('#'+divLable);
	var Pro_cityList = jxsAreaList[id].cityList;
	if(Pro_cityList){
		for(var i=0; i<Pro_cityList.length; i++){		
			var citycode = Pro_cityList[i].pCode;
			var arealist = Pro_cityList[i].areaList;
			if(citycode=='110000'||citycode=='310000'||citycode=='120000'||citycode=='500000'){
				for(var j=0; j<arealist.length; j++){
					var addHtml = "{city_name}";
					var cityName = arealist[j].name;
					addHtml = addHtml.replace('{city_name}', cityName);
					var li = document.createElement('li');
					li.innerHTML = addHtml;
					li.className = "getCityName";
					li.id = proName + "_"+ cityName;
					City_ul.appendChild(li);
				}
			}else{
				var addHtml = "{city_name}";
				var cityName = Pro_cityList[i].name;
				addHtml = addHtml.replace('{city_name}', cityName);
				var li = document.createElement('li');
				li.innerHTML = addHtml;
				li.className = "getCityName";
				li.id = proName + "_"+ cityName;
				City_ul.appendChild(li);
			}
				

		}
	}
	//var Pro_cityList = provinceList[id].cityList;
	//for(var i=0; i<Pro_cityList.length; i++){
	//	var addHtml = "{city_name}";
	//	var cityName = Pro_cityList[i].name;
	//	addHtml = addHtml.replace('{city_name}', cityName);
	//	var li = document.createElement('li');
	//	li.innerHTML = addHtml;
	//	li.className = "getCityName";
	//	li.id = proName + "_"+ cityName;
		
	//	City_ul.appendChild(li);
	//}
	eachLiAddCityClick();
}

function eachLiAddCityClick(){
	$.each(document.querySelectorAll('.getCityName'), function() {
		this.addEventListener('tap',function(){
			var id = $(this).attr("id");
			var cityName = $(this).html();
			$("#page").val(1);
			$("#selectedCity").val(id);
			$(".DFNSmenuTitle").html(cityName);
			$('.DFSNMaskMeu').hide();
			$('.rightBigContent').hide();
			reloadShop4s(id);
		});
	});
}

function getAreaCode(cityname){
		var obj = areacode.body;
		for(var i=0;i<obj.length;i++) {
			if(obj[i].city == cityname){
				return obj[i].cityId;
			}
		}
}

function getAreaName(citycode){
		var obj = areacode.body;
		for(var i=0;i<obj.length;i++) {
			if(obj[i].cityId == citycode){
				return obj[i].city;
			}
		}
}

function existsCode(cityname){
	if(jxsAreaList&&jxsAreaList.length>0){
		for(var i=0;i<jxsAreaList.length;i++) {
				if(jxsAreaList[i].name == cityname){
					return true;
				}
			}
		}
}

var jxsAreaList = [{"cityList":[{"level":1,"name":"永州市","pCode":"430000","code":"431100"}, {"level":1,"name":"长沙市","pCode":"430000","code":"430100"}, {"level":1,"name":"益阳市","pCode":"430000","code":"430900"}, {"level":1,"name":"邵阳市","pCode":"430000","code":"430500"}, {"level":1,"name":"株洲市","pCode":"430000","code":"430200"}, {"level":1,"name":"张家界市","pCode":"430000","code":"430800"}, {"level":1,"name":"岳阳市","pCode":"430000","code":"430600"}, {"level":1,"name":"衡阳市","pCode":"430000","code":"430400"}, {"level":1,"name":"娄底市","pCode":"430000","code":"431300"}, {"level":1,"name":"湘潭市","pCode":"430000","code":"430300"}, {"level":1,"name":"常德市","pCode":"430000","code":"430700"}, {"level":1,"name":"怀化市","pCode":"430000","code":"431200"}, {"level":1,"name":"郴州市","pCode":"430000","code":"431000"}],"level":0,"name":"湖南省","code":"430000"}, {"cityList":[{"level":1,"name":"濮阳市","pCode":"410000","code":"410900"}, {"level":1,"name":"漯河市","pCode":"410000","code":"411100"}, {"level":1,"name":"郑州市","pCode":"410000","code":"410100"}, {"level":1,"name":"许昌市","pCode":"410000","code":"411000"}, {"level":1,"name":"安阳市","pCode":"410000","code":"410500"}, {"level":1,"name":"信阳市","pCode":"410000","code":"411500"}, {"level":1,"name":"开封市","pCode":"410000","code":"410200"}, {"level":1,"name":"新乡市","pCode":"410000","code":"410700"}, {"level":1,"name":"洛阳市","pCode":"410000","code":"410300"}, {"level":1,"name":"南阳市","pCode":"410000","code":"411300"}, {"level":1,"name":"驻马店市","pCode":"410000","code":"411700"}, {"level":1,"name":"焦作市","pCode":"410000","code":"410800"}, {"level":1,"name":"平顶山市","pCode":"410000","code":"410400"}, {"level":1,"name":"商丘市","pCode":"410000","code":"411400"}, {"level":1,"name":"周口市","pCode":"410000","code":"411600"}, {"level":1,"name":"三门峡市","pCode":"410000","code":"411200"}],"level":0,"name":"河南省","code":"410000"}, {"cityList":[{"level":1,"name":"廊坊市","pCode":"130000","code":"131000"}, {"level":1,"name":"衡水市","pCode":"130000","code":"131100"}, {"level":1,"name":"邯郸市","pCode":"130000","code":"130400"}, {"level":1,"name":"承德市","pCode":"130000","code":"130800"}, {"level":1,"name":"唐山市","pCode":"130000","code":"130200"}, {"level":1,"name":"邢台市","pCode":"130000","code":"130500"}, {"level":1,"name":"保定市","pCode":"130000","code":"130600"}, {"level":1,"name":"沧州市","pCode":"130000","code":"130900"}, {"level":1,"name":"石家庄市","pCode":"130000","code":"130100"}],"level":0,"name":"河北省","code":"130000"}, {"cityList":[{"level":1,"name":"合肥市","pCode":"340000","code":"340100"}, {"level":1,"name":"宣城市","pCode":"340000","code":"341800"}, {"level":1,"name":"滁州市","pCode":"340000","code":"341100"}, {"level":1,"name":"芜湖市","pCode":"340000","code":"340200"}, {"level":1,"name":"蚌埠市","pCode":"340000","code":"340300"}, {"level":1,"name":"淮北市","pCode":"340000","code":"340600"}, {"level":1,"name":"安庆市","pCode":"340000","code":"340800"}, {"level":1,"name":"宿州市","pCode":"340000","code":"341300"}, {"level":1,"name":"六安市","pCode":"340000","code":"341500"}, {"level":1,"name":"阜阳市","pCode":"340000","code":"341200"}, {"level":1,"name":"马鞍山市","pCode":"340000","code":"340500"}, {"level":1,"name":"淮南市","pCode":"340000","code":"340400"}, {"level":1,"name":"黄山市","pCode":"340000","code":"341000"}],"level":0,"name":"安徽省","code":"340000"}, {"cityList":[{"level":1,"name":"常州市","pCode":"320000","code":"320400"}, {"level":1,"name":"苏州市","pCode":"320000","code":"320500"}, {"level":1,"name":"南京市","pCode":"320000","code":"320100"}, {"level":1,"name":"淮安市","pCode":"320000","code":"320800"}, {"level":1,"name":"盐城市","pCode":"320000","code":"320900"}, {"level":1,"name":"徐州市","pCode":"320000","code":"320300"}, {"level":1,"name":"无锡市","pCode":"320000","code":"320200"}, {"level":1,"name":"扬州市","pCode":"320000","code":"321000"}, {"level":1,"name":"连云港市","pCode":"320000","code":"320700"}, {"level":1,"name":"宿迁市","pCode":"320000","code":"321300"}, {"level":1,"name":"南通市","pCode":"320000","code":"320600"}, {"level":1,"name":"镇江市","pCode":"320000","code":"321100"}, {"level":1,"name":"泰州市","pCode":"320000","code":"321200"}],"level":0,"name":"江苏省","code":"320000"}, {"level":0,"name":"上海市","code":"310000"}, {"cityList":[{"level":1,"name":"桂林市","pCode":"450000","code":"450300"}, {"level":1,"name":"河池市","pCode":"450000","code":"451200"}, {"level":1,"name":"柳州市","pCode":"450000","code":"450200"}, {"level":1,"name":"梧州市","pCode":"450000","code":"450400"}, {"level":1,"name":"玉林市","pCode":"450000","code":"450900"}, {"level":1,"name":"百色市","pCode":"450000","code":"451000"}, {"level":1,"name":"北海市","pCode":"450000","code":"450500"}, {"level":1,"name":"南宁市","pCode":"450000","code":"450100"}, {"level":1,"name":"贺州市","pCode":"450000","code":"451100"}, {"level":1,"name":"贵港市","pCode":"450000","code":"450800"}, {"level":1,"name":"钦州市","pCode":"450000","code":"450700"}],"level":0,"name":"广西壮族自治区","code":"450000"}, {"cityList":[{"level":1,"name":"昆明市","pCode":"530000","code":"530100"}, {"level":1,"name":"临沧市","pCode":"530000","code":"530900"}, {"level":1,"name":"保山市","pCode":"530000","code":"530500"}, {"level":1,"name":"迪庆藏族自治州","pCode":"530000","code":"533400"}, {"level":1,"name":"普洱市","pCode":"530000","code":"530800"}, {"level":1,"name":"昭通市","pCode":"530000","code":"530600"}, {"level":1,"name":"玉溪市","pCode":"530000","code":"530400"}, {"level":1,"name":"曲靖市","pCode":"530000","code":"530300"}, {"level":1,"name":"丽江市","pCode":"530000","code":"530700"}, {"level":1,"name":"红河哈尼族彝族自治州","pCode":"530000","code":"532500"}, {"level":1,"name":"德宏傣族景颇族自治州","pCode":"530000","code":"533100"}, {"level":1,"name":"文山壮族苗族自治州","pCode":"530000","code":"532600"}, {"level":1,"name":"西双版纳傣族自治州","pCode":"530000","code":"532800"}],"level":0,"name":"云南省","code":"530000"}, {"cityList":[{"level":1,"name":"西宁市","pCode":"630000","code":"630100"}],"level":0,"name":"青海省","code":"630000"}, {"cityList":[{"level":1,"name":"汕头市","pCode":"440000","code":"440500"}, {"level":1,"name":"茂名市","pCode":"440000","code":"440900"}, {"level":1,"name":"东莞市","pCode":"440000","code":"441900"}, {"level":1,"name":"广州市","pCode":"440000","code":"440100"}, {"level":1,"name":"佛山市","pCode":"440000","code":"440600"}, {"level":1,"name":"珠海市","pCode":"440000","code":"440400"}, {"level":1,"name":"湛江市","pCode":"440000","code":"440800"}, {"level":1,"name":"清远市","pCode":"440000","code":"441800"}, {"level":1,"name":"河源市","pCode":"440000","code":"441600"}, {"level":1,"name":"潮州市","pCode":"440000","code":"445100"}, {"level":1,"name":"韶关市","pCode":"440000","code":"440200"}, {"level":1,"name":"中山市","pCode":"440000","code":"442000"}, {"level":1,"name":"云浮市","pCode":"440000","code":"445300"}, {"level":1,"name":"肇庆市","pCode":"440000","code":"441200"}, {"level":1,"name":"梅州市","pCode":"440000","code":"441400"}, {"level":1,"name":"江门市","pCode":"440000","code":"440700"}, {"level":1,"name":"阳江市","pCode":"440000","code":"441700"}, {"level":1,"name":"深圳市","pCode":"440000","code":"440300"}, {"level":1,"name":"惠州市","pCode":"440000","code":"441300"}],"level":0,"name":"广东省","code":"440000"}, {"cityList":[{"level":1,"name":"沈阳市","pCode":"210000","code":"210100"}, {"level":1,"name":"阜新市","pCode":"210000","code":"210900"}, {"level":1,"name":"营口市","pCode":"210000","code":"210800"}, {"level":1,"name":"本溪市","pCode":"210000","code":"210500"}, {"level":1,"name":"朝阳市","pCode":"210000","code":"211300"}, {"level":1,"name":"辽阳市","pCode":"210000","code":"211000"}, {"level":1,"name":"葫芦岛市","pCode":"210000","code":"211400"}, {"level":1,"name":"锦州市","pCode":"210000","code":"210700"}, {"level":1,"name":"丹东市","pCode":"210000","code":"210600"}, {"level":1,"name":"鞍山市","pCode":"210000","code":"210300"}, {"level":1,"name":"大连市","pCode":"210000","code":"210200"}],"level":0,"name":"辽宁省","code":"210000"}, {"cityList":[{"level":1,"name":"鹰潭市","pCode":"360000","code":"360600"}, {"level":1,"name":"九江市","pCode":"360000","code":"360400"}, {"level":1,"name":"宜春市","pCode":"360000","code":"360900"}, {"level":1,"name":"上饶市","pCode":"360000","code":"361100"}, {"level":1,"name":"新余市","pCode":"360000","code":"360500"}, {"level":1,"name":"吉安市","pCode":"360000","code":"360800"}, {"level":1,"name":"南昌市","pCode":"360000","code":"360100"}, {"level":1,"name":"赣州市","pCode":"360000","code":"360700"}, {"level":1,"name":"抚州市","pCode":"360000","code":"361000"}, {"level":1,"name":"萍乡市","pCode":"360000","code":"360300"}, {"level":1,"name":"景德镇市","pCode":"360000","code":"360200"}],"level":0,"name":"江西省","code":"360000"}, {"level":0,"name":"北京市","code":"110000"}, {"cityList":[{"level":1,"name":"陇南市","pCode":"620000","code":"621200"}, {"level":1,"name":"兰州市","pCode":"620000","code":"620100"}, {"level":1,"name":"酒泉市","pCode":"620000","code":"620900"}, {"level":1,"name":"平凉市","pCode":"620000","code":"620800"}, {"level":1,"name":"天水市","pCode":"620000","code":"620500"}, {"level":1,"name":"白银市","pCode":"620000","code":"620400"}, {"level":1,"name":"武威市","pCode":"620000","code":"620600"}, {"level":1,"name":"张掖市","pCode":"620000","code":"620700"}],"level":0,"name":"甘肃省","code":"620000"}, {"cityList":[{"level":1,"name":"十堰市","pCode":"420000","code":"420300"}, {"level":1,"name":"随州市","pCode":"420000","code":"421300"}, {"level":1,"name":"荆门市","pCode":"420000","code":"420800"}, {"level":1,"name":"黄冈市","pCode":"420000","code":"421100"}, {"level":1,"name":"武汉市","pCode":"420000","code":"420100"}, {"level":1,"name":"宜昌市","pCode":"420000","code":"420500"}, {"level":1,"name":"孝感市","pCode":"420000","code":"420900"}, {"level":1,"name":"咸宁市","pCode":"420000","code":"421200"}, {"level":1,"name":"荆州市","pCode":"420000","code":"421000"}, {"level":1,"name":"黄石市","pCode":"420000","code":"420200"}, {"level":1,"name":"襄阳市","pCode":"420000","code":"420600"}],"level":0,"name":"湖北省","code":"420000"}, {"cityList":[{"level":1,"name":"六盘水市","pCode":"520000","code":"520200"}, {"level":1,"name":"安顺市","pCode":"520000","code":"520400"}, {"level":1,"name":"贵阳市","pCode":"520000","code":"520100"}, {"level":1,"name":"遵义市","pCode":"520000","code":"520300"}],"level":0,"name":"贵州省","code":"520000"}, {"cityList":[{"level":1,"name":"临沂市","pCode":"370000","code":"371300"}, {"level":1,"name":"淄博市","pCode":"370000","code":"370300"}, {"level":1,"name":"潍坊市","pCode":"370000","code":"370700"}, {"level":1,"name":"青岛市","pCode":"370000","code":"370200"}, {"level":1,"name":"枣庄市","pCode":"370000","code":"370400"}, {"level":1,"name":"济宁市","pCode":"370000","code":"370800"}, {"level":1,"name":"烟台市","pCode":"370000","code":"370600"}, {"level":1,"name":"泰安市","pCode":"370000","code":"370900"}, {"level":1,"name":"威海市","pCode":"370000","code":"371000"}, {"level":1,"name":"济南市","pCode":"370000","code":"370100"}, {"level":1,"name":"莱芜市","pCode":"370000","code":"371200"}, {"level":1,"name":"东营市","pCode":"370000","code":"370500"}, {"level":1,"name":"菏泽市","pCode":"370000","code":"371700"}, {"level":1,"name":"滨州市","pCode":"370000","code":"371600"}, {"level":1,"name":"聊城市","pCode":"370000","code":"371500"}, {"level":1,"name":"德州市","pCode":"370000","code":"371400"}, {"level":1,"name":"日照市","pCode":"370000","code":"371100"}],"level":0,"name":"山东省","code":"370000"}, {"cityList":[{"level":1,"name":"中卫市","pCode":"640000","code":"640500"}, {"level":1,"name":"吴忠市","pCode":"640000","code":"640300"}, {"level":1,"name":"石嘴山市","pCode":"640000","code":"640200"}, {"level":1,"name":"银川市","pCode":"640000","code":"640100"}],"level":0,"name":"宁夏回族自治区","code":"640000"}, {"cityList":[{"level":1,"name":"绍兴市","pCode":"330000","code":"330600"}, {"level":1,"name":"金华市","pCode":"330000","code":"330700"}, {"level":1,"name":"宁波市","pCode":"330000","code":"330200"}, {"level":1,"name":"温州市","pCode":"330000","code":"330300"}, {"level":1,"name":"舟山市","pCode":"330000","code":"330900"}, {"level":1,"name":"衢州市","pCode":"330000","code":"330800"}, {"level":1,"name":"湖州市","pCode":"330000","code":"330500"}, {"level":1,"name":"嘉兴市","pCode":"330000","code":"330400"}, {"level":1,"name":"丽水市","pCode":"330000","code":"331100"}, {"level":1,"name":"杭州市","pCode":"330000","code":"330100"}, {"level":1,"name":"台州市","pCode":"330000","code":"331000"}],"level":0,"name":"浙江省","code":"330000"}, {"cityList":[{"level":1,"name":"莆田市","pCode":"350000","code":"350300"}, {"level":1,"name":"厦门市","pCode":"350000","code":"350200"}, {"level":1,"name":"南平市","pCode":"350000","code":"350700"}, {"level":1,"name":"漳州市","pCode":"350000","code":"350600"}, {"level":1,"name":"龙岩市","pCode":"350000","code":"350800"}, {"level":1,"name":"泉州市","pCode":"350000","code":"350500"}, {"level":1,"name":"福州市","pCode":"350000","code":"350100"}],"level":0,"name":"福建省","code":"350000"}, {"cityList":[{"level":1,"name":"包头市","pCode":"150000","code":"150200"}, {"level":1,"name":"呼和浩特市","pCode":"150000","code":"150100"}, {"level":1,"name":"乌海市","pCode":"150000","code":"150300"}, {"level":1,"name":"赤峰市","pCode":"150000","code":"150400"}, {"level":1,"name":"巴彦淖尔市","pCode":"150000","code":"150800"}, {"level":1,"name":"呼伦贝尔市","pCode":"150000","code":"150700"}, {"level":1,"name":"通辽市","pCode":"150000","code":"150500"}, {"level":1,"name":"阿拉善盟","pCode":"150000","code":"152900"}],"level":0,"name":"内蒙古自治区","code":"150000"}, {"cityList":[{"level":1,"name":"三亚市","pCode":"460000","code":"460200"}, {"level":1,"name":"海口市","pCode":"460000","code":"460100"}],"level":0,"name":"海南省","code":"460000"}, {"cityList":[{"level":1,"name":"南充市","pCode":"510000","code":"511300"}, {"level":1,"name":"雅安市","pCode":"510000","code":"511800"}, {"level":1,"name":"达州市","pCode":"510000","code":"511700"}, {"level":1,"name":"广元市","pCode":"510000","code":"510800"}, {"level":1,"name":"绵阳市","pCode":"510000","code":"510700"}, {"level":1,"name":"自贡市","pCode":"510000","code":"510300"}, {"level":1,"name":"资阳市","pCode":"510000","code":"512000"}, {"level":1,"name":"遂宁市","pCode":"510000","code":"510900"}, {"level":1,"name":"宜宾市","pCode":"510000","code":"511500"}, {"level":1,"name":"广安市","pCode":"510000","code":"511600"}, {"level":1,"name":"巴中市","pCode":"510000","code":"511900"}, {"level":1,"name":"乐山市","pCode":"510000","code":"511100"}, {"level":1,"name":"内江市","pCode":"510000","code":"511000"}, {"level":1,"name":"泸州市","pCode":"510000","code":"510500"}, {"level":1,"name":"成都市","pCode":"510000","code":"510100"}, {"level":1,"name":"德阳市","pCode":"510000","code":"510600"}, {"level":1,"name":"眉山市","pCode":"510000","code":"511400"}],"level":0,"name":"四川省","code":"510000"}, {"cityList":[{"level":1,"name":"吐鲁番地区","pCode":"650000","code":"652100"}, {"level":1,"name":"哈密地区","pCode":"650000","code":"652200"}, {"level":1,"name":"阿克苏地区","pCode":"650000","code":"652900"}, {"level":1,"name":"昌吉回族自治州","pCode":"650000","code":"652300"}, {"level":1,"name":"伊犁哈萨克自治州","pCode":"650000","code":"654000"}, {"level":1,"name":"博尔塔拉蒙古自治州","pCode":"650000","code":"652700"}, {"level":1,"name":"阿勒泰地区","pCode":"650000","code":"654300"}, {"level":1,"name":"和田地区","pCode":"650000","code":"653200"}, {"level":1,"name":"塔城地区","pCode":"650000","code":"654200"}, {"level":1,"name":"巴音郭楞蒙古自治州","pCode":"650000","code":"652800"}, {"level":1,"name":"乌鲁木齐市","pCode":"650000","code":"650100"}],"level":0,"name":"新疆维吾尔自治区","code":"650000"}, {"level":0,"name":"天津市","code":"120000"}, {"cityList":[{"level":1,"name":"吕梁市","pCode":"140000","code":"141100"}, {"level":1,"name":"临汾市","pCode":"140000","code":"141000"}, {"level":1,"name":"阳泉市","pCode":"140000","code":"140300"}, {"level":1,"name":"长治市","pCode":"140000","code":"140400"}, {"level":1,"name":"晋城市","pCode":"140000","code":"140500"}, {"level":1,"name":"朔州市","pCode":"140000","code":"140600"}, {"level":1,"name":"太原市","pCode":"140000","code":"140100"}, {"level":1,"name":"忻州市","pCode":"140000","code":"140900"}, {"level":1,"name":"运城市","pCode":"140000","code":"140800"}, {"level":1,"name":"晋中市","pCode":"140000","code":"140700"}],"level":0,"name":"山西省","code":"140000"}, {"cityList":[{"level":1,"name":"黑河市","pCode":"230000","code":"231100"}, {"level":1,"name":"大庆市","pCode":"230000","code":"230600"}, {"level":1,"name":"伊春市","pCode":"230000","code":"230700"}, {"level":1,"name":"绥化市","pCode":"230000","code":"231200"}, {"level":1,"name":"鸡西市","pCode":"230000","code":"230300"}, {"level":1,"name":"齐齐哈尔市","pCode":"230000","code":"230200"}, {"level":1,"name":"佳木斯市","pCode":"230000","code":"230800"}, {"level":1,"name":"牡丹江市","pCode":"230000","code":"231000"}, {"level":1,"name":"哈尔滨市","pCode":"230000","code":"230100"}, {"level":1,"name":"双鸭山市","pCode":"230000","code":"230500"}, {"level":1,"name":"七台河市","pCode":"230000","code":"230900"}],"level":0,"name":"黑龙江省","code":"230000"}, {"level":0,"name":"重庆市","code":"500000"}, {"cityList":[{"level":1,"name":"白城市","pCode":"220000","code":"220800"}, {"level":1,"name":"延边朝鲜族自治州","pCode":"220000","code":"222400"}, {"level":1,"name":"通化市","pCode":"220000","code":"220500"}, {"level":1,"name":"吉林市","pCode":"220000","code":"220200"}, {"level":1,"name":"四平市","pCode":"220000","code":"220300"}, {"level":1,"name":"白山市","pCode":"220000","code":"220600"}, {"level":1,"name":"长春市","pCode":"220000","code":"220100"}],"level":0,"name":"吉林省","code":"220000"}, {"cityList":[{"level":1,"name":"商洛市","pCode":"610000","code":"611000"}, {"level":1,"name":"渭南市","pCode":"610000","code":"610500"}, {"level":1,"name":"咸阳市","pCode":"610000","code":"610400"}, {"level":1,"name":"宝鸡市","pCode":"610000","code":"610300"}, {"level":1,"name":"西安市","pCode":"610000","code":"610100"}, {"level":1,"name":"铜川市","pCode":"610000","code":"610200"}, {"level":1,"name":"榆林市","pCode":"610000","code":"610800"}, {"level":1,"name":"安康市","pCode":"610000","code":"610900"}, {"level":1,"name":"汉中市","pCode":"610000","code":"610700"}, {"level":1,"name":"延安市","pCode":"610000","code":"610600"}],"level":0,"name":"陕西省","code":"610000"}];

var provinceList = [
{name:'北京', cityList:[		   
{name:'东城区', areaList:['东城区','西城区','崇文区','宣武区','朝阳区','丰台区','石景山区','海淀区','门头沟区','房山区','通州区','顺义区','昌平区','大兴区','怀柔区','平谷区']},		   
{name:'西城区', areaList:['东城区','西城区','崇文区','宣武区','朝阳区','丰台区','石景山区','海淀区','门头沟区','房山区','通州区','顺义区','昌平区','大兴区','怀柔区','平谷区']},		   
{name:'崇文区', areaList:['东城区','西城区','崇文区','宣武区','朝阳区','丰台区','石景山区','海淀区','门头沟区','房山区','通州区','顺义区','昌平区','大兴区','怀柔区','平谷区']},		   
{name:'宣武区', areaList:['东城区','西城区','崇文区','宣武区','朝阳区','丰台区','石景山区','海淀区','门头沟区','房山区','通州区','顺义区','昌平区','大兴区','怀柔区','平谷区']},		   
{name:'朝阳区', areaList:['东城区','西城区','崇文区','宣武区','朝阳区','丰台区','石景山区','海淀区','门头沟区','房山区','通州区','顺义区','昌平区','大兴区','怀柔区','平谷区']},		   
{name:'丰台区', areaList:['东城区','西城区','崇文区','宣武区','朝阳区','丰台区','石景山区','海淀区','门头沟区','房山区','通州区','顺义区','昌平区','大兴区','怀柔区','平谷区']},
{name:'石景山区', areaList:['东城区','西城区','崇文区','宣武区','朝阳区','丰台区','石景山区','海淀区','门头沟区','房山区','通州区','顺义区','昌平区','大兴区','怀柔区','平谷区']},		   
{name:'海淀区', areaList:['东城区','西城区','崇文区','宣武区','朝阳区','丰台区','石景山区','海淀区','门头沟区','房山区','通州区','顺义区','昌平区','大兴区','怀柔区','平谷区']},		   
{name:'崇文区', areaList:['东城区','西城区','崇文区','宣武区','朝阳区','丰台区','石景山区','海淀区','门头沟区','房山区','通州区','顺义区','昌平区','大兴区','怀柔区','平谷区']},		   
{name:'门头沟区', areaList:['东城区','西城区','崇文区','宣武区','朝阳区','丰台区','石景山区','海淀区','门头沟区','房山区','通州区','顺义区','昌平区','大兴区','怀柔区','平谷区']},		   
{name:'朝阳区', areaList:['东城区','西城区','崇文区','宣武区','朝阳区','丰台区','石景山区','海淀区','门头沟区','房山区','通州区','顺义区','昌平区','大兴区','怀柔区','平谷区']},		   
{name:'房山区', areaList:['东城区','西城区','崇文区','宣武区','朝阳区','丰台区','石景山区','海淀区','门头沟区','房山区','通州区','顺义区','昌平区','大兴区','怀柔区','平谷区']},		   
{name:'通州区', areaList:['东城区','西城区','崇文区','宣武区','朝阳区','丰台区','石景山区','海淀区','门头沟区','房山区','通州区','顺义区','昌平区','大兴区','怀柔区','平谷区']},		   
{name:'顺义区', areaList:['东城区','西城区','崇文区','宣武区','朝阳区','丰台区','石景山区','海淀区','门头沟区','房山区','通州区','顺义区','昌平区','大兴区','怀柔区','平谷区']},		   
{name:'昌平区', areaList:['东城区','西城区','崇文区','宣武区','朝阳区','丰台区','石景山区','海淀区','门头沟区','房山区','通州区','顺义区','昌平区','大兴区','怀柔区','平谷区']},		   
{name:'大兴区', areaList:['东城区','西城区','崇文区','宣武区','朝阳区','丰台区','石景山区','海淀区','门头沟区','房山区','通州区','顺义区','昌平区','大兴区','怀柔区','平谷区']},		   
{name:'怀柔区', areaList:['东城区','西城区','崇文区','宣武区','朝阳区','丰台区','石景山区','海淀区','门头沟区','房山区','通州区','顺义区','昌平区','大兴区','怀柔区','平谷区']},		   
{name:'平谷区', areaList:['东城区','西城区','崇文区','宣武区','朝阳区','丰台区','石景山区','海淀区','门头沟区','房山区','通州区','顺义区','昌平区','大兴区','怀柔区','平谷区']},		   
{name:'密云县', areaList:['密云县','延庆县']},
{name:'延庆县', areaList:['密云县','延庆县']}
]},
{name:'上海', cityList:[		   
{name:'黄浦区', areaList:['黄浦区','卢湾区','徐汇区','长宁区','静安区','普陀区','闸北区','虹口区','杨浦区','闵行区','宝山区','嘉定区','浦东新区','金山区','松江区','青浦区','南汇区','奉贤区']},
{name:'卢湾区', areaList:['黄浦区','卢湾区','徐汇区','长宁区','静安区','普陀区','闸北区','虹口区','杨浦区','闵行区','宝山区','嘉定区','浦东新区','金山区','松江区','青浦区','南汇区','奉贤区']},
{name:'徐汇区', areaList:['黄浦区','卢湾区','徐汇区','长宁区','静安区','普陀区','闸北区','虹口区','杨浦区','闵行区','宝山区','嘉定区','浦东新区','金山区','松江区','青浦区','南汇区','奉贤区']},
{name:'长宁区', areaList:['黄浦区','卢湾区','徐汇区','长宁区','静安区','普陀区','闸北区','虹口区','杨浦区','闵行区','宝山区','嘉定区','浦东新区','金山区','松江区','青浦区','南汇区','奉贤区']},
{name:'静安区', areaList:['黄浦区','卢湾区','徐汇区','长宁区','静安区','普陀区','闸北区','虹口区','杨浦区','闵行区','宝山区','嘉定区','浦东新区','金山区','松江区','青浦区','南汇区','奉贤区']},
{name:'普陀区', areaList:['黄浦区','卢湾区','徐汇区','长宁区','静安区','普陀区','闸北区','虹口区','杨浦区','闵行区','宝山区','嘉定区','浦东新区','金山区','松江区','青浦区','南汇区','奉贤区']},
{name:'闸北区', areaList:['黄浦区','卢湾区','徐汇区','长宁区','静安区','普陀区','闸北区','虹口区','杨浦区','闵行区','宝山区','嘉定区','浦东新区','金山区','松江区','青浦区','南汇区','奉贤区']},
{name:'虹口区', areaList:['黄浦区','卢湾区','徐汇区','长宁区','静安区','普陀区','闸北区','虹口区','杨浦区','闵行区','宝山区','嘉定区','浦东新区','金山区','松江区','青浦区','南汇区','奉贤区']},
{name:'杨浦区', areaList:['黄浦区','卢湾区','徐汇区','长宁区','静安区','普陀区','闸北区','虹口区','杨浦区','闵行区','宝山区','嘉定区','浦东新区','金山区','松江区','青浦区','南汇区','奉贤区']},
{name:'闵行区', areaList:['黄浦区','卢湾区','徐汇区','长宁区','静安区','普陀区','闸北区','虹口区','杨浦区','闵行区','宝山区','嘉定区','浦东新区','金山区','松江区','青浦区','南汇区','奉贤区']},
{name:'宝山区', areaList:['黄浦区','卢湾区','徐汇区','长宁区','静安区','普陀区','闸北区','虹口区','杨浦区','闵行区','宝山区','嘉定区','浦东新区','金山区','松江区','青浦区','南汇区','奉贤区']},
{name:'嘉定区', areaList:['黄浦区','卢湾区','徐汇区','长宁区','静安区','普陀区','闸北区','虹口区','杨浦区','闵行区','宝山区','嘉定区','浦东新区','金山区','松江区','青浦区','南汇区','奉贤区']},
{name:'浦东新区', areaList:['黄浦区','卢湾区','徐汇区','长宁区','静安区','普陀区','闸北区','虹口区','杨浦区','闵行区','宝山区','嘉定区','浦东新区','金山区','松江区','青浦区','南汇区','奉贤区']},
{name:'金山区', areaList:['黄浦区','卢湾区','徐汇区','长宁区','静安区','普陀区','闸北区','虹口区','杨浦区','闵行区','宝山区','嘉定区','浦东新区','金山区','松江区','青浦区','南汇区','奉贤区']},
{name:'松江区', areaList:['黄浦区','卢湾区','徐汇区','长宁区','静安区','普陀区','闸北区','虹口区','杨浦区','闵行区','宝山区','嘉定区','浦东新区','金山区','松江区','青浦区','南汇区','奉贤区']},
{name:'青浦区', areaList:['黄浦区','卢湾区','徐汇区','长宁区','静安区','普陀区','闸北区','虹口区','杨浦区','闵行区','宝山区','嘉定区','浦东新区','金山区','松江区','青浦区','南汇区','奉贤区']},
{name:'南汇区', areaList:['黄浦区','卢湾区','徐汇区','长宁区','静安区','普陀区','闸北区','虹口区','杨浦区','闵行区','宝山区','嘉定区','浦东新区','金山区','松江区','青浦区','南汇区','奉贤区']},
{name:'奉贤区', areaList:['黄浦区','卢湾区','徐汇区','长宁区','静安区','普陀区','闸北区','虹口区','杨浦区','闵行区','宝山区','嘉定区','浦东新区','金山区','松江区','青浦区','南汇区','奉贤区']},	   
{name:'崇明县', areaList:['崇明县']}
]},
{name:'天津', cityList:[		   
{name:'和平区', areaList:['和平区','河东区','河西区','南开区','河北区','红桥区','塘沽区','汉沽区','大港区','东丽区','西青区','津南区','北辰区','武清区','宝坻区']},
{name:'河东区', areaList:['和平区','河东区','河西区','南开区','河北区','红桥区','塘沽区','汉沽区','大港区','东丽区','西青区','津南区','北辰区','武清区','宝坻区']},
{name:'河西区', areaList:['和平区','河东区','河西区','南开区','河北区','红桥区','塘沽区','汉沽区','大港区','东丽区','西青区','津南区','北辰区','武清区','宝坻区']},
{name:'南开区', areaList:['和平区','河东区','河西区','南开区','河北区','红桥区','塘沽区','汉沽区','大港区','东丽区','西青区','津南区','北辰区','武清区','宝坻区']},
{name:'河北区', areaList:['和平区','河东区','河西区','南开区','河北区','红桥区','塘沽区','汉沽区','大港区','东丽区','西青区','津南区','北辰区','武清区','宝坻区']},
{name:'红桥区', areaList:['和平区','河东区','河西区','南开区','河北区','红桥区','塘沽区','汉沽区','大港区','东丽区','西青区','津南区','北辰区','武清区','宝坻区']},
{name:'塘沽区', areaList:['和平区','河东区','河西区','南开区','河北区','红桥区','塘沽区','汉沽区','大港区','东丽区','西青区','津南区','北辰区','武清区','宝坻区']},
{name:'汉沽区', areaList:['和平区','河东区','河西区','南开区','河北区','红桥区','塘沽区','汉沽区','大港区','东丽区','西青区','津南区','北辰区','武清区','宝坻区']},
{name:'大港区', areaList:['和平区','河东区','河西区','南开区','河北区','红桥区','塘沽区','汉沽区','大港区','东丽区','西青区','津南区','北辰区','武清区','宝坻区']},
{name:'东丽区', areaList:['和平区','河东区','河西区','南开区','河北区','红桥区','塘沽区','汉沽区','大港区','东丽区','西青区','津南区','北辰区','武清区','宝坻区']},
{name:'西青区', areaList:['和平区','河东区','河西区','南开区','河北区','红桥区','塘沽区','汉沽区','大港区','东丽区','西青区','津南区','北辰区','武清区','宝坻区']},
{name:'津南区', areaList:['和平区','河东区','河西区','南开区','河北区','红桥区','塘沽区','汉沽区','大港区','东丽区','西青区','津南区','北辰区','武清区','宝坻区']},
{name:'北辰区', areaList:['和平区','河东区','河西区','南开区','河北区','红桥区','塘沽区','汉沽区','大港区','东丽区','西青区','津南区','北辰区','武清区','宝坻区']},
{name:'武清区', areaList:['和平区','河东区','河西区','南开区','河北区','红桥区','塘沽区','汉沽区','大港区','东丽区','西青区','津南区','北辰区','武清区','宝坻区']},
{name:'宝坻区', areaList:['和平区','河东区','河西区','南开区','河北区','红桥区','塘沽区','汉沽区','大港区','东丽区','西青区','津南区','北辰区','武清区','宝坻区']},
{name:'宁河县', areaList:['宁河县','静海县','蓟县']},
{name:'静海县', areaList:['宁河县','静海县','蓟县']},
{name:'蓟县', areaList:['宁河县','静海县','蓟县']}
]},
{name:'重庆', cityList:[		   
{name:'万州区', areaList:['万州区','涪陵区','渝中区','大渡口区','江北区','沙坪坝区','九龙坡区','南岸区','北碚区','万盛区','双桥区','渝北区','巴南区','黔江区','长寿区']},
{name:'涪陵区', areaList:['万州区','涪陵区','渝中区','大渡口区','江北区','沙坪坝区','九龙坡区','南岸区','北碚区','万盛区','双桥区','渝北区','巴南区','黔江区','长寿区']},
{name:'渝中区', areaList:['万州区','涪陵区','渝中区','大渡口区','江北区','沙坪坝区','九龙坡区','南岸区','北碚区','万盛区','双桥区','渝北区','巴南区','黔江区','长寿区']},
{name:'大渡口区', areaList:['万州区','涪陵区','渝中区','大渡口区','江北区','沙坪坝区','九龙坡区','南岸区','北碚区','万盛区','双桥区','渝北区','巴南区','黔江区','长寿区']},
{name:'江北区', areaList:['万州区','涪陵区','渝中区','大渡口区','江北区','沙坪坝区','九龙坡区','南岸区','北碚区','万盛区','双桥区','渝北区','巴南区','黔江区','长寿区']},
{name:'沙坪坝区', areaList:['万州区','涪陵区','渝中区','大渡口区','江北区','沙坪坝区','九龙坡区','南岸区','北碚区','万盛区','双桥区','渝北区','巴南区','黔江区','长寿区']},
{name:'九龙坡区', areaList:['万州区','涪陵区','渝中区','大渡口区','江北区','沙坪坝区','九龙坡区','南岸区','北碚区','万盛区','双桥区','渝北区','巴南区','黔江区','长寿区']},
{name:'南岸区', areaList:['万州区','涪陵区','渝中区','大渡口区','江北区','沙坪坝区','九龙坡区','南岸区','北碚区','万盛区','双桥区','渝北区','巴南区','黔江区','长寿区']},
{name:'北碚区', areaList:['万州区','涪陵区','渝中区','大渡口区','江北区','沙坪坝区','九龙坡区','南岸区','北碚区','万盛区','双桥区','渝北区','巴南区','黔江区','长寿区']},
{name:'万盛区', areaList:['万州区','涪陵区','渝中区','大渡口区','江北区','沙坪坝区','九龙坡区','南岸区','北碚区','万盛区','双桥区','渝北区','巴南区','黔江区','长寿区']},
{name:'双桥区', areaList:['万州区','涪陵区','渝中区','大渡口区','江北区','沙坪坝区','九龙坡区','南岸区','北碚区','万盛区','双桥区','渝北区','巴南区','黔江区','长寿区']},
{name:'渝北区', areaList:['万州区','涪陵区','渝中区','大渡口区','江北区','沙坪坝区','九龙坡区','南岸区','北碚区','万盛区','双桥区','渝北区','巴南区','黔江区','长寿区']},
{name:'巴南区', areaList:['万州区','涪陵区','渝中区','大渡口区','江北区','沙坪坝区','九龙坡区','南岸区','北碚区','万盛区','双桥区','渝北区','巴南区','黔江区','长寿区']},
{name:'黔江区', areaList:['万州区','涪陵区','渝中区','大渡口区','江北区','沙坪坝区','九龙坡区','南岸区','北碚区','万盛区','双桥区','渝北区','巴南区','黔江区','长寿区']},
{name:'长寿区', areaList:['万州区','涪陵区','渝中区','大渡口区','江北区','沙坪坝区','九龙坡区','南岸区','北碚区','万盛区','双桥区','渝北区','巴南区','黔江区','长寿区']},
{name:'綦江县', areaList:['綦江县','潼南县','铜梁县','大足县','荣昌县','璧山县','梁平县','城口县','丰都县','垫江县','武隆县','忠县','开县','云阳县','奉节县','巫山县','巫溪县','石柱土家族自治县','秀山土家族苗族自治县','酉阳土家族苗族自治县','彭水苗族土家族自治县']},
{name:'潼南县', areaList:['綦江县','潼南县','铜梁县','大足县','荣昌县','璧山县','梁平县','城口县','丰都县','垫江县','武隆县','忠县','开县','云阳县','奉节县','巫山县','巫溪县','石柱土家族自治县','秀山土家族苗族自治县','酉阳土家族苗族自治县','彭水苗族土家族自治县']},
{name:'铜梁县', areaList:['綦江县','潼南县','铜梁县','大足县','荣昌县','璧山县','梁平县','城口县','丰都县','垫江县','武隆县','忠县','开县','云阳县','奉节县','巫山县','巫溪县','石柱土家族自治县','秀山土家族苗族自治县','酉阳土家族苗族自治县','彭水苗族土家族自治县']},
{name:'大足县', areaList:['綦江县','潼南县','铜梁县','大足县','荣昌县','璧山县','梁平县','城口县','丰都县','垫江县','武隆县','忠县','开县','云阳县','奉节县','巫山县','巫溪县','石柱土家族自治县','秀山土家族苗族自治县','酉阳土家族苗族自治县','彭水苗族土家族自治县']},
{name:'荣昌县', areaList:['綦江县','潼南县','铜梁县','大足县','荣昌县','璧山县','梁平县','城口县','丰都县','垫江县','武隆县','忠县','开县','云阳县','奉节县','巫山县','巫溪县','石柱土家族自治县','秀山土家族苗族自治县','酉阳土家族苗族自治县','彭水苗族土家族自治县']},
{name:'璧山县', areaList:['綦江县','潼南县','铜梁县','大足县','荣昌县','璧山县','梁平县','城口县','丰都县','垫江县','武隆县','忠县','开县','云阳县','奉节县','巫山县','巫溪县','石柱土家族自治县','秀山土家族苗族自治县','酉阳土家族苗族自治县','彭水苗族土家族自治县']},
{name:'梁平县', areaList:['綦江县','潼南县','铜梁县','大足县','荣昌县','璧山县','梁平县','城口县','丰都县','垫江县','武隆县','忠县','开县','云阳县','奉节县','巫山县','巫溪县','石柱土家族自治县','秀山土家族苗族自治县','酉阳土家族苗族自治县','彭水苗族土家族自治县']},
{name:'城口县', areaList:['綦江县','潼南县','铜梁县','大足县','荣昌县','璧山县','梁平县','城口县','丰都县','垫江县','武隆县','忠县','开县','云阳县','奉节县','巫山县','巫溪县','石柱土家族自治县','秀山土家族苗族自治县','酉阳土家族苗族自治县','彭水苗族土家族自治县']},
{name:'丰都县', areaList:['綦江县','潼南县','铜梁县','大足县','荣昌县','璧山县','梁平县','城口县','丰都县','垫江县','武隆县','忠县','开县','云阳县','奉节县','巫山县','巫溪县','石柱土家族自治县','秀山土家族苗族自治县','酉阳土家族苗族自治县','彭水苗族土家族自治县']},
{name:'垫江县', areaList:['綦江县','潼南县','铜梁县','大足县','荣昌县','璧山县','梁平县','城口县','丰都县','垫江县','武隆县','忠县','开县','云阳县','奉节县','巫山县','巫溪县','石柱土家族自治县','秀山土家族苗族自治县','酉阳土家族苗族自治县','彭水苗族土家族自治县']},
{name:'武隆县', areaList:['綦江县','潼南县','铜梁县','大足县','荣昌县','璧山县','梁平县','城口县','丰都县','垫江县','武隆县','忠县','开县','云阳县','奉节县','巫山县','巫溪县','石柱土家族自治县','秀山土家族苗族自治县','酉阳土家族苗族自治县','彭水苗族土家族自治县']},
{name:'忠县', areaList:['綦江县','潼南县','铜梁县','大足县','荣昌县','璧山县','梁平县','城口县','丰都县','垫江县','武隆县','忠县','开县','云阳县','奉节县','巫山县','巫溪县','石柱土家族自治县','秀山土家族苗族自治县','酉阳土家族苗族自治县','彭水苗族土家族自治县']},
{name:'开县', areaList:['綦江县','潼南县','铜梁县','大足县','荣昌县','璧山县','梁平县','城口县','丰都县','垫江县','武隆县','忠县','开县','云阳县','奉节县','巫山县','巫溪县','石柱土家族自治县','秀山土家族苗族自治县','酉阳土家族苗族自治县','彭水苗族土家族自治县']},
{name:'云阳县', areaList:['綦江县','潼南县','铜梁县','大足县','荣昌县','璧山县','梁平县','城口县','丰都县','垫江县','武隆县','忠县','开县','云阳县','奉节县','巫山县','巫溪县','石柱土家族自治县','秀山土家族苗族自治县','酉阳土家族苗族自治县','彭水苗族土家族自治县']},
{name:'奉节县', areaList:['綦江县','潼南县','铜梁县','大足县','荣昌县','璧山县','梁平县','城口县','丰都县','垫江县','武隆县','忠县','开县','云阳县','奉节县','巫山县','巫溪县','石柱土家族自治县','秀山土家族苗族自治县','酉阳土家族苗族自治县','彭水苗族土家族自治县']},
{name:'巫山县', areaList:['綦江县','潼南县','铜梁县','大足县','荣昌县','璧山县','梁平县','城口县','丰都县','垫江县','武隆县','忠县','开县','云阳县','奉节县','巫山县','巫溪县','石柱土家族自治县','秀山土家族苗族自治县','酉阳土家族苗族自治县','彭水苗族土家族自治县']},
{name:'巫溪县', areaList:['綦江县','潼南县','铜梁县','大足县','荣昌县','璧山县','梁平县','城口县','丰都县','垫江县','武隆县','忠县','开县','云阳县','奉节县','巫山县','巫溪县','石柱土家族自治县','秀山土家族苗族自治县','酉阳土家族苗族自治县','彭水苗族土家族自治县']},
{name:'石柱土家族自治县', areaList:['綦江县','潼南县','铜梁县','大足县','荣昌县','璧山县','梁平县','城口县','丰都县','垫江县','武隆县','忠县','开县','云阳县','奉节县','巫山县','巫溪县','石柱土家族自治县','秀山土家族苗族自治县','酉阳土家族苗族自治县','彭水苗族土家族自治县']},
{name:'秀山土家族苗族自治县', areaList:['綦江县','潼南县','铜梁县','大足县','荣昌县','璧山县','梁平县','城口县','丰都县','垫江县','武隆县','忠县','开县','云阳县','奉节县','巫山县','巫溪县','石柱土家族自治县','秀山土家族苗族自治县','酉阳土家族苗族自治县','彭水苗族土家族自治县']},
{name:'酉阳土家族苗族自治县', areaList:['綦江县','潼南县','铜梁县','大足县','荣昌县','璧山县','梁平县','城口县','丰都县','垫江县','武隆县','忠县','开县','云阳县','奉节县','巫山县','巫溪县','石柱土家族自治县','秀山土家族苗族自治县','酉阳土家族苗族自治县','彭水苗族土家族自治县']},
{name:'彭水苗族土家族自治县', areaList:['綦江县','潼南县','铜梁县','大足县','荣昌县','璧山县','梁平县','城口县','丰都县','垫江县','武隆县','忠县','开县','云阳县','奉节县','巫山县','巫溪县','石柱土家族自治县','秀山土家族苗族自治县','酉阳土家族苗族自治县','彭水苗族土家族自治县']},
{name:'江津市', areaList:['江津市','合川市','永川市','南川市']},
{name:'合川市', areaList:['江津市','合川市','永川市','南川市']},
{name:'永川市', areaList:['江津市','合川市','永川市','南川市']},
{name:'南川市', areaList:['江津市','合川市','永川市','南川市']}
]},
{name:'四川', cityList:[		   
{name:'成都市', areaList:['市辖区','锦江区','青羊区','金牛区','武侯区','成华区','龙泉驿区','青白江区','新都区','温江县','金堂县','双流县','郫　县','大邑县','蒲江县','新津县','都江堰市','彭州市','邛崃市','崇州市']},		   
{name:'自贡市', areaList:['市辖区','自流井区','贡井区','大安区','沿滩区','荣　县','富顺县']},		   
{name:'攀枝花市', areaList:['市辖区','东　区','西　区','仁和区','米易县','盐边县']},		   
{name:'泸州市', areaList:['市辖区','江阳区','纳溪区','龙马潭区','泸　县','合江县','叙永县','古蔺县']},		   
{name:'德阳市', areaList:['市辖区','旌阳区','中江县','罗江县','广汉市','什邡市','绵竹市']},		   
{name:'绵阳市', areaList:['市辖区','涪城区','游仙区','三台县','盐亭县','安　县','梓潼县','北川羌族自治县','平武县','江油市']},		   
{name:'广元市', areaList:['市辖区','市中区','元坝区','朝天区','旺苍县','青川县','剑阁县','苍溪县']},		   
{name:'遂宁市', areaList:['市辖区','船山区','安居区','蓬溪县','射洪县','大英县']},		   
{name:'内江市', areaList:['市辖区','市中区','东兴区','威远县','资中县','隆昌县']},		   
{name:'乐山市', areaList:['市辖区','市中区','沙湾区','五通桥区','金口河区','犍为县','井研县','夹江县','沐川县','峨边彝族自治县','马边彝族自治县','峨眉山市']},		   
{name:'南充市', areaList:['市辖区','顺庆区','高坪区','嘉陵区','南部县','营山县','蓬安县','仪陇县','西充县','阆中市']},		   
{name:'眉山市', areaList:['市辖区','东坡区','仁寿县','彭山县','洪雅县','丹棱县','青神县']},		   
{name:'宜宾市', areaList:['市辖区','翠屏区','宜宾县','南溪县','江安县','长宁县','高　县','珙　县','筠连县','兴文县','屏山县']},		   
{name:'广安市', areaList:['市辖区','广安区','岳池县','武胜县','邻水县','华莹市']},		   
{name:'达州市', areaList:['市辖区','通川区','达　县','宣汉县','开江县','大竹县','渠　县','万源市']},		   
{name:'雅安市', areaList:['市辖区','雨城区','名山县','荥经县','汉源县','石棉县','天全县','芦山县','宝兴县']},		   
{name:'巴中市', areaList:['市辖区','巴州区','通江县','南江县','平昌县']},		   
{name:'资阳市', areaList:['市辖区','雁江区','安岳县','乐至县','简阳市']},		   
{name:'阿坝藏族羌族自治州', areaList:['汶川县','理　县','茂　县','松潘县','九寨沟县','金川县','小金县','黑水县','马尔康县','壤塘县','阿坝县','若尔盖县','红原县']},		   
{name:'甘孜藏族自治州', areaList:['康定县','泸定县','丹巴县','九龙县','雅江县','道孚县','炉霍县','甘孜县','新龙县','德格县','白玉县','石渠县','色达县','理塘县','巴塘县','乡城县','稻城县','得荣县']},		   
{name:'凉山彝族自治州', areaList:['西昌市','木里藏族自治县','盐源县','德昌县','会理县','会东县','宁南县','普格县','布拖县','金阳县','昭觉县','喜德县','冕宁县','越西县','甘洛县','美姑县','雷波县']}
]},
{name:'贵州', cityList:[		   
{name:'贵阳市', areaList:['市辖区','南明区','云岩区','花溪区','乌当区','白云区','小河区','开阳县','息烽县','修文县','清镇市']},		   
{name:'六盘水市', areaList:['钟山区','六枝特区','水城县','盘　县']},		   
{name:'遵义市', areaList:['市辖区','红花岗区','汇川区','遵义县','桐梓县','绥阳县','正安县','道真仡佬族苗族自治县','务川仡佬族苗族自治县','凤冈县','湄潭县','余庆县','习水县','赤水市','仁怀市']},		   
{name:'安顺市', areaList:['市辖区','西秀区','平坝县','普定县','镇宁布依族苗族自治县','关岭布依族苗族自治县','紫云苗族布依族自治县']},		   
{name:'铜仁地区', areaList:['铜仁市','江口县','玉屏侗族自治县','石阡县','思南县','印江土家族苗族自治县','德江县','沿河土家族自治县','松桃苗族自治县','万山特区']},		   
{name:'黔西南布依族苗族自治州', areaList:['兴义市','兴仁县','普安县','晴隆县','贞丰县','望谟县','册亨县','安龙县']},		   
{name:'毕节地区', areaList:['毕节市','大方县','黔西县','金沙县','织金县','纳雍县','威宁彝族回族苗族自治县','赫章县']},		   
{name:'黔东南苗族侗族自治州', areaList:['凯里市','黄平县','施秉县','三穗县','镇远县','岑巩县','天柱县','锦屏县','剑河县','台江县','黎平县','榕江县','从江县','雷山县','麻江县','丹寨县']},		   
{name:'黔南布依族苗族自治州', areaList:['都匀市','福泉市','荔波县','贵定县','瓮安县','独山县','平塘县','罗甸县','长顺县','龙里县','惠水县','三都水族自治县']}
]},
{name:'云南', cityList:[		   
{name:'昆明市', areaList:['市辖区','五华区','盘龙区','官渡区','西山区','东川区','呈贡县','晋宁县','富民县','宜良县','石林彝族自治县','嵩明县','禄劝彝族苗族自治县','寻甸回族彝族自治县','安宁市']},		   
{name:'曲靖市', areaList:['市辖区','麒麟区','马龙县','陆良县','师宗县','罗平县','富源县','会泽县','沾益县','宣威市']},		   
{name:'玉溪市', areaList:['市辖区','红塔区','江川县','澄江县','通海县','华宁县','易门县','峨山彝族自治县','新平彝族傣族自治县','元江哈尼族彝族傣族自治县']},		   
{name:'保山市', areaList:['市辖区','隆阳区','施甸县','腾冲县','龙陵县','昌宁县']},		   
{name:'昭通市', areaList:['市辖区','昭阳区','鲁甸县','巧家县','盐津县','大关县','永善县','绥江县','镇雄县','彝良县','威信县','水富县']},		   
{name:'丽江市', areaList:['市辖区','古城区','玉龙纳西族自治县','永胜县','华坪县','宁蒗彝族自治县']},		   
{name:'思茅市', areaList:['市辖区','翠云区','普洱哈尼族彝族自治县','墨江哈尼族自治县','景东彝族自治县','景谷傣族彝族自治县','镇沅彝族哈尼族拉祜族自治县','江城哈尼族彝族自治县','孟连傣族拉祜族佤族自治县','澜沧拉祜族自治县','西盟佤族自治县']},		   
{name:'临沧市', areaList:['市辖区','临翔区','凤庆县','云　县','永德县','镇康县','双江拉祜族佤族布朗族傣族自治县','耿马傣族佤族自治县','沧源佤族自治县']},		   
{name:'楚雄彝族自治州', areaList:['楚雄市','双柏县','牟定县','南华县','姚安县','大姚县','永仁县','元谋县','武定县','禄丰县']},		   
{name:'红河哈尼族彝族自治州', areaList:['个旧市','开远市','蒙自县','屏边苗族自治县','建水县','石屏县','弥勒县','泸西县','元阳县','红河县','金平苗族瑶族傣族自治县','绿春县','河口瑶族自治县']},		   
{name:'文山壮族苗族自治州', areaList:['文山县','砚山县','西畴县','麻栗坡县','马关县','丘北县','广南县','富宁县']},		   
{name:'西双版纳傣族自治州', areaList:['景洪市','勐海县','勐腊县']},		   
{name:'大理白族自治州', areaList:['大理市','漾濞彝族自治县','祥云县','宾川县','弥渡县','南涧彝族自治县','巍山彝族回族自治县','永平县','云龙县','洱源县','剑川县','鹤庆县']},		   
{name:'德宏傣族景颇族自治州', areaList:['瑞丽市','潞西市','梁河县','盈江县','陇川县']},		   
{name:'怒江傈僳族自治州', areaList:['泸水县','福贡县','贡山独龙族怒族自治县','兰坪白族普米族自治县']},		   
{name:'迪庆藏族自治州', areaList:['香格里拉县','德钦县','维西傈僳族自治县']}
]},
{name:'西藏', cityList:[		   
{name:'拉萨市', areaList:['市辖区','城关区','林周县','当雄县','尼木县','曲水县','堆龙德庆县','达孜县','墨竹工卡县']},		   
{name:'昌都地区', areaList:['昌都县','江达县','贡觉县','类乌齐县','丁青县','察雅县','八宿县','左贡县','芒康县','洛隆县','边坝县']},		   
{name:'山南地区', areaList:['乃东县','扎囊县','贡嘎县','桑日县','琼结县','曲松县','措美县','洛扎县','加查县','隆子县','错那县','浪卡子县']},		   
{name:'日喀则地区', areaList:['日喀则市','南木林县','江孜县','定日县','萨迦县','拉孜县','昂仁县','谢通门县','白朗县','仁布县','康马县','定结县','仲巴县','亚东县','吉隆县','聂拉木县','萨嘎县','岗巴县']},		   
{name:'那曲地区', areaList:['那曲县','嘉黎县','比如县','聂荣县','安多县','申扎县','索　县','班戈县','巴青县','尼玛县']},		   
{name:'阿里地区', areaList:['普兰县','札达县','噶尔县','日土县','革吉县','改则县','措勤县']},		   
{name:'林芝地区', areaList:['林芝县','工布江达县','米林县','墨脱县','波密县','察隅县','朗　县']}
]},
{name:'河南', cityList:[		   
{name:'郑州市', areaList:['市辖区','中原区','二七区','管城回族区','金水区','上街区','邙山区','中牟县','巩义市','荥阳市','新密市','新郑市','登封市']},		   
{name:'开封市', areaList:['市辖区','龙亭区','顺河回族区','鼓楼区','南关区','郊　区','杞　县','通许县','尉氏县','开封县','兰考县']},		   
{name:'洛阳市', areaList:['市辖区','老城区','西工区','廛河回族区','涧西区','吉利区','洛龙区','孟津县','新安县','栾川县','嵩　县','汝阳县','宜阳县','洛宁县','伊川县','偃师市']},		   
{name:'平顶山市', areaList:['市辖区','新华区','卫东区','石龙区','湛河区','宝丰县','叶　县','鲁山县','郏　县','舞钢市','汝州市']},		   
{name:'安阳市', areaList:['市辖区','文峰区','北关区','殷都区','龙安区','安阳县','汤阴县','滑　县','内黄县','林州市']},		   
{name:'鹤壁市', areaList:['市辖区','鹤山区','山城区','淇滨区','浚　县','淇　县']},		   
{name:'新乡市', areaList:['市辖区','红旗区','卫滨区','凤泉区','牧野区','新乡县','获嘉县','原阳县','延津县','封丘县','长垣县','卫辉市','辉县市']},		   
{name:'焦作市', areaList:['市辖区','解放区','中站区','马村区','山阳区','修武县','博爱县','武陟县','温县','济源市','沁阳市','孟州市']},		   
{name:'濮阳市', areaList:['市辖区','华龙区','清丰县','南乐县','范　县','台前县','濮阳县']},		   
{name:'许昌市', areaList:['市辖区','魏都区','许昌县','鄢陵县','襄城县','禹州市','长葛市']},		   
{name:'漯河市', areaList:['市辖区','源汇区','郾城区','召陵区','舞阳县','临颍县']},		   
{name:'三门峡市', areaList:['市辖区','湖滨区','渑池县','陕　县','卢氏县','义马市','灵宝市']},		   
{name:'南阳市', areaList:['市辖区','宛城区','卧龙区','南召县','方城县','西峡县','镇平县','内乡县','淅川县','社旗县','唐河县','新野县','桐柏县','邓州市']},		   
{name:'商丘市', areaList:['市辖区','梁园区','睢阳区','民权县','睢　县','宁陵县','柘城县','虞城县','夏邑县','永城市']},		   
{name:'信阳市', areaList:['市辖区','师河区','平桥区','罗山县','光山县','新　县','商城县','固始县','潢川县','淮滨县','息　县']},		   
{name:'周口市', areaList:['市辖区','川汇区','扶沟县','西华县','商水县','沈丘县','郸城县','淮阳县','太康县','鹿邑县','项城市']},		   
{name:'驻马店市', areaList:['市辖区','驿城区','西平县','上蔡县','平舆县','正阳县','确山县','泌阳县','汝南县','遂平县','新蔡县']}
]},
{name:'湖北', cityList:[		   
{name:'武汉市', areaList:['市辖区','江岸区','江汉区','乔口区','汉阳区','武昌区','青山区','洪山区','东西湖区','汉南区','蔡甸区','江夏区','黄陂区','新洲区']},		   
{name:'黄石市', areaList:['市辖区','黄石港区','西塞山区','下陆区','铁山区','阳新县','大冶市']},		   
{name:'十堰市', areaList:['市辖区','茅箭区','张湾区','郧　县','郧西县','竹山县','竹溪县','房　县','丹江口市']},		   
{name:'宜昌市', areaList:['市辖区','西陵区','伍家岗区','点军区','猇亭区','夷陵区','远安县','兴山县','秭归县','长阳土家族自治县','五峰土家族自治县','宜都市','当阳市','枝江市']},		   
{name:'襄樊市', areaList:['市辖区','襄城区','樊城区','襄阳区','南漳县','谷城县','保康县','老河口市','枣阳市','宜城市']},		   
{name:'鄂州市', areaList:['市辖区','梁子湖区','华容区','鄂城区']},		   
{name:'荆门市', areaList:['市辖区','东宝区','掇刀区','京山县','沙洋县','钟祥市']},		   
{name:'孝感市', areaList:['市辖区','孝南区','孝昌县','大悟县','云梦县','应城市','安陆市','汉川市']},		   
{name:'荆州市', areaList:['市辖区','沙市区','荆州区','公安县','监利县','江陵县','石首市','洪湖市','松滋市']},		   
{name:'黄冈市', areaList:['市辖区','黄州区','团风县','红安县','罗田县','英山县','浠水县','蕲春县','黄梅县','麻城市','武穴市']},		   
{name:'咸宁市', areaList:['市辖区','咸安区','嘉鱼县','通城县','崇阳县','通山县','赤壁市']},		   
{name:'随州市', areaList:['市辖区','曾都区','广水市']},		   
{name:'恩施土家族苗族自治州', areaList:['恩施市','利川市','建始县','巴东县','宣恩县','咸丰县','来凤县','鹤峰县']},		   
{name:'省直辖行政单位', areaList:['仙桃市','潜江市','天门市','神农架林区']}
]},
{name:'湖南', cityList:[		   
{name:'长沙市', areaList:['市辖区','芙蓉区','天心区','岳麓区','开福区','雨花区','长沙县','望城县','宁乡县','浏阳市']},		   
{name:'株洲市', areaList:['市辖区','荷塘区','芦淞区','石峰区','天元区','株洲县','攸　县','茶陵县','炎陵县','醴陵市']},		   
{name:'湘潭市', areaList:['市辖区','雨湖区','岳塘区','湘潭县','湘乡市','韶山市']},		   
{name:'衡阳市', areaList:['市辖区','珠晖区','雁峰区','石鼓区','蒸湘区','南岳区','衡阳县','衡南县','衡山县','衡东县','祁东县','耒阳市','常宁市']},		   
{name:'邵阳市', areaList:['市辖区','双清区','大祥区','北塔区','邵东县','新邵县','邵阳县','隆回县','洞口县','绥宁县','新宁县','城步苗族自治县','武冈市']},		   
{name:'岳阳市', areaList:['市辖区','岳阳楼区','云溪区','君山区','岳阳县','华容县','湘阴县','平江县','汨罗市','临湘市']},		   
{name:'常德市', areaList:['市辖区','武陵区','鼎城区','安乡县','汉寿县','澧　县','临澧县','桃源县','石门县','津市市']},		   
{name:'张家界市', areaList:['市辖区','永定区','武陵源区','慈利县','桑植县']},		   
{name:'益阳市', areaList:['市辖区','资阳区','赫山区','南　县','桃江县','安化县','沅江市']},		   
{name:'郴州市', areaList:['市辖区','北湖区','苏仙区','桂阳县','宜章县','永兴县','嘉禾县','临武县','汝城县','桂东县','安仁县','资兴市']},		   
{name:'永州市', areaList:['市辖区','芝山区','冷水滩区','祁阳县','东安县','双牌县','道　县','江永县','宁远县','蓝山县','新田县','江华瑶族自治县']},		   
{name:'怀化市', areaList:['市辖区','鹤城区','中方县','沅陵县','辰溪县','溆浦县','会同县','麻阳苗族自治县','新晃侗族自治县','芷江侗族自治县','靖州苗族侗族自治县','通道侗族自治县','洪江市']},		   
{name:'娄底市', areaList:['市辖区','娄星区','双峰县','新化县','冷水江市','涟源市']},		   
{name:'湘西土家族苗族自治州', areaList:['吉首市','泸溪县','凤凰县','花垣县','保靖县','古丈县','永顺县','龙山县']}
]},
{name:'广东', cityList:[		   
{name:'广州市', areaList:['市辖区','东山区','荔湾区','越秀区','海珠区','天河区','芳村区','白云区','黄埔区','番禺区','花都区','增城市','从化市']},		   
{name:'韶关市', areaList:['市辖区','武江区','浈江区','曲江区','始兴县','仁化县','翁源县','乳源瑶族自治县','新丰县','乐昌市','南雄市']},		   
{name:'深圳市', areaList:['市辖区','罗湖区','福田区','南山区','宝安区','龙岗区','盐田区']},		   
{name:'珠海市', areaList:['市辖区','香洲区','斗门区','金湾区']},		   
{name:'汕头市', areaList:['市辖区','龙湖区','金平区','濠江区','潮阳区','潮南区','澄海区','南澳县']},		   
{name:'佛山市', areaList:['市辖区','禅城区','南海区','顺德区','三水区','高明区']},		   
{name:'江门市', areaList:['市辖区','蓬江区','江海区','新会区','台山市','开平市','鹤山市','恩平市']},		   
{name:'湛江市', areaList:['市辖区','赤坎区','霞山区','坡头区','麻章区','遂溪县','徐闻县','廉江市','雷州市','吴川市']},		   
{name:'茂名市', areaList:['市辖区','茂南区','茂港区','电白县','高州市','化州市','信宜市']},		   
{name:'肇庆市', areaList:['市辖区','端州区','鼎湖区','广宁县','怀集县','封开县','德庆县','高要市','四会市']},		   
{name:'惠州市', areaList:['市辖区','惠城区','惠阳区','博罗县','惠东县','龙门县']},		   
{name:'梅州市', areaList:['市辖区','梅江区','梅　县','大埔县','丰顺县','五华县','平远县','蕉岭县','兴宁市']},		   
{name:'汕尾市', areaList:['市辖区','城　区','海丰县','陆河县','陆丰市']},		   
{name:'河源市', areaList:['市辖区','源城区','紫金县','龙川县','连平县','和平县','东源县']},		   
{name:'阳江市', areaList:['市辖区','江城区','阳西县','阳东县','阳春市']},		   
{name:'清远市', areaList:['市辖区','清城区','佛冈县','阳山县','连山壮族瑶族自治县','连南瑶族自治县','清新县','英德市','连州市']},		   
{name:'东莞市', areaList:['东莞市']},		   
{name:'中山市', areaList:['中山市']},		   
{name:'潮州市', areaList:['市辖区','湘桥区','潮安县','饶平县']},		   
{name:'揭阳市', areaList:['市辖区','榕城区','揭东县','揭西县','惠来县','普宁市']},		   
{name:'云浮市', areaList:['市辖区','云城区','新兴县','郁南县','云安县','罗定市']}
]},
{name:'广西', cityList:[		   
{name:'南宁市', areaList:['市辖区','兴宁区','青秀区','江南区','西乡塘区','良庆区','邕宁区','武鸣县','隆安县','马山县','上林县','宾阳县','横　县']},		   
{name:'柳州市', areaList:['市辖区','城中区','鱼峰区','柳南区','柳北区','柳江县','柳城县','鹿寨县','融安县','融水苗族自治县','三江侗族自治县']},		   
{name:'桂林市', areaList:['市辖区','秀峰区','叠彩区','象山区','七星区','雁山区','阳朔县','临桂县','灵川县','全州县','兴安县','永福县','灌阳县','龙胜各族自治县','资源县','平乐县','荔蒲县','恭城瑶族自治县']},		   
{name:'梧州市', areaList:['市辖区','万秀区','蝶山区','长洲区','苍梧县','藤　县','蒙山县','岑溪市']},		   
{name:'北海市', areaList:['市辖区','海城区','银海区','铁山港区','合浦县']},		   
{name:'防城港市', areaList:['市辖区','港口区','防城区','上思县','东兴市']},		   
{name:'钦州市', areaList:['市辖区','钦南区','钦北区','灵山县','浦北县']},		   
{name:'贵港市', areaList:['市辖区','港北区','港南区','覃塘区','平南县','桂平市']},		   
{name:'玉林市', areaList:['市辖区','玉州区','容　县','陆川县','博白县','兴业县','北流市']},		   
{name:'百色市', areaList:['市辖区','右江区','田阳县','田东县','平果县','德保县','靖西县','那坡县','凌云县','乐业县','田林县','西林县','隆林各族自治县']},		   
{name:'贺州市', areaList:['市辖区','八步区','昭平县','钟山县','富川瑶族自治县']},		   
{name:'河池市', areaList:['市辖区','金城江区','南丹县','天峨县','凤山县','东兰县','罗城仫佬族自治县','环江毛南族自治县','巴马瑶族自治县','都安瑶族自治县','大化瑶族自治县','宜州市']},		   
{name:'来宾市', areaList:['市辖区','兴宾区','忻城县','象州县','武宣县','金秀瑶族自治县','合山市']},		   
{name:'崇左市', areaList:['市辖区','江洲区','扶绥县','宁明县','龙州县','大新县','天等县','凭祥市']}
]},
{name:'陕西', cityList:[		   
{name:'西安市', areaList:['市辖区','新城区','碑林区','莲湖区','灞桥区','未央区','雁塔区','阎良区','临潼区','长安区','蓝田县','周至县','户　县','高陵县']},		   
{name:'铜川市', areaList:['市辖区','王益区','印台区','耀州区','宜君县']},		   
{name:'宝鸡市', areaList:['市辖区','渭滨区','金台区','陈仓区','凤翔县','岐山县','扶风县','眉　县','陇　县','千阳县','麟游县','凤　县','太白县']},		   
{name:'咸阳市', areaList:['市辖区','秦都区','杨凌区','渭城区','三原县','泾阳县','乾　县','礼泉县','永寿县','彬　县','长武县','旬邑县','淳化县','武功县','兴平市']},		   
{name:'渭南市', areaList:['市辖区','临渭区','华　县','潼关县','大荔县','合阳县','澄城县','蒲城县','白水县','富平县','韩城市','华阴市']},		   
{name:'延安市', areaList:['市辖区','宝塔区','延长县','延川县','子长县','安塞县','志丹县','吴旗县','甘泉县','富　县','洛川县','宜川县','黄龙县','黄陵县']},		   
{name:'汉中市', areaList:['市辖区','汉台区','南郑县','城固县','洋　县','西乡县','勉　县','宁强县','略阳县','镇巴县','留坝县','佛坪县']},		   
{name:'榆林市', areaList:['市辖区','榆阳区','神木县','府谷县','横山县','靖边县','定边县','绥德县','米脂县','佳　县','吴堡县','清涧县','子洲县']},		   
{name:'安康市', areaList:['市辖区','汉滨区','汉阴县','石泉县','宁陕县','紫阳县','岚皋县','平利县','镇坪县','旬阳县','白河县']},		   
{name:'商洛市', areaList:['市辖区','商州区','洛南县','丹凤县','商南县','山阳县','镇安县','柞水县']}
]},
{name:'甘肃', cityList:[		   
{name:'兰州市', areaList:['市辖区','城关区','七里河区','西固区','安宁区','红古区','永登县','皋兰县','榆中县']},		   
{name:'嘉峪关市', areaList:['市辖区']},		   
{name:'金昌市', areaList:['市辖区','金川区','永昌县']},		   
{name:'白银市', areaList:['市辖区','白银区','平川区','靖远县','会宁县','景泰县']},		   
{name:'天水市', areaList:['市辖区','秦城区','北道区','清水县','秦安县','甘谷县','武山县','张家川回族自治县']},		   
{name:'武威市', areaList:['市辖区','凉州区','民勤县','古浪县','天祝藏族自治县']},		   
{name:'张掖市', areaList:['市辖区','甘州区','肃南裕固族自治县','民乐县','临泽县','高台县','山丹县']},		   
{name:'平凉市', areaList:['市辖区','崆峒区','泾川县','灵台县','崇信县','华亭县','庄浪县','静宁县']},		   
{name:'酒泉市', areaList:['市辖区','肃州区','金塔县','安西县','肃北蒙古族自治县','阿克塞哈萨克族自治县','玉门市','敦煌市']},		   
{name:'庆阳市', areaList:['市辖区','西峰区','庆城县','环　县','华池县','合水县','正宁县','宁　县','镇原县']},		   
{name:'定西市', areaList:['市辖区','安定区','通渭县','陇西县','渭源县','临洮县','漳　县','岷　县']},		   
{name:'陇南市', areaList:['市辖区','武都区','成　县','文　县','宕昌县','康　县','西和县','礼　县','徽　县','两当县']},		   
{name:'临夏回族自治州', areaList:['临夏市','临夏县','康乐县','永靖县','广河县','和政县','东乡族自治县','积石山保安族东乡族撒拉族自治县']},		   
{name:'甘南藏族自治州', areaList:['合作市','临潭县','卓尼县','舟曲县','迭部县','玛曲县','碌曲县','夏河县']}
]},
{name:'青海', cityList:[		   
{name:'西宁市', areaList:['市辖区','城东区','城中区','城西区','城北区','大通回族土族自治县','湟中县','湟源县']},		   
{name:'海东地区', areaList:['平安县','民和回族土族自治县','乐都县','互助土族自治县','化隆回族自治县','循化撒拉族自治县']},		   
{name:'海北藏族自治州', areaList:['门源回族自治县','祁连县','海晏县','刚察县']},		   
{name:'黄南藏族自治州', areaList:['同仁县','尖扎县','泽库县','河南蒙古族自治县']},		   
{name:'海南藏族自治州', areaList:['共和县','同德县','贵德县','兴海县','贵南县']},		   
{name:'果洛藏族自治州', areaList:['玛沁县','班玛县','甘德县','达日县','久治县','玛多县']},		   
{name:'玉树藏族自治州', areaList:['玉树县','杂多县','称多县','治多县','囊谦县','曲麻莱县']},		   
{name:'海西蒙古族藏族自治州', areaList:['格尔木市','德令哈市','乌兰县','都兰县','天峻县']}
]},
{name:'宁夏', cityList:[		   
{name:'银川市', areaList:['市辖区','兴庆区','西夏区','金凤区','永宁县','贺兰县','灵武市']},		   
{name:'石嘴山市', areaList:['市辖区','大武口区','惠农区','平罗县']},		   
{name:'吴忠市', areaList:['市辖区','利通区','盐池县','同心县','青铜峡市']},		   
{name:'固原市', areaList:['市辖区','原州区','西吉县','隆德县','泾源县','彭阳县','海原县']},		   
{name:'中卫市', areaList:['市辖区','沙坡头区','中宁县']}
]},
{name:'新疆', cityList:[		   
{name:'乌鲁木齐市', areaList:['市辖区','天山区','沙依巴克区','新市区','水磨沟区','头屯河区','达坂城区','东山区','乌鲁木齐县']},		   
{name:'克拉玛依市', areaList:['市辖区','独山子区','克拉玛依区','白碱滩区','乌尔禾区']},		   
{name:'吐鲁番地区', areaList:['吐鲁番市','鄯善县','托克逊县']},		   
{name:'哈密地区', areaList:['哈密市','巴里坤哈萨克自治县','伊吾县']},		   
{name:'昌吉回族自治州', areaList:['昌吉市','阜康市','米泉市','呼图壁县','玛纳斯县','奇台县','吉木萨尔县','木垒哈萨克自治县']},		   
{name:'博尔塔拉蒙古自治州', areaList:['博乐市','精河县','温泉县']},		   
{name:'巴音郭楞蒙古自治州', areaList:['库尔勒市','轮台县','尉犁县','若羌县','且末县','焉耆回族自治县','和静县','和硕县','博湖县']},		   
{name:'阿克苏地区', areaList:['阿克苏市','温宿县','库车县','沙雅县','新和县','拜城县','乌什县','阿瓦提县','柯坪县']},		   
{name:'克孜勒苏柯尔克孜自治州', areaList:['阿图什市','阿克陶县','阿合奇县','乌恰县']},		   
{name:'喀什地区', areaList:['喀什市','疏附县','疏勒县','英吉沙县','泽普县','莎车县','叶城县','麦盖提县','岳普湖县','伽师县','巴楚县','塔什库尔干塔吉克自治县']},		   
{name:'和田地区', areaList:['和田市','和田县','墨玉县','皮山县','洛浦县','策勒县','于田县','民丰县']},		   
{name:'伊犁哈萨克自治州', areaList:['伊宁市','奎屯市','伊宁县','察布查尔锡伯自治县','霍城县','巩留县','新源县','昭苏县','特克斯县','尼勒克县']},		   
{name:'塔城地区', areaList:['塔城市','乌苏市','额敏县','沙湾县','托里县','裕民县','和布克赛尔蒙古自治县']},		   
{name:'阿勒泰地区', areaList:['阿勒泰市','布尔津县','富蕴县','福海县','哈巴河县','青河县','吉木乃县']},		   
{name:'省直辖行政单位', areaList:['石河子市','阿拉尔市','图木舒克市','五家渠市']}
]},
{name:'河北', cityList:[		   
{name:'石家庄市', areaList:['市辖区','长安区','桥东区','桥西区','新华区','井陉矿区','裕华区','井陉县','正定县','栾城县','行唐县','灵寿县','高邑县','深泽县','赞皇县','无极县','平山县','元氏县','赵　县','辛集市','藁城市','晋州市','新乐市','鹿泉市']},		   
{name:'唐山市', areaList:['市辖区','路南区','路北区','古冶区','开平区','丰南区','丰润区','滦　县','滦南县','乐亭县','迁西县','玉田县','唐海县','遵化市','迁安市']},		   
{name:'秦皇岛市', areaList:['市辖区','海港区','山海关区','北戴河区','青龙满族自治县','昌黎县','抚宁县','卢龙县']},		   
{name:'邯郸市', areaList:['市辖区','邯山区','丛台区','复兴区','峰峰矿区','邯郸县','临漳县','成安县','大名县','涉　县','磁　县','肥乡县','永年县','邱　县','鸡泽县','广平县','馆陶县','魏　县','曲周县','武安市']},		   
{name:'邢台市', areaList:['市辖区','桥东区','桥西区','邢台县','临城县','内丘县','柏乡县','隆尧县','任　县','南和县','宁晋县','巨鹿县','新河县','广宗县','平乡县','威　县','清河县','临西县','南宫市','沙河市']},		   
{name:'保定市', areaList:['市辖区','新市区','北市区','南市区','满城县','清苑县','涞水县','阜平县','徐水县','定兴县','唐　县','高阳县','容城县','涞源县','望都县','安新县','易　县','曲阳县','蠡　县','顺平县','博野县','雄　县','涿州市','定州市','安国市','高碑店市']},		   
{name:'张家口市', areaList:['市辖区','桥东区','桥西区','宣化区','下花园区','宣化县','张北县','康保县','沽源县','尚义县','蔚　县','阳原县','怀安县','万全县','怀来县','涿鹿县','赤城县','崇礼县']},		   
{name:'承德市', areaList:['市辖区','双桥区','双滦区','鹰手营子矿区','承德县','兴隆县','平泉县','滦平县','隆化县','丰宁满族自治县','宽城满族自治县','围场满族蒙古族自治县']},		   
{name:'沧州市', areaList:['市辖区','新华区','运河区','沧　县','青　县','东光县','海兴县','盐山县','肃宁县','南皮县','吴桥县','献　县','孟村回族自治县','泊头市','任丘市','黄骅市','河间市']},		   
{name:'廊坊市', areaList:['市辖区','安次区','广阳区','固安县','永清县','香河县','大城县','文安县','大厂回族自治县','霸州市','三河市']},		   
{name:'衡水市', areaList:['市辖区','桃城区','枣强县','武邑县','武强县','饶阳县','安平县','故城县','景　县','阜城县','冀州市','深州市']}
]},
{name:'山西', cityList:[		   
{name:'太原市', areaList:['市辖区','小店区','迎泽区','杏花岭区','尖草坪区','万柏林区','晋源区','清徐县','阳曲县','娄烦县','古交市']},		   
{name:'大同市', areaList:['市辖区','城　区','矿　区','南郊区','新荣区','阳高县','天镇县','广灵县','灵丘县','浑源县','左云县','大同县']},		   
{name:'阳泉市', areaList:['市辖区','城　区','矿　区','郊　区','平定县','盂　县']},		   
{name:'长治市', areaList:['市辖区','城　区','郊　区','长治县','襄垣县','屯留县','平顺县','黎城县','壶关县','长子县','武乡县','沁　县','沁源县','潞城市']},		   
{name:'晋城市', areaList:['市辖区','城　区','沁水县','阳城县','陵川县','泽州县','高平市']},		   
{name:'朔州市', areaList:['市辖区','朔城区','平鲁区','山阴县','应　县','右玉县','怀仁县']},		   
{name:'晋中市', areaList:['市辖区','榆次区','榆社县','左权县','和顺县','昔阳县','寿阳县','太谷县','祁　县','平遥县','灵石县','介休市']},		   
{name:'运城市', areaList:['市辖区','盐湖区','临猗县','万荣县','闻喜县','稷山县','新绛县','绛　县','垣曲县','夏　县','平陆县','芮城县','永济市','河津市']},		   
{name:'忻州市', areaList:['市辖区','忻府区','定襄县','五台县','代　县','繁峙县','宁武县','静乐县','神池县','五寨县','岢岚县','河曲县','保德县','偏关县','原平市']},		   
{name:'临汾市', areaList:['市辖区','尧都区','曲沃县','翼城县','襄汾县','洪洞县','古　县','安泽县','浮山县','吉　县','乡宁县','大宁县','隰　县','永和县','蒲　县','汾西县','侯马市','霍州市']},		   
{name:'吕梁市', areaList:['市辖区','离石区','文水县','交城县','兴　县','临　县','柳林县','石楼县','岚　县','方山县','中阳县','交口县','孝义市','汾阳市']}
]},
{name:'内蒙古', cityList:[		   
{name:'呼和浩特市', areaList:['市辖区','新城区','回民区','玉泉区','赛罕区','土默特左旗','托克托县','和林格尔县','清水河县','武川县']},		   
{name:'包头市', areaList:['市辖区','东河区','昆都仑区','青山区','石拐区','白云矿区','九原区','土默特右旗','固阳县','达尔罕茂明安联合旗']},		   
{name:'乌海市', areaList:['市辖区','海勃湾区','海南区','乌达区']},		   
{name:'赤峰市', areaList:['市辖区','红山区','元宝山区','松山区','阿鲁科尔沁旗','巴林左旗','巴林右旗','林西县','克什克腾旗','翁牛特旗','喀喇沁旗','宁城县','敖汉旗']},		   
{name:'通辽市', areaList:['市辖区','科尔沁区','科尔沁左翼中旗','科尔沁左翼后旗','开鲁县','库伦旗','奈曼旗','扎鲁特旗','霍林郭勒市']},		   
{name:'鄂尔多斯市', areaList:['东胜区','达拉特旗','准格尔旗','鄂托克前旗','鄂托克旗','杭锦旗','乌审旗','伊金霍洛旗']},		   
{name:'呼伦贝尔市', areaList:['市辖区','海拉尔区','阿荣旗','莫力达瓦达斡尔族自治旗','鄂伦春自治旗','鄂温克族自治旗','陈巴尔虎旗','新巴尔虎左旗','新巴尔虎右旗','满洲里市','牙克石市','扎兰屯市','额尔古纳市','根河市']},		   
{name:'巴彦淖尔市', areaList:['市辖区','临河区','五原县','磴口县','乌拉特前旗','乌拉特中旗','乌拉特后旗','杭锦后旗']},		   
{name:'乌兰察布市', areaList:['市辖区','集宁区','卓资县','化德县','商都县','兴和县','凉城县','察哈尔右翼前旗','察哈尔右翼中旗','察哈尔右翼后旗','四子王旗','丰镇市']},		   
{name:'兴安盟', areaList:['乌兰浩特市','阿尔山市','科尔沁右翼前旗','科尔沁右翼中旗','扎赉特旗','突泉县']},		   
{name:'锡林郭勒盟', areaList:['二连浩特市','锡林浩特市','阿巴嘎旗','苏尼特左旗','苏尼特右旗','东乌珠穆沁旗','西乌珠穆沁旗','太仆寺旗','镶黄旗','正镶白旗','正蓝旗','多伦县']},		   
{name:'阿拉善盟', areaList:['阿拉善左旗','阿拉善右旗','额济纳旗']}
]},
{name:'江苏', cityList:[		   
{name:'南京市', areaList:['市辖区','玄武区','白下区','秦淮区','建邺区','鼓楼区','下关区','浦口区','栖霞区','雨花台区','江宁区','六合区','溧水县','高淳县']},		   
{name:'无锡市', areaList:['市辖区','崇安区','南长区','北塘区','锡山区','惠山区','滨湖区','江阴市','宜兴市']},		   
{name:'徐州市', areaList:['市辖区','鼓楼区','云龙区','九里区','贾汪区','泉山区','丰　县','沛　县','铜山县','睢宁县','新沂市','邳州市']},		   
{name:'常州市', areaList:['市辖区','天宁区','钟楼区','戚墅堰区','新北区','武进区','溧阳市','金坛市']},		   
{name:'苏州市', areaList:['市辖区','沧浪区','平江区','金阊区','虎丘区','吴中区','相城区','常熟市','张家港市','昆山市','吴江市','太仓市']},		   
{name:'南通市', areaList:['市辖区','崇川区','港闸区','海安县','如东县','启东市','如皋市','通州市','海门市']},		   
{name:'连云港市', areaList:['市辖区','连云区','新浦区','海州区','赣榆县','东海县','灌云县','灌南县']},		   
{name:'淮安市', areaList:['市辖区','清河区','楚州区','淮阴区','清浦区','涟水县','洪泽县','盱眙县','金湖县']},		   
{name:'盐城市', areaList:['市辖区','亭湖区','盐都区','响水县','滨海县','阜宁县','射阳县','建湖县','东台市','大丰市']},		   
{name:'扬州市', areaList:['市辖区','广陵区','邗江区','郊　区','宝应县','仪征市','高邮市','江都市']},		   
{name:'镇江市', areaList:['市辖区','京口区','润州区','丹徒区','丹阳市','扬中市','句容市']},		   
{name:'泰州市', areaList:['市辖区','海陵区','高港区','兴化市','靖江市','泰兴市','姜堰市']},		   
{name:'宿迁市', areaList:['市辖区','宿城区','宿豫区','沭阳县','泗阳县','泗洪县']}
]},
{name:'浙江', cityList:[		   
{name:'杭州市', areaList:['市辖区','上城区','下城区','江干区','拱墅区','西湖区','滨江区','萧山区','余杭区','桐庐县','淳安县','建德市','富阳市','临安市']},		   
{name:'宁波市', areaList:['市辖区','海曙区','江东区','江北区','北仑区','镇海区','鄞州区','象山县','宁海县','余姚市','慈溪市','奉化市']},		   
{name:'温州市', areaList:['市辖区','鹿城区','龙湾区','瓯海区','洞头县','永嘉县','平阳县','苍南县','文成县','泰顺县','瑞安市','乐清市']},		   
{name:'嘉兴市', areaList:['市辖区','秀城区','秀洲区','嘉善县','海盐县','海宁市','平湖市','桐乡市']},		   
{name:'湖州市', areaList:['市辖区','吴兴区','南浔区','德清县','长兴县','安吉县']},		   
{name:'绍兴市', areaList:['市辖区','越城区','绍兴县','新昌县','诸暨市','上虞市','嵊州市']},		   
{name:'金华市', areaList:['市辖区','婺城区','金东区','武义县','浦江县','磐安县','兰溪市','义乌市','东阳市','永康市']},		   
{name:'衢州市', areaList:['市辖区','柯城区','衢江区','常山县','开化县','龙游县','江山市']},		   
{name:'舟山市', areaList:['市辖区','定海区','普陀区','岱山县','嵊泗县']},		   
{name:'台州市', areaList:['市辖区','椒江区','黄岩区','路桥区','玉环县','三门县','天台县','仙居县','温岭市','临海市']},		   
{name:'丽水市', areaList:['市辖区','莲都区','青田县','缙云县','遂昌县','松阳县','云和县','庆元县','景宁畲族自治县','龙泉市']}
]},
{name:'安徽', cityList:[		   
{name:'合肥市', areaList:['市辖区','瑶海区','庐阳区','蜀山区','包河区','长丰县','肥东县','肥西县']},		   
{name:'芜湖市', areaList:['市辖区','镜湖区','马塘区','新芜区','鸠江区','芜湖县','繁昌县','南陵县']},		   
{name:'蚌埠市', areaList:['市辖区','龙子湖区','蚌山区','禹会区','淮上区','怀远县','五河县','固镇县']},		   
{name:'淮南市', areaList:['市辖区','大通区','田家庵区','谢家集区','八公山区','潘集区','凤台县']},		   
{name:'马鞍山市', areaList:['市辖区','金家庄区','花山区','雨山区','当涂县']},		   
{name:'淮北市', areaList:['市辖区','杜集区','相山区','烈山区','濉溪县']},		   
{name:'铜陵市', areaList:['市辖区','铜官山区','狮子山区','郊　区','铜陵县']},		   
{name:'安庆市', areaList:['市辖区','迎江区','大观区','郊　区','怀宁县','枞阳县','潜山县','太湖县','宿松县','望江县','岳西县','桐城市']},		   
{name:'黄山市', areaList:['市辖区','屯溪区','黄山区','徽州区','歙　县','休宁县','黟　县','祁门县']},		   
{name:'滁州市', areaList:['市辖区','琅琊区','南谯区','来安县','全椒县','定远县','凤阳县','天长市','明光市']},		   
{name:'阜阳市', areaList:['市辖区','颍州区','颍东区','颍泉区','临泉县','太和县','阜南县','颍上县','界首市']},		   
{name:'宿州市', areaList:['市辖区','墉桥区','砀山县','萧　县','灵璧县','泗　县']},		   
{name:'巢湖市', areaList:['市辖区','居巢区','庐江县','无为县','含山县','和　县']},		   
{name:'六安市', areaList:['市辖区','金安区','裕安区','寿　县','霍邱县','舒城县','金寨县','霍山县']},		   
{name:'亳州市', areaList:['市辖区','谯城区','涡阳县','蒙城县','利辛县']},		   
{name:'池州市', areaList:['市辖区','贵池区','东至县','石台县','青阳县']},		   
{name:'宣城市', areaList:['市辖区','宣州区','郎溪县','广德县','泾　县','绩溪县','旌德县','宁国市']}
]},
{name:'福建', cityList:[		   
{name:'福州市', areaList:['市辖区','鼓楼区','台江区','仓山区','马尾区','晋安区','闽侯县','连江县','罗源县','闽清县','永泰县','平潭县','福清市','长乐市']},		   
{name:'厦门市', areaList:['市辖区','思明区','海沧区','湖里区','集美区','同安区','翔安区']},		   
{name:'莆田市', areaList:['市辖区','城厢区','涵江区','荔城区','秀屿区','仙游县']},		   
{name:'三明市', areaList:['市辖区','梅列区','三元区','明溪县','清流县','宁化县','大田县','尤溪县','沙　县','将乐县','泰宁县','建宁县','永安市']},		   
{name:'泉州市', areaList:['市辖区','鲤城区','丰泽区','洛江区','泉港区','惠安县','安溪县','永春县','德化县','金门县','石狮市','晋江市','南安市']},		   
{name:'漳州市', areaList:['市辖区','芗城区','龙文区','云霄县','漳浦县','诏安县','长泰县','东山县','南靖县','平和县','华安县','龙海市']},		   
{name:'南平市', areaList:['市辖区','延平区','顺昌县','浦城县','光泽县','松溪县','政和县','邵武市','武夷山市','建瓯市','建阳市']},		   
{name:'龙岩市', areaList:['市辖区','新罗区','长汀县','永定县','上杭县','武平县','连城县','漳平市']},		   
{name:'宁德市', areaList:['市辖区','蕉城区','霞浦县','古田县','屏南县','寿宁县','周宁县','柘荣县','福安市','福鼎市']}
]},
{name:'江西', cityList:[		   
{name:'南昌市', areaList:['市辖区','东湖区','西湖区','青云谱区','湾里区','青山湖区','南昌县','新建县','安义县','进贤县']},		   
{name:'景德镇市', areaList:['市辖区','昌江区','珠山区','浮梁县','乐平市']},		   
{name:'萍乡市', areaList:['市辖区','安源区','湘东区','莲花县','上栗县','芦溪县']},		   
{name:'九江市', areaList:['市辖区','庐山区','浔阳区','九江县','武宁县','修水县','永修县','德安县','星子县','都昌县','湖口县','彭泽县','瑞昌市']},		   
{name:'新余市', areaList:['市辖区','渝水区','分宜县']},		   
{name:'鹰潭市', areaList:['市辖区','月湖区','余江县','贵溪市']},		   
{name:'赣州市', areaList:['市辖区','章贡区','赣　县','信丰县','大余县','上犹县','崇义县','安远县','龙南县','定南县','全南县','宁都县','于都县','兴国县','会昌县','寻乌县','石城县','瑞金市','南康市']},		   
{name:'吉安市', areaList:['市辖区','吉州区','青原区','吉安县','吉水县','峡江县','新干县','永丰县','泰和县','遂川县','万安县','安福县','永新县','井冈山市']},		   
{name:'宜春市', areaList:['市辖区','袁州区','奉新县','万载县','上高县','宜丰县','靖安县','铜鼓县','丰城市','樟树市','高安市']},		   
{name:'抚州市', areaList:['市辖区','临川区','南城县','黎川县','南丰县','崇仁县','乐安县','宜黄县','金溪县','资溪县','东乡县','广昌县']},		   
{name:'上饶市', areaList:['市辖区','信州区','上饶县','广丰县','玉山县','铅山县','横峰县','弋阳县','余干县','鄱阳县','万年县','婺源县','德兴市']}
]},
{name:'山东', cityList:[		   
{name:'济南市', areaList:['市辖区','历下区','市中区','槐荫区','天桥区','历城区','长清区','平阴县','济阳县','商河县','章丘市']},		   
{name:'青岛市', areaList:['市辖区','市南区','市北区','四方区','黄岛区','崂山区','李沧区','城阳区','胶州市','即墨市','平度市','胶南市','莱西市']},		   
{name:'淄博市', areaList:['市辖区','淄川区','张店区','博山区','临淄区','周村区','桓台县','高青县','沂源县']},		   
{name:'枣庄市', areaList:['市辖区','市中区','薛城区','峄城区','台儿庄区','山亭区','滕州市']},		   
{name:'东营市', areaList:['市辖区','东营区','河口区','垦利县','利津县','广饶县']},		   
{name:'烟台市', areaList:['市辖区','芝罘区','福山区','牟平区','莱山区','长岛县','龙口市','莱阳市','莱州市','蓬莱市','招远市','栖霞市','海阳市']},		   
{name:'潍坊市', areaList:['市辖区','潍城区','寒亭区','坊子区','奎文区','临朐县','昌乐县','青州市','诸城市','寿光市','安丘市','高密市','昌邑市']},		   
{name:'济宁市', areaList:['市辖区','市中区','任城区','微山县','鱼台县','金乡县','嘉祥县','汶上县','泗水县','梁山县','曲阜市','兖州市','邹城市']},		   
{name:'泰安市', areaList:['市辖区','泰山区','岱岳区','宁阳县','东平县','新泰市','肥城市']},		   
{name:'威海市', areaList:['市辖区','环翠区','文登市','荣成市','乳山市']},		   
{name:'日照市', areaList:['市辖区','东港区','岚山区','五莲县','莒　县']},		   
{name:'莱芜市', areaList:['市辖区','莱城区','钢城区']},		   
{name:'临沂市', areaList:['市辖区','兰山区','罗庄区','河东区','沂南县','郯城县','沂水县','苍山县','费　县','平邑县','莒南县','蒙阴县','临沭县']},		   
{name:'德州市', areaList:['市辖区','德城区','陵　县','宁津县','庆云县','临邑县','齐河县','平原县','夏津县','武城县','乐陵市','禹城市']},		   
{name:'聊城市', areaList:['市辖区','东昌府区','阳谷县','莘　县','茌平县','东阿县','冠　县','高唐县','临清市']},		   
{name:'滨州市', areaList:['市辖区','滨城区','惠民县','阳信县','无棣县','沾化县','博兴县','邹平县']},		   
{name:'荷泽市', areaList:['市辖区','牡丹区','曹　县','单　县','成武县','巨野县','郓城县','鄄城县','定陶县','东明县']}
]},
{name:'辽宁', cityList:[		   
{name:'沈阳市', areaList:['市辖区','和平区','沈河区','大东区','皇姑区','铁西区','苏家屯区','东陵区','新城子区','于洪区','辽中县','康平县','法库县','新民市']},		   
{name:'大连市', areaList:['市辖区','中山区','西岗区','沙河口区','甘井子区','旅顺口区','金州区','长海县','瓦房店市','普兰店市','庄河市']},		   
{name:'鞍山市', areaList:['市辖区','铁东区','铁西区','立山区','千山区','台安县','岫岩满族自治县','海城市']},		   
{name:'抚顺市', areaList:['市辖区','新抚区','东洲区','望花区','顺城区','抚顺县','新宾满族自治县','清原满族自治县']},		   
{name:'本溪市', areaList:['市辖区','平山区','溪湖区','明山区','南芬区','本溪满族自治县','桓仁满族自治县']},		   
{name:'丹东市', areaList:['市辖区','元宝区','振兴区','振安区','宽甸满族自治县','东港市','凤城市']},		   
{name:'锦州市', areaList:['市辖区','古塔区','凌河区','太和区','黑山县','义　县','凌海市','北宁市']},		   
{name:'营口市', areaList:['市辖区','站前区','西市区','鲅鱼圈区','老边区','盖州市','大石桥市']},		   
{name:'阜新市', areaList:['市辖区','海州区','新邱区','太平区','清河门区','细河区','阜新蒙古族自治县','彰武县']},		   
{name:'辽阳市', areaList:['市辖区','白塔区','文圣区','宏伟区','弓长岭区','太子河区','辽阳县','灯塔市']},		   
{name:'盘锦市', areaList:['市辖区','双台子区','兴隆台区','大洼县','盘山县']},		   
{name:'铁岭市', areaList:['市辖区','银州区','清河区','铁岭县','西丰县','昌图县','调兵山市','开原市']},		   
{name:'朝阳市', areaList:['市辖区','双塔区','龙城区','朝阳县','建平县','喀喇沁左翼蒙古族自治县','北票市','凌源市']},		   
{name:'葫芦岛市', areaList:['市辖区','连山区','龙港区','南票区','绥中县','建昌县','兴城市']}
]},
{name:'吉林', cityList:[		   
{name:'长春市', areaList:['市辖区','南关区','宽城区','朝阳区','二道区','绿园区','双阳区','农安县','九台市','榆树市','德惠市']},		   
{name:'吉林市', areaList:['市辖区','昌邑区','龙潭区','船营区','丰满区','永吉县','蛟河市','桦甸市','舒兰市','磐石市']},		   
{name:'四平市', areaList:['市辖区','铁西区','铁东区','梨树县','伊通满族自治县','公主岭市','双辽市']},		   
{name:'辽源市', areaList:['市辖区','龙山区','西安区','东丰县','东辽县']},		   
{name:'通化市', areaList:['市辖区','东昌区','二道江区','通化县','辉南县','柳河县','梅河口市','集安市']},		   
{name:'白山市', areaList:['市辖区','八道江区','抚松县','靖宇县','长白朝鲜族自治县','江源县','临江市']},		   
{name:'松原市', areaList:['市辖区','宁江区','前郭尔罗斯蒙古族自治县','长岭县','乾安县','扶余县']},		   
{name:'白城市', areaList:['市辖区','洮北区','镇赉县','通榆县','洮南市','大安市']},		   
{name:'延边朝鲜族自治州', areaList:['延吉市','图们市','敦化市','珲春市','龙井市','和龙市','汪清县','安图县']}
]},
{name:'黑龙江', cityList:[		   
{name:'哈尔滨市', areaList:['市辖区','道里区','南岗区','道外区','香坊区','动力区','平房区','松北区','呼兰区','依兰县','方正县','宾　县','巴彦县','木兰县','通河县','延寿县','阿城市','双城市','尚志市','五常市']},		   
{name:'齐齐哈尔市', areaList:['市辖区','龙沙区','建华区','铁锋区','昂昂溪区','富拉尔基区','碾子山区','梅里斯达斡尔族区','龙江县','依安县','泰来县','甘南县','富裕县','克山县','克东县','拜泉县','讷河市']},		   
{name:'鸡西市', areaList:['市辖区','鸡冠区','恒山区','滴道区','梨树区','城子河区','麻山区','鸡东县','虎林市','密山市']},		   
{name:'鹤岗市', areaList:['市辖区','向阳区','工农区','南山区','兴安区','东山区','兴山区','萝北县','绥滨县']},		   
{name:'双鸭山市', areaList:['市辖区','尖山区','岭东区','四方台区','宝山区','集贤县','友谊县','宝清县','饶河县']},		   
{name:'大庆市', areaList:['市辖区','萨尔图区','龙凤区','让胡路区','红岗区','大同区','肇州县','肇源县','林甸县','杜尔伯特蒙古族自治县']},		   
{name:'伊春市', areaList:['市辖区','伊春区','南岔区','友好区','西林区','翠峦区','新青区','美溪区','金山屯区','五营区','乌马河区','汤旺河区','带岭区','乌伊岭区','红星区','上甘岭区','嘉荫县','铁力市']},		   
{name:'佳木斯市', areaList:['市辖区','永红区','向阳区','前进区','东风区','郊　区','桦南县','桦川县','汤原县','抚远县','同江市','富锦市']},		   
{name:'七台河市', areaList:['市辖区','新兴区','桃山区','茄子河区','勃利县']},		   
{name:'牡丹江市', areaList:['市辖区','东安区','阳明区','爱民区','西安区','东宁县','林口县','绥芬河市','海林市','宁安市','穆棱市']},		   
{name:'黑河市', areaList:['市辖区','爱辉区','嫩江县','逊克县','孙吴县','北安市','五大连池市']},		   
{name:'绥化市', areaList:['市辖区','北林区','望奎县','兰西县','青冈县','庆安县','明水县','绥棱县','安达市','肇东市','海伦市']},		   
{name:'大兴安岭地区', areaList:['呼玛县','塔河县','漠河县']}
]},
{name:'海南', cityList:[		   
{name:'海口市', areaList:['市辖区','秀英区','龙华区','琼山区','美兰区']},		   
{name:'三亚市', areaList:['市辖区']},		   
{name:'省直辖县级行政单位', areaList:['五指山市','琼海市','儋州市','文昌市','万宁市','东方市','定安县','屯昌县','澄迈县','临高县','白沙黎族自治县','昌江黎族自治县','乐东黎族自治县','陵水黎族自治县','保亭黎族苗族自治县','琼中黎族苗族自治县','西沙群岛','南沙群岛','中沙群岛的岛礁及其海域']}
]},
{name:'台湾', cityList:[
]},
{name:'香港', cityList:[
]},
{name:'澳门', cityList:[
]}
];
var areacode = {
    "body": [
        {
            "parentId": "0",
            "cityId": "-1",
            "spell": null,
            "city": "国外"
        },
        {
            "parentId": "0",
            "cityId": "0",
            "spell": null,
            "city": "其他"
        },
        {
            "parentId": "0",
            "cityId": "110000",
            "spell": "bjs",
            "city": "北京市"
        },
        {
            "parentId": "110000",
            "cityId": "110100",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "110100",
            "cityId": "110101",
            "spell": "dcq",
            "city": "东城区"
        },
        {
            "parentId": "110100",
            "cityId": "110102",
            "spell": "xcq",
            "city": "西城区"
        },
        {
            "parentId": "110100",
            "cityId": "110105",
            "spell": "cyq",
            "city": "朝阳区"
        },
        {
            "parentId": "110100",
            "cityId": "110106",
            "spell": "ftq",
            "city": "丰台区"
        },
        {
            "parentId": "110100",
            "cityId": "110107",
            "spell": "sjsq",
            "city": "石景山区"
        },
        {
            "parentId": "110100",
            "cityId": "110108",
            "spell": "hdq",
            "city": "海淀区"
        },
        {
            "parentId": "110100",
            "cityId": "110109",
            "spell": "mtgq",
            "city": "门头沟区"
        },
        {
            "parentId": "110100",
            "cityId": "110111",
            "spell": "fsq",
            "city": "房山区"
        },
        {
            "parentId": "110100",
            "cityId": "110112",
            "spell": "tzq",
            "city": "通州区"
        },
        {
            "parentId": "110100",
            "cityId": "110113",
            "spell": "syq",
            "city": "顺义区"
        },
        {
            "parentId": "110100",
            "cityId": "110114",
            "spell": "cpq",
            "city": "昌平区"
        },
        {
            "parentId": "110100",
            "cityId": "110115",
            "spell": "dxq",
            "city": "大兴区"
        },
        {
            "parentId": "110100",
            "cityId": "110116",
            "spell": "hrq",
            "city": "怀柔区"
        },
        {
            "parentId": "110100",
            "cityId": "110117",
            "spell": "pgq",
            "city": "平谷区"
        },
        {
            "parentId": "110000",
            "cityId": "110200",
            "spell": "x",
            "city": "县"
        },
        {
            "parentId": "110200",
            "cityId": "110228",
            "spell": "myx",
            "city": "密云县"
        },
        {
            "parentId": "110200",
            "cityId": "110229",
            "spell": "yqx",
            "city": "延庆县"
        },
        {
            "parentId": "0",
            "cityId": "120000",
            "spell": "tjs",
            "city": "天津市"
        },
        {
            "parentId": "120000",
            "cityId": "120100",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "120100",
            "cityId": "120101",
            "spell": "hpq",
            "city": "和平区"
        },
        {
            "parentId": "120100",
            "cityId": "120102",
            "spell": "hdq",
            "city": "河东区"
        },
        {
            "parentId": "120100",
            "cityId": "120103",
            "spell": "hxq",
            "city": "河西区"
        },
        {
            "parentId": "120100",
            "cityId": "120104",
            "spell": "nkq",
            "city": "南开区"
        },
        {
            "parentId": "120100",
            "cityId": "120105",
            "spell": "hbq",
            "city": "河北区"
        },
        {
            "parentId": "120100",
            "cityId": "120106",
            "spell": "hqq",
            "city": "红桥区"
        },
        {
            "parentId": "120100",
            "cityId": "120110",
            "spell": "dlq",
            "city": "东丽区"
        },
        {
            "parentId": "120100",
            "cityId": "120111",
            "spell": "xqq",
            "city": "西青区"
        },
        {
            "parentId": "120100",
            "cityId": "120112",
            "spell": "jnq",
            "city": "津南区"
        },
        {
            "parentId": "120100",
            "cityId": "120113",
            "spell": "bcq",
            "city": "北辰区"
        },
        {
            "parentId": "120100",
            "cityId": "120114",
            "spell": "wqq",
            "city": "武清区"
        },
        {
            "parentId": "120100",
            "cityId": "120115",
            "spell": "bdq",
            "city": "宝坻区"
        },
        {
            "parentId": "120100",
            "cityId": "120116",
            "spell": "bhxq",
            "city": "滨海新区"
        },
        {
            "parentId": "120000",
            "cityId": "120200",
            "spell": "x",
            "city": "县"
        },
        {
            "parentId": "120200",
            "cityId": "120221",
            "spell": "nhx",
            "city": "宁河县"
        },
        {
            "parentId": "120200",
            "cityId": "120223",
            "spell": "jhx",
            "city": "静海县"
        },
        {
            "parentId": "120200",
            "cityId": "120225",
            "spell": "jx",
            "city": "蓟县"
        },
        {
            "parentId": "0",
            "cityId": "130000",
            "spell": "hbs",
            "city": "河北省"
        },
        {
            "parentId": "130000",
            "cityId": "130100",
            "spell": "sjzs",
            "city": "石家庄市"
        },
        {
            "parentId": "130100",
            "cityId": "130101",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "130100",
            "cityId": "130102",
            "spell": "caq",
            "city": "长安区"
        },
        {
            "parentId": "130100",
            "cityId": "130103",
            "spell": "qdq",
            "city": "桥东区"
        },
        {
            "parentId": "130100",
            "cityId": "130104",
            "spell": "qxq",
            "city": "桥西区"
        },
        {
            "parentId": "130100",
            "cityId": "130105",
            "spell": "xhq",
            "city": "新华区"
        },
        {
            "parentId": "130100",
            "cityId": "130107",
            "spell": "jxkq",
            "city": "井陉矿区"
        },
        {
            "parentId": "130100",
            "cityId": "130108",
            "spell": "yhq",
            "city": "裕华区"
        },
        {
            "parentId": "130100",
            "cityId": "130121",
            "spell": "jxx",
            "city": "井陉县"
        },
        {
            "parentId": "130100",
            "cityId": "130123",
            "spell": "zdx",
            "city": "正定县"
        },
        {
            "parentId": "130100",
            "cityId": "130124",
            "spell": "lcx",
            "city": "栾城县"
        },
        {
            "parentId": "130100",
            "cityId": "130125",
            "spell": "xtx",
            "city": "行唐县"
        },
        {
            "parentId": "130100",
            "cityId": "130126",
            "spell": "lsx",
            "city": "灵寿县"
        },
        {
            "parentId": "130100",
            "cityId": "130127",
            "spell": "gyx",
            "city": "高邑县"
        },
        {
            "parentId": "130100",
            "cityId": "130128",
            "spell": "szx",
            "city": "深泽县"
        },
        {
            "parentId": "130100",
            "cityId": "130129",
            "spell": "zhx",
            "city": "赞皇县"
        },
        {
            "parentId": "130100",
            "cityId": "130130",
            "spell": "wjx",
            "city": "无极县"
        },
        {
            "parentId": "130100",
            "cityId": "130131",
            "spell": "psx",
            "city": "平山县"
        },
        {
            "parentId": "130100",
            "cityId": "130132",
            "spell": "ysx",
            "city": "元氏县"
        },
        {
            "parentId": "130100",
            "cityId": "130133",
            "spell": "zx",
            "city": "赵县"
        },
        {
            "parentId": "130100",
            "cityId": "130181",
            "spell": "xjs",
            "city": "辛集市"
        },
        {
            "parentId": "130100",
            "cityId": "130182",
            "spell": "gcs",
            "city": "藁城市"
        },
        {
            "parentId": "130100",
            "cityId": "130183",
            "spell": "jzs",
            "city": "晋州市"
        },
        {
            "parentId": "130100",
            "cityId": "130184",
            "spell": "xls",
            "city": "新乐市"
        },
        {
            "parentId": "130100",
            "cityId": "130185",
            "spell": "lqs",
            "city": "鹿泉市"
        },
        {
            "parentId": "130000",
            "cityId": "130200",
            "spell": "tss",
            "city": "唐山市"
        },
        {
            "parentId": "130200",
            "cityId": "130201",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "130200",
            "cityId": "130202",
            "spell": "lnq",
            "city": "路南区"
        },
        {
            "parentId": "130200",
            "cityId": "130203",
            "spell": "lbq",
            "city": "路北区"
        },
        {
            "parentId": "130200",
            "cityId": "130204",
            "spell": "gyq",
            "city": "古冶区"
        },
        {
            "parentId": "130200",
            "cityId": "130205",
            "spell": "kpq",
            "city": "开平区"
        },
        {
            "parentId": "130200",
            "cityId": "130207",
            "spell": "fnq",
            "city": "丰南区"
        },
        {
            "parentId": "130200",
            "cityId": "130208",
            "spell": "frq",
            "city": "丰润区"
        },
        {
            "parentId": "130200",
            "cityId": "130209",
            "spell": "cfdq",
            "city": "曹妃甸区"
        },
        {
            "parentId": "130200",
            "cityId": "130223",
            "spell": "lx",
            "city": "滦县"
        },
        {
            "parentId": "130200",
            "cityId": "130224",
            "spell": "lnx",
            "city": "滦南县"
        },
        {
            "parentId": "130200",
            "cityId": "130225",
            "spell": "ltx",
            "city": "乐亭县"
        },
        {
            "parentId": "130200",
            "cityId": "130227",
            "spell": "qxx",
            "city": "迁西县"
        },
        {
            "parentId": "130200",
            "cityId": "130229",
            "spell": "ytx",
            "city": "玉田县"
        },
        {
            "parentId": "130200",
            "cityId": "130281",
            "spell": "zhs",
            "city": "遵化市"
        },
        {
            "parentId": "130200",
            "cityId": "130283",
            "spell": "qas",
            "city": "迁安市"
        },
        {
            "parentId": "130000",
            "cityId": "130300",
            "spell": "qhds",
            "city": "秦皇岛市"
        },
        {
            "parentId": "130300",
            "cityId": "130301",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "130300",
            "cityId": "130302",
            "spell": "hgq",
            "city": "海港区"
        },
        {
            "parentId": "130300",
            "cityId": "130303",
            "spell": "shgq",
            "city": "山海关区"
        },
        {
            "parentId": "130300",
            "cityId": "130304",
            "spell": "bdhq",
            "city": "北戴河区"
        },
        {
            "parentId": "130300",
            "cityId": "130321",
            "spell": "qlmzzzx",
            "city": "青龙满族自治县"
        },
        {
            "parentId": "130300",
            "cityId": "130322",
            "spell": "clx",
            "city": "昌黎县"
        },
        {
            "parentId": "130300",
            "cityId": "130323",
            "spell": "fnx",
            "city": "抚宁县"
        },
        {
            "parentId": "130300",
            "cityId": "130324",
            "spell": "llx",
            "city": "卢龙县"
        },
        {
            "parentId": "130000",
            "cityId": "130400",
            "spell": "hds",
            "city": "邯郸市"
        },
        {
            "parentId": "130400",
            "cityId": "130401",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "130400",
            "cityId": "130402",
            "spell": "hsq",
            "city": "邯山区"
        },
        {
            "parentId": "130400",
            "cityId": "130403",
            "spell": "ctq",
            "city": "丛台区"
        },
        {
            "parentId": "130400",
            "cityId": "130404",
            "spell": "fxq",
            "city": "复兴区"
        },
        {
            "parentId": "130400",
            "cityId": "130406",
            "spell": "ffkq",
            "city": "峰峰矿区"
        },
        {
            "parentId": "130400",
            "cityId": "130421",
            "spell": "hdx",
            "city": "邯郸县"
        },
        {
            "parentId": "130400",
            "cityId": "130423",
            "spell": "lzx",
            "city": "临漳县"
        },
        {
            "parentId": "130400",
            "cityId": "130424",
            "spell": "cax",
            "city": "成安县"
        },
        {
            "parentId": "130400",
            "cityId": "130425",
            "spell": "dmx",
            "city": "大名县"
        },
        {
            "parentId": "130400",
            "cityId": "130426",
            "spell": "sx",
            "city": "涉县"
        },
        {
            "parentId": "130400",
            "cityId": "130427",
            "spell": "cx",
            "city": "磁县"
        },
        {
            "parentId": "130400",
            "cityId": "130428",
            "spell": "fxx",
            "city": "肥乡县"
        },
        {
            "parentId": "130400",
            "cityId": "130429",
            "spell": "ynx",
            "city": "永年县"
        },
        {
            "parentId": "130400",
            "cityId": "130430",
            "spell": "qx",
            "city": "邱县"
        },
        {
            "parentId": "130400",
            "cityId": "130431",
            "spell": "jzx",
            "city": "鸡泽县"
        },
        {
            "parentId": "130400",
            "cityId": "130432",
            "spell": "gpx",
            "city": "广平县"
        },
        {
            "parentId": "130400",
            "cityId": "130433",
            "spell": "gtx",
            "city": "馆陶县"
        },
        {
            "parentId": "130400",
            "cityId": "130434",
            "spell": "wx",
            "city": "魏县"
        },
        {
            "parentId": "130400",
            "cityId": "130435",
            "spell": "qzx",
            "city": "曲周县"
        },
        {
            "parentId": "130400",
            "cityId": "130481",
            "spell": "was",
            "city": "武安市"
        },
        {
            "parentId": "130000",
            "cityId": "130500",
            "spell": "xts",
            "city": "邢台市"
        },
        {
            "parentId": "130500",
            "cityId": "130501",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "130500",
            "cityId": "130502",
            "spell": "qdq",
            "city": "桥东区"
        },
        {
            "parentId": "130500",
            "cityId": "130503",
            "spell": "qxq",
            "city": "桥西区"
        },
        {
            "parentId": "130500",
            "cityId": "130521",
            "spell": "xtx",
            "city": "邢台县"
        },
        {
            "parentId": "130500",
            "cityId": "130522",
            "spell": "lcx",
            "city": "临城县"
        },
        {
            "parentId": "130500",
            "cityId": "130523",
            "spell": "nqx",
            "city": "内丘县"
        },
        {
            "parentId": "130500",
            "cityId": "130524",
            "spell": "bxx",
            "city": "柏乡县"
        },
        {
            "parentId": "130500",
            "cityId": "130525",
            "spell": "lyx",
            "city": "隆尧县"
        },
        {
            "parentId": "130500",
            "cityId": "130526",
            "spell": "rx",
            "city": "任县"
        },
        {
            "parentId": "130500",
            "cityId": "130527",
            "spell": "nhx",
            "city": "南和县"
        },
        {
            "parentId": "130500",
            "cityId": "130528",
            "spell": "njx",
            "city": "宁晋县"
        },
        {
            "parentId": "130500",
            "cityId": "130529",
            "spell": "jlx",
            "city": "巨鹿县"
        },
        {
            "parentId": "130500",
            "cityId": "130530",
            "spell": "xhx",
            "city": "新河县"
        },
        {
            "parentId": "130500",
            "cityId": "130531",
            "spell": "gzx",
            "city": "广宗县"
        },
        {
            "parentId": "130500",
            "cityId": "130532",
            "spell": "pxx",
            "city": "平乡县"
        },
        {
            "parentId": "130500",
            "cityId": "130533",
            "spell": "wx",
            "city": "威县"
        },
        {
            "parentId": "130500",
            "cityId": "130534",
            "spell": "qhx",
            "city": "清河县"
        },
        {
            "parentId": "130500",
            "cityId": "130535",
            "spell": "lxx",
            "city": "临西县"
        },
        {
            "parentId": "130500",
            "cityId": "130581",
            "spell": "ngs",
            "city": "南宫市"
        },
        {
            "parentId": "130500",
            "cityId": "130582",
            "spell": "shs",
            "city": "沙河市"
        },
        {
            "parentId": "130000",
            "cityId": "130600",
            "spell": "bds",
            "city": "保定市"
        },
        {
            "parentId": "130600",
            "cityId": "130601",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "130600",
            "cityId": "130602",
            "spell": "xsq",
            "city": "新市区"
        },
        {
            "parentId": "130600",
            "cityId": "130603",
            "spell": "bsq",
            "city": "北市区"
        },
        {
            "parentId": "130600",
            "cityId": "130604",
            "spell": "nsq",
            "city": "南市区"
        },
        {
            "parentId": "130600",
            "cityId": "130621",
            "spell": "mcx",
            "city": "满城县"
        },
        {
            "parentId": "130600",
            "cityId": "130622",
            "spell": "qyx",
            "city": "清苑县"
        },
        {
            "parentId": "130600",
            "cityId": "130623",
            "spell": "lsx",
            "city": "涞水县"
        },
        {
            "parentId": "130600",
            "cityId": "130624",
            "spell": "fpx",
            "city": "阜平县"
        },
        {
            "parentId": "130600",
            "cityId": "130625",
            "spell": "xsx",
            "city": "徐水县"
        },
        {
            "parentId": "130600",
            "cityId": "130626",
            "spell": "dxx",
            "city": "定兴县"
        },
        {
            "parentId": "130600",
            "cityId": "130627",
            "spell": "tx",
            "city": "唐县"
        },
        {
            "parentId": "130600",
            "cityId": "130628",
            "spell": "gyx",
            "city": "高阳县"
        },
        {
            "parentId": "130600",
            "cityId": "130629",
            "spell": "rcx",
            "city": "容城县"
        },
        {
            "parentId": "130600",
            "cityId": "130630",
            "spell": "lyx",
            "city": "涞源县"
        },
        {
            "parentId": "130600",
            "cityId": "130631",
            "spell": "wdx",
            "city": "望都县"
        },
        {
            "parentId": "130600",
            "cityId": "130632",
            "spell": "axx",
            "city": "安新县"
        },
        {
            "parentId": "130600",
            "cityId": "130633",
            "spell": "yx",
            "city": "易县"
        },
        {
            "parentId": "130600",
            "cityId": "130634",
            "spell": "qyx",
            "city": "曲阳县"
        },
        {
            "parentId": "130600",
            "cityId": "130635",
            "spell": "lx",
            "city": "蠡县"
        },
        {
            "parentId": "130600",
            "cityId": "130636",
            "spell": "spx",
            "city": "顺平县"
        },
        {
            "parentId": "130600",
            "cityId": "130637",
            "spell": "byx",
            "city": "博野县"
        },
        {
            "parentId": "130600",
            "cityId": "130638",
            "spell": "xx",
            "city": "雄县"
        },
        {
            "parentId": "130600",
            "cityId": "130681",
            "spell": "zzs",
            "city": "涿州市"
        },
        {
            "parentId": "130600",
            "cityId": "130682",
            "spell": "dzs",
            "city": "定州市"
        },
        {
            "parentId": "130600",
            "cityId": "130683",
            "spell": "ags",
            "city": "安国市"
        },
        {
            "parentId": "130600",
            "cityId": "130684",
            "spell": "gbds",
            "city": "高碑店市"
        },
        {
            "parentId": "130000",
            "cityId": "130700",
            "spell": "zjks",
            "city": "张家口市"
        },
        {
            "parentId": "130700",
            "cityId": "130701",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "130700",
            "cityId": "130702",
            "spell": "qdq",
            "city": "桥东区"
        },
        {
            "parentId": "130700",
            "cityId": "130703",
            "spell": "qxq",
            "city": "桥西区"
        },
        {
            "parentId": "130700",
            "cityId": "130705",
            "spell": "xhq",
            "city": "宣化区"
        },
        {
            "parentId": "130700",
            "cityId": "130706",
            "spell": "xhyq",
            "city": "下花园区"
        },
        {
            "parentId": "130700",
            "cityId": "130721",
            "spell": "xhx",
            "city": "宣化县"
        },
        {
            "parentId": "130700",
            "cityId": "130722",
            "spell": "zbx",
            "city": "张北县"
        },
        {
            "parentId": "130700",
            "cityId": "130723",
            "spell": "kbx",
            "city": "康保县"
        },
        {
            "parentId": "130700",
            "cityId": "130724",
            "spell": "gyx",
            "city": "沽源县"
        },
        {
            "parentId": "130700",
            "cityId": "130725",
            "spell": "syx",
            "city": "尚义县"
        },
        {
            "parentId": "130700",
            "cityId": "130726",
            "spell": "yx",
            "city": "蔚县"
        },
        {
            "parentId": "130700",
            "cityId": "130727",
            "spell": "yyx",
            "city": "阳原县"
        },
        {
            "parentId": "130700",
            "cityId": "130728",
            "spell": "hax",
            "city": "怀安县"
        },
        {
            "parentId": "130700",
            "cityId": "130729",
            "spell": "wqx",
            "city": "万全县"
        },
        {
            "parentId": "130700",
            "cityId": "130730",
            "spell": "hlx",
            "city": "怀来县"
        },
        {
            "parentId": "130700",
            "cityId": "130731",
            "spell": "zlx",
            "city": "涿鹿县"
        },
        {
            "parentId": "130700",
            "cityId": "130732",
            "spell": "ccx",
            "city": "赤城县"
        },
        {
            "parentId": "130700",
            "cityId": "130733",
            "spell": "clx",
            "city": "崇礼县"
        },
        {
            "parentId": "130000",
            "cityId": "130800",
            "spell": "cds",
            "city": "承德市"
        },
        {
            "parentId": "130800",
            "cityId": "130801",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "130800",
            "cityId": "130802",
            "spell": "sqq",
            "city": "双桥区"
        },
        {
            "parentId": "130800",
            "cityId": "130803",
            "spell": "slq",
            "city": "双滦区"
        },
        {
            "parentId": "130800",
            "cityId": "130804",
            "spell": "ysyzkq",
            "city": "鹰手营子矿区"
        },
        {
            "parentId": "130800",
            "cityId": "130821",
            "spell": "cdx",
            "city": "承德县"
        },
        {
            "parentId": "130800",
            "cityId": "130822",
            "spell": "xlx",
            "city": "兴隆县"
        },
        {
            "parentId": "130800",
            "cityId": "130823",
            "spell": "pqx",
            "city": "平泉县"
        },
        {
            "parentId": "130800",
            "cityId": "130824",
            "spell": "lpx",
            "city": "滦平县"
        },
        {
            "parentId": "130800",
            "cityId": "130825",
            "spell": "lhx",
            "city": "隆化县"
        },
        {
            "parentId": "130800",
            "cityId": "130826",
            "spell": "fnmzzzx",
            "city": "丰宁满族自治县"
        },
        {
            "parentId": "130800",
            "cityId": "130827",
            "spell": "kcmzzzx",
            "city": "宽城满族自治县"
        },
        {
            "parentId": "130800",
            "cityId": "130828",
            "spell": "wcmzmgzzzx",
            "city": "围场满族蒙古族自治县"
        },
        {
            "parentId": "130000",
            "cityId": "130900",
            "spell": "czs",
            "city": "沧州市"
        },
        {
            "parentId": "130900",
            "cityId": "130901",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "130900",
            "cityId": "130902",
            "spell": "xhq",
            "city": "新华区"
        },
        {
            "parentId": "130900",
            "cityId": "130903",
            "spell": "yhq",
            "city": "运河区"
        },
        {
            "parentId": "130900",
            "cityId": "130921",
            "spell": "cx",
            "city": "沧县"
        },
        {
            "parentId": "130900",
            "cityId": "130922",
            "spell": "qx",
            "city": "青县"
        },
        {
            "parentId": "130900",
            "cityId": "130923",
            "spell": "dgx",
            "city": "东光县"
        },
        {
            "parentId": "130900",
            "cityId": "130924",
            "spell": "hxx",
            "city": "海兴县"
        },
        {
            "parentId": "130900",
            "cityId": "130925",
            "spell": "ysx",
            "city": "盐山县"
        },
        {
            "parentId": "130900",
            "cityId": "130926",
            "spell": "snx",
            "city": "肃宁县"
        },
        {
            "parentId": "130900",
            "cityId": "130927",
            "spell": "npx",
            "city": "南皮县"
        },
        {
            "parentId": "130900",
            "cityId": "130928",
            "spell": "wqx",
            "city": "吴桥县"
        },
        {
            "parentId": "130900",
            "cityId": "130929",
            "spell": "xx",
            "city": "献县"
        },
        {
            "parentId": "130900",
            "cityId": "130930",
            "spell": "mchzzzx",
            "city": "孟村回族自治县"
        },
        {
            "parentId": "130900",
            "cityId": "130981",
            "spell": "bts",
            "city": "泊头市"
        },
        {
            "parentId": "130900",
            "cityId": "130982",
            "spell": "rqs",
            "city": "任丘市"
        },
        {
            "parentId": "130900",
            "cityId": "130983",
            "spell": "hhs",
            "city": "黄骅市"
        },
        {
            "parentId": "130900",
            "cityId": "130984",
            "spell": "hjs",
            "city": "河间市"
        },
        {
            "parentId": "130000",
            "cityId": "131000",
            "spell": "lfs",
            "city": "廊坊市"
        },
        {
            "parentId": "131000",
            "cityId": "131001",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "131000",
            "cityId": "131002",
            "spell": "acq",
            "city": "安次区"
        },
        {
            "parentId": "131000",
            "cityId": "131003",
            "spell": "gyq",
            "city": "广阳区"
        },
        {
            "parentId": "131000",
            "cityId": "131022",
            "spell": "gax",
            "city": "固安县"
        },
        {
            "parentId": "131000",
            "cityId": "131023",
            "spell": "yqx",
            "city": "永清县"
        },
        {
            "parentId": "131000",
            "cityId": "131024",
            "spell": "xhx",
            "city": "香河县"
        },
        {
            "parentId": "131000",
            "cityId": "131025",
            "spell": "dcx",
            "city": "大城县"
        },
        {
            "parentId": "131000",
            "cityId": "131026",
            "spell": "wax",
            "city": "文安县"
        },
        {
            "parentId": "131000",
            "cityId": "131028",
            "spell": "dchzzzx",
            "city": "大厂回族自治县"
        },
        {
            "parentId": "131000",
            "cityId": "131081",
            "spell": "bzs",
            "city": "霸州市"
        },
        {
            "parentId": "131000",
            "cityId": "131082",
            "spell": "shs",
            "city": "三河市"
        },
        {
            "parentId": "130000",
            "cityId": "131100",
            "spell": "hss",
            "city": "衡水市"
        },
        {
            "parentId": "131100",
            "cityId": "131101",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "131100",
            "cityId": "131102",
            "spell": "tcq",
            "city": "桃城区"
        },
        {
            "parentId": "131100",
            "cityId": "131121",
            "spell": "zqx",
            "city": "枣强县"
        },
        {
            "parentId": "131100",
            "cityId": "131122",
            "spell": "wyx",
            "city": "武邑县"
        },
        {
            "parentId": "131100",
            "cityId": "131123",
            "spell": "wqx",
            "city": "武强县"
        },
        {
            "parentId": "131100",
            "cityId": "131124",
            "spell": "ryx",
            "city": "饶阳县"
        },
        {
            "parentId": "131100",
            "cityId": "131125",
            "spell": "apx",
            "city": "安平县"
        },
        {
            "parentId": "131100",
            "cityId": "131126",
            "spell": "gcx",
            "city": "故城县"
        },
        {
            "parentId": "131100",
            "cityId": "131127",
            "spell": "jx",
            "city": "景县"
        },
        {
            "parentId": "131100",
            "cityId": "131128",
            "spell": "fcx",
            "city": "阜城县"
        },
        {
            "parentId": "131100",
            "cityId": "131181",
            "spell": "jzs",
            "city": "冀州市"
        },
        {
            "parentId": "131100",
            "cityId": "131182",
            "spell": "szs",
            "city": "深州市"
        },
        {
            "parentId": "0",
            "cityId": "140000",
            "spell": "sxs",
            "city": "山西省"
        },
        {
            "parentId": "140000",
            "cityId": "140100",
            "spell": "tys",
            "city": "太原市"
        },
        {
            "parentId": "140100",
            "cityId": "140101",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "140100",
            "cityId": "140105",
            "spell": "xdq",
            "city": "小店区"
        },
        {
            "parentId": "140100",
            "cityId": "140106",
            "spell": "yzq",
            "city": "迎泽区"
        },
        {
            "parentId": "140100",
            "cityId": "140107",
            "spell": "xhlq",
            "city": "杏花岭区"
        },
        {
            "parentId": "140100",
            "cityId": "140108",
            "spell": "jcpq",
            "city": "尖草坪区"
        },
        {
            "parentId": "140100",
            "cityId": "140109",
            "spell": "wblq",
            "city": "万柏林区"
        },
        {
            "parentId": "140100",
            "cityId": "140110",
            "spell": "jyq",
            "city": "晋源区"
        },
        {
            "parentId": "140100",
            "cityId": "140121",
            "spell": "qxx",
            "city": "清徐县"
        },
        {
            "parentId": "140100",
            "cityId": "140122",
            "spell": "yqx",
            "city": "阳曲县"
        },
        {
            "parentId": "140100",
            "cityId": "140123",
            "spell": "lfx",
            "city": "娄烦县"
        },
        {
            "parentId": "140100",
            "cityId": "140181",
            "spell": "gjs",
            "city": "古交市"
        },
        {
            "parentId": "140000",
            "cityId": "140200",
            "spell": "dts",
            "city": "大同市"
        },
        {
            "parentId": "140200",
            "cityId": "140201",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "140200",
            "cityId": "140202",
            "spell": "cq",
            "city": "城区"
        },
        {
            "parentId": "140200",
            "cityId": "140203",
            "spell": "kq",
            "city": "矿区"
        },
        {
            "parentId": "140200",
            "cityId": "140211",
            "spell": "njq",
            "city": "南郊区"
        },
        {
            "parentId": "140200",
            "cityId": "140212",
            "spell": "xrq",
            "city": "新荣区"
        },
        {
            "parentId": "140200",
            "cityId": "140221",
            "spell": "ygx",
            "city": "阳高县"
        },
        {
            "parentId": "140200",
            "cityId": "140222",
            "spell": "tzx",
            "city": "天镇县"
        },
        {
            "parentId": "140200",
            "cityId": "140223",
            "spell": "glx",
            "city": "广灵县"
        },
        {
            "parentId": "140200",
            "cityId": "140224",
            "spell": "lqx",
            "city": "灵丘县"
        },
        {
            "parentId": "140200",
            "cityId": "140225",
            "spell": "hyx",
            "city": "浑源县"
        },
        {
            "parentId": "140200",
            "cityId": "140226",
            "spell": "zyx",
            "city": "左云县"
        },
        {
            "parentId": "140200",
            "cityId": "140227",
            "spell": "dtx",
            "city": "大同县"
        },
        {
            "parentId": "140000",
            "cityId": "140300",
            "spell": "yqs",
            "city": "阳泉市"
        },
        {
            "parentId": "140300",
            "cityId": "140301",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "140300",
            "cityId": "140302",
            "spell": "cq",
            "city": "城区"
        },
        {
            "parentId": "140300",
            "cityId": "140303",
            "spell": "kq",
            "city": "矿区"
        },
        {
            "parentId": "140300",
            "cityId": "140311",
            "spell": "jq",
            "city": "郊区"
        },
        {
            "parentId": "140300",
            "cityId": "140321",
            "spell": "pdx",
            "city": "平定县"
        },
        {
            "parentId": "140300",
            "cityId": "140322",
            "spell": "yx",
            "city": "盂县"
        },
        {
            "parentId": "140000",
            "cityId": "140400",
            "spell": "czs",
            "city": "长治市"
        },
        {
            "parentId": "140400",
            "cityId": "140401",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "140400",
            "cityId": "140402",
            "spell": "cq",
            "city": "城区"
        },
        {
            "parentId": "140400",
            "cityId": "140411",
            "spell": "jq",
            "city": "郊区"
        },
        {
            "parentId": "140400",
            "cityId": "140421",
            "spell": "czx",
            "city": "长治县"
        },
        {
            "parentId": "140400",
            "cityId": "140423",
            "spell": "xyx",
            "city": "襄垣县"
        },
        {
            "parentId": "140400",
            "cityId": "140424",
            "spell": "tlx",
            "city": "屯留县"
        },
        {
            "parentId": "140400",
            "cityId": "140425",
            "spell": "psx",
            "city": "平顺县"
        },
        {
            "parentId": "140400",
            "cityId": "140426",
            "spell": "lcx",
            "city": "黎城县"
        },
        {
            "parentId": "140400",
            "cityId": "140427",
            "spell": "hgx",
            "city": "壶关县"
        },
        {
            "parentId": "140400",
            "cityId": "140428",
            "spell": "czx",
            "city": "长子县"
        },
        {
            "parentId": "140400",
            "cityId": "140429",
            "spell": "wxx",
            "city": "武乡县"
        },
        {
            "parentId": "140400",
            "cityId": "140430",
            "spell": "qx",
            "city": "沁县"
        },
        {
            "parentId": "140400",
            "cityId": "140431",
            "spell": "qyx",
            "city": "沁源县"
        },
        {
            "parentId": "140400",
            "cityId": "140481",
            "spell": "lcs",
            "city": "潞城市"
        },
        {
            "parentId": "140000",
            "cityId": "140500",
            "spell": "jcs",
            "city": "晋城市"
        },
        {
            "parentId": "140500",
            "cityId": "140501",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "140500",
            "cityId": "140502",
            "spell": "cq",
            "city": "城区"
        },
        {
            "parentId": "140500",
            "cityId": "140521",
            "spell": "qsx",
            "city": "沁水县"
        },
        {
            "parentId": "140500",
            "cityId": "140522",
            "spell": "ycx",
            "city": "阳城县"
        },
        {
            "parentId": "140500",
            "cityId": "140524",
            "spell": "lcx",
            "city": "陵川县"
        },
        {
            "parentId": "140500",
            "cityId": "140525",
            "spell": "zzx",
            "city": "泽州县"
        },
        {
            "parentId": "140500",
            "cityId": "140581",
            "spell": "gps",
            "city": "高平市"
        },
        {
            "parentId": "140000",
            "cityId": "140600",
            "spell": "szs",
            "city": "朔州市"
        },
        {
            "parentId": "140600",
            "cityId": "140601",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "140600",
            "cityId": "140602",
            "spell": "scq",
            "city": "朔城区"
        },
        {
            "parentId": "140600",
            "cityId": "140603",
            "spell": "plq",
            "city": "平鲁区"
        },
        {
            "parentId": "140600",
            "cityId": "140621",
            "spell": "syx",
            "city": "山阴县"
        },
        {
            "parentId": "140600",
            "cityId": "140622",
            "spell": "yx",
            "city": "应县"
        },
        {
            "parentId": "140600",
            "cityId": "140623",
            "spell": "yyx",
            "city": "右玉县"
        },
        {
            "parentId": "140600",
            "cityId": "140624",
            "spell": "hrx",
            "city": "怀仁县"
        },
        {
            "parentId": "140000",
            "cityId": "140700",
            "spell": "jzs",
            "city": "晋中市"
        },
        {
            "parentId": "140700",
            "cityId": "140701",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "140700",
            "cityId": "140702",
            "spell": "ycq",
            "city": "榆次区"
        },
        {
            "parentId": "140700",
            "cityId": "140721",
            "spell": "ysx",
            "city": "榆社县"
        },
        {
            "parentId": "140700",
            "cityId": "140722",
            "spell": "zqx",
            "city": "左权县"
        },
        {
            "parentId": "140700",
            "cityId": "140723",
            "spell": "hsx",
            "city": "和顺县"
        },
        {
            "parentId": "140700",
            "cityId": "140724",
            "spell": "xyx",
            "city": "昔阳县"
        },
        {
            "parentId": "140700",
            "cityId": "140725",
            "spell": "syx",
            "city": "寿阳县"
        },
        {
            "parentId": "140700",
            "cityId": "140726",
            "spell": "tgx",
            "city": "太谷县"
        },
        {
            "parentId": "140700",
            "cityId": "140727",
            "spell": "qx",
            "city": "祁县"
        },
        {
            "parentId": "140700",
            "cityId": "140728",
            "spell": "pyx",
            "city": "平遥县"
        },
        {
            "parentId": "140700",
            "cityId": "140729",
            "spell": "lsx",
            "city": "灵石县"
        },
        {
            "parentId": "140700",
            "cityId": "140781",
            "spell": "jxs",
            "city": "介休市"
        },
        {
            "parentId": "140000",
            "cityId": "140800",
            "spell": "ycs",
            "city": "运城市"
        },
        {
            "parentId": "140800",
            "cityId": "140801",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "140800",
            "cityId": "140802",
            "spell": "yhq",
            "city": "盐湖区"
        },
        {
            "parentId": "140800",
            "cityId": "140821",
            "spell": "lyx",
            "city": "临猗县"
        },
        {
            "parentId": "140800",
            "cityId": "140822",
            "spell": "wrx",
            "city": "万荣县"
        },
        {
            "parentId": "140800",
            "cityId": "140823",
            "spell": "wxx",
            "city": "闻喜县"
        },
        {
            "parentId": "140800",
            "cityId": "140824",
            "spell": "jsx",
            "city": "稷山县"
        },
        {
            "parentId": "140800",
            "cityId": "140825",
            "spell": "xjx",
            "city": "新绛县"
        },
        {
            "parentId": "140800",
            "cityId": "140826",
            "spell": "jx",
            "city": "绛县"
        },
        {
            "parentId": "140800",
            "cityId": "140827",
            "spell": "yqx",
            "city": "垣曲县"
        },
        {
            "parentId": "140800",
            "cityId": "140828",
            "spell": "xx",
            "city": "夏县"
        },
        {
            "parentId": "140800",
            "cityId": "140829",
            "spell": "plx",
            "city": "平陆县"
        },
        {
            "parentId": "140800",
            "cityId": "140830",
            "spell": "rcx",
            "city": "芮城县"
        },
        {
            "parentId": "140800",
            "cityId": "140881",
            "spell": "yjs",
            "city": "永济市"
        },
        {
            "parentId": "140800",
            "cityId": "140882",
            "spell": "hjs",
            "city": "河津市"
        },
        {
            "parentId": "140000",
            "cityId": "140900",
            "spell": "xzs",
            "city": "忻州市"
        },
        {
            "parentId": "140900",
            "cityId": "140901",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "140900",
            "cityId": "140902",
            "spell": "xfq",
            "city": "忻府区"
        },
        {
            "parentId": "140900",
            "cityId": "140921",
            "spell": "dxx",
            "city": "定襄县"
        },
        {
            "parentId": "140900",
            "cityId": "140922",
            "spell": "wtx",
            "city": "五台县"
        },
        {
            "parentId": "140900",
            "cityId": "140923",
            "spell": "dx",
            "city": "代县"
        },
        {
            "parentId": "140900",
            "cityId": "140924",
            "spell": "fzx",
            "city": "繁峙县"
        },
        {
            "parentId": "140900",
            "cityId": "140925",
            "spell": "nwx",
            "city": "宁武县"
        },
        {
            "parentId": "140900",
            "cityId": "140926",
            "spell": "jlx",
            "city": "静乐县"
        },
        {
            "parentId": "140900",
            "cityId": "140927",
            "spell": "scx",
            "city": "神池县"
        },
        {
            "parentId": "140900",
            "cityId": "140928",
            "spell": "wzx",
            "city": "五寨县"
        },
        {
            "parentId": "140900",
            "cityId": "140929",
            "spell": "klx",
            "city": "岢岚县"
        },
        {
            "parentId": "140900",
            "cityId": "140930",
            "spell": "hqx",
            "city": "河曲县"
        },
        {
            "parentId": "140900",
            "cityId": "140931",
            "spell": "bdx",
            "city": "保德县"
        },
        {
            "parentId": "140900",
            "cityId": "140932",
            "spell": "pgx",
            "city": "偏关县"
        },
        {
            "parentId": "140900",
            "cityId": "140981",
            "spell": "yps",
            "city": "原平市"
        },
        {
            "parentId": "140000",
            "cityId": "141000",
            "spell": "lfs",
            "city": "临汾市"
        },
        {
            "parentId": "141000",
            "cityId": "141001",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "141000",
            "cityId": "141002",
            "spell": "ydq",
            "city": "尧都区"
        },
        {
            "parentId": "141000",
            "cityId": "141021",
            "spell": "qwx",
            "city": "曲沃县"
        },
        {
            "parentId": "141000",
            "cityId": "141022",
            "spell": "ycx",
            "city": "翼城县"
        },
        {
            "parentId": "141000",
            "cityId": "141023",
            "spell": "xfx",
            "city": "襄汾县"
        },
        {
            "parentId": "141000",
            "cityId": "141024",
            "spell": "hdx",
            "city": "洪洞县"
        },
        {
            "parentId": "141000",
            "cityId": "141025",
            "spell": "gx",
            "city": "古县"
        },
        {
            "parentId": "141000",
            "cityId": "141026",
            "spell": "azx",
            "city": "安泽县"
        },
        {
            "parentId": "141000",
            "cityId": "141027",
            "spell": "fsx",
            "city": "浮山县"
        },
        {
            "parentId": "141000",
            "cityId": "141028",
            "spell": "jx",
            "city": "吉县"
        },
        {
            "parentId": "141000",
            "cityId": "141029",
            "spell": "xnx",
            "city": "乡宁县"
        },
        {
            "parentId": "141000",
            "cityId": "141030",
            "spell": "dnx",
            "city": "大宁县"
        },
        {
            "parentId": "141000",
            "cityId": "141031",
            "spell": "xx",
            "city": "隰县"
        },
        {
            "parentId": "141000",
            "cityId": "141032",
            "spell": "yhx",
            "city": "永和县"
        },
        {
            "parentId": "141000",
            "cityId": "141033",
            "spell": "px",
            "city": "蒲县"
        },
        {
            "parentId": "141000",
            "cityId": "141034",
            "spell": "fxx",
            "city": "汾西县"
        },
        {
            "parentId": "141000",
            "cityId": "141081",
            "spell": "hms",
            "city": "侯马市"
        },
        {
            "parentId": "141000",
            "cityId": "141082",
            "spell": "hzs",
            "city": "霍州市"
        },
        {
            "parentId": "140000",
            "cityId": "141100",
            "spell": "lls",
            "city": "吕梁市"
        },
        {
            "parentId": "141100",
            "cityId": "141101",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "141100",
            "cityId": "141102",
            "spell": "lsq",
            "city": "离石区"
        },
        {
            "parentId": "141100",
            "cityId": "141121",
            "spell": "wsx",
            "city": "文水县"
        },
        {
            "parentId": "141100",
            "cityId": "141122",
            "spell": "jcx",
            "city": "交城县"
        },
        {
            "parentId": "141100",
            "cityId": "141123",
            "spell": "xx",
            "city": "兴县"
        },
        {
            "parentId": "141100",
            "cityId": "141124",
            "spell": "lx",
            "city": "临县"
        },
        {
            "parentId": "141100",
            "cityId": "141125",
            "spell": "llx",
            "city": "柳林县"
        },
        {
            "parentId": "141100",
            "cityId": "141126",
            "spell": "slx",
            "city": "石楼县"
        },
        {
            "parentId": "141100",
            "cityId": "141127",
            "spell": "lx",
            "city": "岚县"
        },
        {
            "parentId": "141100",
            "cityId": "141128",
            "spell": "fsx",
            "city": "方山县"
        },
        {
            "parentId": "141100",
            "cityId": "141129",
            "spell": "zyx",
            "city": "中阳县"
        },
        {
            "parentId": "141100",
            "cityId": "141130",
            "spell": "jkx",
            "city": "交口县"
        },
        {
            "parentId": "141100",
            "cityId": "141181",
            "spell": "xys",
            "city": "孝义市"
        },
        {
            "parentId": "141100",
            "cityId": "141182",
            "spell": "fys",
            "city": "汾阳市"
        },
        {
            "parentId": "0",
            "cityId": "150000",
            "spell": "nmgzzq",
            "city": "内蒙古自治区"
        },
        {
            "parentId": "150000",
            "cityId": "150100",
            "spell": "hhhts",
            "city": "呼和浩特市"
        },
        {
            "parentId": "150100",
            "cityId": "150101",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "150100",
            "cityId": "150102",
            "spell": "xcq",
            "city": "新城区"
        },
        {
            "parentId": "150100",
            "cityId": "150103",
            "spell": "hmq",
            "city": "回民区"
        },
        {
            "parentId": "150100",
            "cityId": "150104",
            "spell": "yqq",
            "city": "玉泉区"
        },
        {
            "parentId": "150100",
            "cityId": "150105",
            "spell": "shq",
            "city": "赛罕区"
        },
        {
            "parentId": "150100",
            "cityId": "150121",
            "spell": "tmtzq",
            "city": "土默特左旗"
        },
        {
            "parentId": "150100",
            "cityId": "150122",
            "spell": "tktx",
            "city": "托克托县"
        },
        {
            "parentId": "150100",
            "cityId": "150123",
            "spell": "hlgex",
            "city": "和林格尔县"
        },
        {
            "parentId": "150100",
            "cityId": "150124",
            "spell": "qshx",
            "city": "清水河县"
        },
        {
            "parentId": "150100",
            "cityId": "150125",
            "spell": "wcx",
            "city": "武川县"
        },
        {
            "parentId": "150000",
            "cityId": "150200",
            "spell": "bts",
            "city": "包头市"
        },
        {
            "parentId": "150200",
            "cityId": "150201",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "150200",
            "cityId": "150202",
            "spell": "dhq",
            "city": "东河区"
        },
        {
            "parentId": "150200",
            "cityId": "150203",
            "spell": "kdlq",
            "city": "昆都仑区"
        },
        {
            "parentId": "150200",
            "cityId": "150204",
            "spell": "qsq",
            "city": "青山区"
        },
        {
            "parentId": "150200",
            "cityId": "150205",
            "spell": "sgq",
            "city": "石拐区"
        },
        {
            "parentId": "150200",
            "cityId": "150206",
            "spell": "byebkq",
            "city": "白云鄂博矿区"
        },
        {
            "parentId": "150200",
            "cityId": "150207",
            "spell": "jyq",
            "city": "九原区"
        },
        {
            "parentId": "150200",
            "cityId": "150221",
            "spell": "tmtyq",
            "city": "土默特右旗"
        },
        {
            "parentId": "150200",
            "cityId": "150222",
            "spell": "gyx",
            "city": "固阳县"
        },
        {
            "parentId": "150200",
            "cityId": "150223",
            "spell": "dehmmalhq",
            "city": "达尔罕茂明安联合旗"
        },
        {
            "parentId": "150000",
            "cityId": "150300",
            "spell": "whs",
            "city": "乌海市"
        },
        {
            "parentId": "150300",
            "cityId": "150301",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "150300",
            "cityId": "150302",
            "spell": "hbwq",
            "city": "海勃湾区"
        },
        {
            "parentId": "150300",
            "cityId": "150303",
            "spell": "hnq",
            "city": "海南区"
        },
        {
            "parentId": "150300",
            "cityId": "150304",
            "spell": "wdq",
            "city": "乌达区"
        },
        {
            "parentId": "150000",
            "cityId": "150400",
            "spell": "cfs",
            "city": "赤峰市"
        },
        {
            "parentId": "150400",
            "cityId": "150401",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "150400",
            "cityId": "150402",
            "spell": "hsq",
            "city": "红山区"
        },
        {
            "parentId": "150400",
            "cityId": "150403",
            "spell": "ybsq",
            "city": "元宝山区"
        },
        {
            "parentId": "150400",
            "cityId": "150404",
            "spell": "ssq",
            "city": "松山区"
        },
        {
            "parentId": "150400",
            "cityId": "150421",
            "spell": "alkeqq",
            "city": "阿鲁科尔沁旗"
        },
        {
            "parentId": "150400",
            "cityId": "150422",
            "spell": "blzq",
            "city": "巴林左旗"
        },
        {
            "parentId": "150400",
            "cityId": "150423",
            "spell": "blyq",
            "city": "巴林右旗"
        },
        {
            "parentId": "150400",
            "cityId": "150424",
            "spell": "lxx",
            "city": "林西县"
        },
        {
            "parentId": "150400",
            "cityId": "150425",
            "spell": "ksktq",
            "city": "克什克腾旗"
        },
        {
            "parentId": "150400",
            "cityId": "150426",
            "spell": "wntq",
            "city": "翁牛特旗"
        },
        {
            "parentId": "150400",
            "cityId": "150428",
            "spell": "klqq",
            "city": "喀喇沁旗"
        },
        {
            "parentId": "150400",
            "cityId": "150429",
            "spell": "ncx",
            "city": "宁城县"
        },
        {
            "parentId": "150400",
            "cityId": "150430",
            "spell": "ahq",
            "city": "敖汉旗"
        },
        {
            "parentId": "150000",
            "cityId": "150500",
            "spell": "tls",
            "city": "通辽市"
        },
        {
            "parentId": "150500",
            "cityId": "150501",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "150500",
            "cityId": "150502",
            "spell": "keqq",
            "city": "科尔沁区"
        },
        {
            "parentId": "150500",
            "cityId": "150521",
            "spell": "keqzyzq",
            "city": "科尔沁左翼中旗"
        },
        {
            "parentId": "150500",
            "cityId": "150522",
            "spell": "keqzyhq",
            "city": "科尔沁左翼后旗"
        },
        {
            "parentId": "150500",
            "cityId": "150523",
            "spell": "klx",
            "city": "开鲁县"
        },
        {
            "parentId": "150500",
            "cityId": "150524",
            "spell": "klq",
            "city": "库伦旗"
        },
        {
            "parentId": "150500",
            "cityId": "150525",
            "spell": "nmq",
            "city": "奈曼旗"
        },
        {
            "parentId": "150500",
            "cityId": "150526",
            "spell": "zltq",
            "city": "扎鲁特旗"
        },
        {
            "parentId": "150500",
            "cityId": "150581",
            "spell": "hlgls",
            "city": "霍林郭勒市"
        },
        {
            "parentId": "150000",
            "cityId": "150600",
            "spell": "eedss",
            "city": "鄂尔多斯市"
        },
        {
            "parentId": "150600",
            "cityId": "150601",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "150600",
            "cityId": "150602",
            "spell": "dsq",
            "city": "东胜区"
        },
        {
            "parentId": "150600",
            "cityId": "150621",
            "spell": "dltq",
            "city": "达拉特旗"
        },
        {
            "parentId": "150600",
            "cityId": "150622",
            "spell": "zgeq",
            "city": "准格尔旗"
        },
        {
            "parentId": "150600",
            "cityId": "150623",
            "spell": "etkqq",
            "city": "鄂托克前旗"
        },
        {
            "parentId": "150600",
            "cityId": "150624",
            "spell": "etkq",
            "city": "鄂托克旗"
        },
        {
            "parentId": "150600",
            "cityId": "150625",
            "spell": "hjq",
            "city": "杭锦旗"
        },
        {
            "parentId": "150600",
            "cityId": "150626",
            "spell": "wsq",
            "city": "乌审旗"
        },
        {
            "parentId": "150600",
            "cityId": "150627",
            "spell": "yjhlq",
            "city": "伊金霍洛旗"
        },
        {
            "parentId": "150000",
            "cityId": "150700",
            "spell": "hlbes",
            "city": "呼伦贝尔市"
        },
        {
            "parentId": "150700",
            "cityId": "150701",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "150700",
            "cityId": "150702",
            "spell": "hleq",
            "city": "海拉尔区"
        },
        {
            "parentId": "150700",
            "cityId": "150703",
            "spell": "zlneq",
            "city": "扎赉诺尔区"
        },
        {
            "parentId": "150700",
            "cityId": "150721",
            "spell": "arq",
            "city": "阿荣旗"
        },
        {
            "parentId": "150700",
            "cityId": "150722",
            "spell": "mldwdwezzzq",
            "city": "莫力达瓦达斡尔族自治旗"
        },
        {
            "parentId": "150700",
            "cityId": "150723",
            "spell": "elczzq",
            "city": "鄂伦春自治旗"
        },
        {
            "parentId": "150700",
            "cityId": "150724",
            "spell": "ewkzzzq",
            "city": "鄂温克族自治旗"
        },
        {
            "parentId": "150700",
            "cityId": "150725",
            "spell": "cbehq",
            "city": "陈巴尔虎旗"
        },
        {
            "parentId": "150700",
            "cityId": "150726",
            "spell": "xbehzq",
            "city": "新巴尔虎左旗"
        },
        {
            "parentId": "150700",
            "cityId": "150727",
            "spell": "xbehyq",
            "city": "新巴尔虎右旗"
        },
        {
            "parentId": "150700",
            "cityId": "150781",
            "spell": "mzls",
            "city": "满洲里市"
        },
        {
            "parentId": "150700",
            "cityId": "150782",
            "spell": "ykss",
            "city": "牙克石市"
        },
        {
            "parentId": "150700",
            "cityId": "150783",
            "spell": "zlts",
            "city": "扎兰屯市"
        },
        {
            "parentId": "150700",
            "cityId": "150784",
            "spell": "eegns",
            "city": "额尔古纳市"
        },
        {
            "parentId": "150700",
            "cityId": "150785",
            "spell": "ghs",
            "city": "根河市"
        },
        {
            "parentId": "150000",
            "cityId": "150800",
            "spell": "bynes",
            "city": "巴彦淖尔市"
        },
        {
            "parentId": "150800",
            "cityId": "150801",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "150800",
            "cityId": "150802",
            "spell": "lhq",
            "city": "临河区"
        },
        {
            "parentId": "150800",
            "cityId": "150821",
            "spell": "wyx",
            "city": "五原县"
        },
        {
            "parentId": "150800",
            "cityId": "150822",
            "spell": "dkx",
            "city": "磴口县"
        },
        {
            "parentId": "150800",
            "cityId": "150823",
            "spell": "wltqq",
            "city": "乌拉特前旗"
        },
        {
            "parentId": "150800",
            "cityId": "150824",
            "spell": "wltzq",
            "city": "乌拉特中旗"
        },
        {
            "parentId": "150800",
            "cityId": "150825",
            "spell": "wlthq",
            "city": "乌拉特后旗"
        },
        {
            "parentId": "150800",
            "cityId": "150826",
            "spell": "hjhq",
            "city": "杭锦后旗"
        },
        {
            "parentId": "150000",
            "cityId": "150900",
            "spell": "wlcbs",
            "city": "乌兰察布市"
        },
        {
            "parentId": "150900",
            "cityId": "150901",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "150900",
            "cityId": "150902",
            "spell": "jnq",
            "city": "集宁区"
        },
        {
            "parentId": "150900",
            "cityId": "150921",
            "spell": "zzx",
            "city": "卓资县"
        },
        {
            "parentId": "150900",
            "cityId": "150922",
            "spell": "hdx",
            "city": "化德县"
        },
        {
            "parentId": "150900",
            "cityId": "150923",
            "spell": "sdx",
            "city": "商都县"
        },
        {
            "parentId": "150900",
            "cityId": "150924",
            "spell": "xhx",
            "city": "兴和县"
        },
        {
            "parentId": "150900",
            "cityId": "150925",
            "spell": "lcx",
            "city": "凉城县"
        },
        {
            "parentId": "150900",
            "cityId": "150926",
            "spell": "cheyyqq",
            "city": "察哈尔右翼前旗"
        },
        {
            "parentId": "150900",
            "cityId": "150927",
            "spell": "cheyyzq",
            "city": "察哈尔右翼中旗"
        },
        {
            "parentId": "150900",
            "cityId": "150928",
            "spell": "cheyyhq",
            "city": "察哈尔右翼后旗"
        },
        {
            "parentId": "150900",
            "cityId": "150929",
            "spell": "szwq",
            "city": "四子王旗"
        },
        {
            "parentId": "150900",
            "cityId": "150981",
            "spell": "fzs",
            "city": "丰镇市"
        },
        {
            "parentId": "150000",
            "cityId": "152200",
            "spell": "xam",
            "city": "兴安盟"
        },
        {
            "parentId": "152200",
            "cityId": "152201",
            "spell": "wlhts",
            "city": "乌兰浩特市"
        },
        {
            "parentId": "152200",
            "cityId": "152202",
            "spell": "aess",
            "city": "阿尔山市"
        },
        {
            "parentId": "152200",
            "cityId": "152221",
            "spell": "keqyyqq",
            "city": "科尔沁右翼前旗"
        },
        {
            "parentId": "152200",
            "cityId": "152222",
            "spell": "keqyyzq",
            "city": "科尔沁右翼中旗"
        },
        {
            "parentId": "152200",
            "cityId": "152223",
            "spell": "zltq",
            "city": "扎赉特旗"
        },
        {
            "parentId": "152200",
            "cityId": "152224",
            "spell": "tqx",
            "city": "突泉县"
        },
        {
            "parentId": "150000",
            "cityId": "152500",
            "spell": "xlglm",
            "city": "锡林郭勒盟"
        },
        {
            "parentId": "152500",
            "cityId": "152501",
            "spell": "elhts",
            "city": "二连浩特市"
        },
        {
            "parentId": "152500",
            "cityId": "152502",
            "spell": "xlhts",
            "city": "锡林浩特市"
        },
        {
            "parentId": "152500",
            "cityId": "152522",
            "spell": "abgq",
            "city": "阿巴嘎旗"
        },
        {
            "parentId": "152500",
            "cityId": "152523",
            "spell": "sntzq",
            "city": "苏尼特左旗"
        },
        {
            "parentId": "152500",
            "cityId": "152524",
            "spell": "sntyq",
            "city": "苏尼特右旗"
        },
        {
            "parentId": "152500",
            "cityId": "152525",
            "spell": "dwzmqq",
            "city": "东乌珠穆沁旗"
        },
        {
            "parentId": "152500",
            "cityId": "152526",
            "spell": "xwzmqq",
            "city": "西乌珠穆沁旗"
        },
        {
            "parentId": "152500",
            "cityId": "152527",
            "spell": "tpsq",
            "city": "太仆寺旗"
        },
        {
            "parentId": "152500",
            "cityId": "152528",
            "spell": "xhq",
            "city": "镶黄旗"
        },
        {
            "parentId": "152500",
            "cityId": "152529",
            "spell": "zxbq",
            "city": "正镶白旗"
        },
        {
            "parentId": "152500",
            "cityId": "152530",
            "spell": "zlq",
            "city": "正蓝旗"
        },
        {
            "parentId": "152500",
            "cityId": "152531",
            "spell": "dlx",
            "city": "多伦县"
        },
        {
            "parentId": "150000",
            "cityId": "152900",
            "spell": "alsm",
            "city": "阿拉善盟"
        },
        {
            "parentId": "152900",
            "cityId": "152921",
            "spell": "alszq",
            "city": "阿拉善左旗"
        },
        {
            "parentId": "152900",
            "cityId": "152922",
            "spell": "alsyq",
            "city": "阿拉善右旗"
        },
        {
            "parentId": "152900",
            "cityId": "152923",
            "spell": "ejnq",
            "city": "额济纳旗"
        },
        {
            "parentId": "0",
            "cityId": "210000",
            "spell": "lns",
            "city": "辽宁省"
        },
        {
            "parentId": "210000",
            "cityId": "210100",
            "spell": "sys",
            "city": "沈阳市"
        },
        {
            "parentId": "210100",
            "cityId": "210101",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "210100",
            "cityId": "210102",
            "spell": "hpq",
            "city": "和平区"
        },
        {
            "parentId": "210100",
            "cityId": "210103",
            "spell": "shq",
            "city": "沈河区"
        },
        {
            "parentId": "210100",
            "cityId": "210104",
            "spell": "ddq",
            "city": "大东区"
        },
        {
            "parentId": "210100",
            "cityId": "210105",
            "spell": "hgq",
            "city": "皇姑区"
        },
        {
            "parentId": "210100",
            "cityId": "210106",
            "spell": "txq",
            "city": "铁西区"
        },
        {
            "parentId": "210100",
            "cityId": "210111",
            "spell": "sjtq",
            "city": "苏家屯区"
        },
        {
            "parentId": "210100",
            "cityId": "210112",
            "spell": "dlq",
            "city": "东陵区"
        },
        {
            "parentId": "210100",
            "cityId": "210113",
            "spell": "sbxq",
            "city": "沈北新区"
        },
        {
            "parentId": "210100",
            "cityId": "210114",
            "spell": "yhq",
            "city": "于洪区"
        },
        {
            "parentId": "210100",
            "cityId": "210122",
            "spell": "lzx",
            "city": "辽中县"
        },
        {
            "parentId": "210100",
            "cityId": "210123",
            "spell": "kpx",
            "city": "康平县"
        },
        {
            "parentId": "210100",
            "cityId": "210124",
            "spell": "fkx",
            "city": "法库县"
        },
        {
            "parentId": "210100",
            "cityId": "210181",
            "spell": "xms",
            "city": "新民市"
        },
        {
            "parentId": "210000",
            "cityId": "210200",
            "spell": "dls",
            "city": "大连市"
        },
        {
            "parentId": "210200",
            "cityId": "210201",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "210200",
            "cityId": "210202",
            "spell": "zsq",
            "city": "中山区"
        },
        {
            "parentId": "210200",
            "cityId": "210203",
            "spell": "xgq",
            "city": "西岗区"
        },
        {
            "parentId": "210200",
            "cityId": "210204",
            "spell": "shkq",
            "city": "沙河口区"
        },
        {
            "parentId": "210200",
            "cityId": "210211",
            "spell": "gjzq",
            "city": "甘井子区"
        },
        {
            "parentId": "210200",
            "cityId": "210212",
            "spell": "lskq",
            "city": "旅顺口区"
        },
        {
            "parentId": "210200",
            "cityId": "210213",
            "spell": "jzq",
            "city": "金州区"
        },
        {
            "parentId": "210200",
            "cityId": "210224",
            "spell": "chx",
            "city": "长海县"
        },
        {
            "parentId": "210200",
            "cityId": "210281",
            "spell": "wfds",
            "city": "瓦房店市"
        },
        {
            "parentId": "210200",
            "cityId": "210282",
            "spell": "plds",
            "city": "普兰店市"
        },
        {
            "parentId": "210200",
            "cityId": "210283",
            "spell": "zhs",
            "city": "庄河市"
        },
        {
            "parentId": "210000",
            "cityId": "210300",
            "spell": "ass",
            "city": "鞍山市"
        },
        {
            "parentId": "210300",
            "cityId": "210301",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "210300",
            "cityId": "210302",
            "spell": "tdq",
            "city": "铁东区"
        },
        {
            "parentId": "210300",
            "cityId": "210303",
            "spell": "txq",
            "city": "铁西区"
        },
        {
            "parentId": "210300",
            "cityId": "210304",
            "spell": "lsq",
            "city": "立山区"
        },
        {
            "parentId": "210300",
            "cityId": "210311",
            "spell": "qsq",
            "city": "千山区"
        },
        {
            "parentId": "210300",
            "cityId": "210321",
            "spell": "tax",
            "city": "台安县"
        },
        {
            "parentId": "210300",
            "cityId": "210323",
            "spell": "xymzzzx",
            "city": "岫岩满族自治县"
        },
        {
            "parentId": "210300",
            "cityId": "210381",
            "spell": "hcs",
            "city": "海城市"
        },
        {
            "parentId": "210000",
            "cityId": "210400",
            "spell": "fss",
            "city": "抚顺市"
        },
        {
            "parentId": "210400",
            "cityId": "210401",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "210400",
            "cityId": "210402",
            "spell": "xfq",
            "city": "新抚区"
        },
        {
            "parentId": "210400",
            "cityId": "210403",
            "spell": "dzq",
            "city": "东洲区"
        },
        {
            "parentId": "210400",
            "cityId": "210404",
            "spell": "whq",
            "city": "望花区"
        },
        {
            "parentId": "210400",
            "cityId": "210411",
            "spell": "scq",
            "city": "顺城区"
        },
        {
            "parentId": "210400",
            "cityId": "210421",
            "spell": "fsx",
            "city": "抚顺县"
        },
        {
            "parentId": "210400",
            "cityId": "210422",
            "spell": "xbmzzzx",
            "city": "新宾满族自治县"
        },
        {
            "parentId": "210400",
            "cityId": "210423",
            "spell": "qymzzzx",
            "city": "清原满族自治县"
        },
        {
            "parentId": "210000",
            "cityId": "210500",
            "spell": "bxs",
            "city": "本溪市"
        },
        {
            "parentId": "210500",
            "cityId": "210501",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "210500",
            "cityId": "210502",
            "spell": "psq",
            "city": "平山区"
        },
        {
            "parentId": "210500",
            "cityId": "210503",
            "spell": "xhq",
            "city": "溪湖区"
        },
        {
            "parentId": "210500",
            "cityId": "210504",
            "spell": "msq",
            "city": "明山区"
        },
        {
            "parentId": "210500",
            "cityId": "210505",
            "spell": "nfq",
            "city": "南芬区"
        },
        {
            "parentId": "210500",
            "cityId": "210521",
            "spell": "bxmzzzx",
            "city": "本溪满族自治县"
        },
        {
            "parentId": "210500",
            "cityId": "210522",
            "spell": "hrmzzzx",
            "city": "桓仁满族自治县"
        },
        {
            "parentId": "210000",
            "cityId": "210600",
            "spell": "dds",
            "city": "丹东市"
        },
        {
            "parentId": "210600",
            "cityId": "210601",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "210600",
            "cityId": "210602",
            "spell": "ybq",
            "city": "元宝区"
        },
        {
            "parentId": "210600",
            "cityId": "210603",
            "spell": "zxq",
            "city": "振兴区"
        },
        {
            "parentId": "210600",
            "cityId": "210604",
            "spell": "zaq",
            "city": "振安区"
        },
        {
            "parentId": "210600",
            "cityId": "210624",
            "spell": "kdmzzzx",
            "city": "宽甸满族自治县"
        },
        {
            "parentId": "210600",
            "cityId": "210681",
            "spell": "dgs",
            "city": "东港市"
        },
        {
            "parentId": "210600",
            "cityId": "210682",
            "spell": "fcs",
            "city": "凤城市"
        },
        {
            "parentId": "210000",
            "cityId": "210700",
            "spell": "jzs",
            "city": "锦州市"
        },
        {
            "parentId": "210700",
            "cityId": "210701",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "210700",
            "cityId": "210702",
            "spell": "gtq",
            "city": "古塔区"
        },
        {
            "parentId": "210700",
            "cityId": "210703",
            "spell": "lhq",
            "city": "凌河区"
        },
        {
            "parentId": "210700",
            "cityId": "210711",
            "spell": "thq",
            "city": "太和区"
        },
        {
            "parentId": "210700",
            "cityId": "210726",
            "spell": "hsx",
            "city": "黑山县"
        },
        {
            "parentId": "210700",
            "cityId": "210727",
            "spell": "yx",
            "city": "义县"
        },
        {
            "parentId": "210700",
            "cityId": "210781",
            "spell": "lhs",
            "city": "凌海市"
        },
        {
            "parentId": "210700",
            "cityId": "210782",
            "spell": "bzs",
            "city": "北镇市"
        },
        {
            "parentId": "210000",
            "cityId": "210800",
            "spell": "yks",
            "city": "营口市"
        },
        {
            "parentId": "210800",
            "cityId": "210801",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "210800",
            "cityId": "210802",
            "spell": "zqq",
            "city": "站前区"
        },
        {
            "parentId": "210800",
            "cityId": "210803",
            "spell": "xsq",
            "city": "西市区"
        },
        {
            "parentId": "210800",
            "cityId": "210804",
            "spell": "byqq",
            "city": "鲅鱼圈区"
        },
        {
            "parentId": "210800",
            "cityId": "210811",
            "spell": "lbq",
            "city": "老边区"
        },
        {
            "parentId": "210800",
            "cityId": "210881",
            "spell": "gzs",
            "city": "盖州市"
        },
        {
            "parentId": "210800",
            "cityId": "210882",
            "spell": "dsqs",
            "city": "大石桥市"
        },
        {
            "parentId": "210000",
            "cityId": "210900",
            "spell": "fxs",
            "city": "阜新市"
        },
        {
            "parentId": "210900",
            "cityId": "210901",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "210900",
            "cityId": "210902",
            "spell": "hzq",
            "city": "海州区"
        },
        {
            "parentId": "210900",
            "cityId": "210903",
            "spell": "xqq",
            "city": "新邱区"
        },
        {
            "parentId": "210900",
            "cityId": "210904",
            "spell": "tpq",
            "city": "太平区"
        },
        {
            "parentId": "210900",
            "cityId": "210905",
            "spell": "qhmq",
            "city": "清河门区"
        },
        {
            "parentId": "210900",
            "cityId": "210911",
            "spell": "xhq",
            "city": "细河区"
        },
        {
            "parentId": "210900",
            "cityId": "210921",
            "spell": "fxmgzzzx",
            "city": "阜新蒙古族自治县"
        },
        {
            "parentId": "210900",
            "cityId": "210922",
            "spell": "zwx",
            "city": "彰武县"
        },
        {
            "parentId": "210000",
            "cityId": "211000",
            "spell": "lys",
            "city": "辽阳市"
        },
        {
            "parentId": "211000",
            "cityId": "211001",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "211000",
            "cityId": "211002",
            "spell": "btq",
            "city": "白塔区"
        },
        {
            "parentId": "211000",
            "cityId": "211003",
            "spell": "wsq",
            "city": "文圣区"
        },
        {
            "parentId": "211000",
            "cityId": "211004",
            "spell": "hwq",
            "city": "宏伟区"
        },
        {
            "parentId": "211000",
            "cityId": "211005",
            "spell": "gclq",
            "city": "弓长岭区"
        },
        {
            "parentId": "211000",
            "cityId": "211011",
            "spell": "tzhq",
            "city": "太子河区"
        },
        {
            "parentId": "211000",
            "cityId": "211021",
            "spell": "lyx",
            "city": "辽阳县"
        },
        {
            "parentId": "211000",
            "cityId": "211081",
            "spell": "dts",
            "city": "灯塔市"
        },
        {
            "parentId": "210000",
            "cityId": "211100",
            "spell": "pjs",
            "city": "盘锦市"
        },
        {
            "parentId": "211100",
            "cityId": "211101",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "211100",
            "cityId": "211102",
            "spell": "stzq",
            "city": "双台子区"
        },
        {
            "parentId": "211100",
            "cityId": "211103",
            "spell": "xltq",
            "city": "兴隆台区"
        },
        {
            "parentId": "211100",
            "cityId": "211121",
            "spell": "dwx",
            "city": "大洼县"
        },
        {
            "parentId": "211100",
            "cityId": "211122",
            "spell": "psx",
            "city": "盘山县"
        },
        {
            "parentId": "210000",
            "cityId": "211200",
            "spell": "tls",
            "city": "铁岭市"
        },
        {
            "parentId": "211200",
            "cityId": "211201",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "211200",
            "cityId": "211202",
            "spell": "yzq",
            "city": "银州区"
        },
        {
            "parentId": "211200",
            "cityId": "211204",
            "spell": "qhq",
            "city": "清河区"
        },
        {
            "parentId": "211200",
            "cityId": "211221",
            "spell": "tlx",
            "city": "铁岭县"
        },
        {
            "parentId": "211200",
            "cityId": "211223",
            "spell": "xfx",
            "city": "西丰县"
        },
        {
            "parentId": "211200",
            "cityId": "211224",
            "spell": "ctx",
            "city": "昌图县"
        },
        {
            "parentId": "211200",
            "cityId": "211281",
            "spell": "tbss",
            "city": "调兵山市"
        },
        {
            "parentId": "211200",
            "cityId": "211282",
            "spell": "kys",
            "city": "开原市"
        },
        {
            "parentId": "210000",
            "cityId": "211300",
            "spell": "cys",
            "city": "朝阳市"
        },
        {
            "parentId": "211300",
            "cityId": "211301",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "211300",
            "cityId": "211302",
            "spell": "stq",
            "city": "双塔区"
        },
        {
            "parentId": "211300",
            "cityId": "211303",
            "spell": "lcq",
            "city": "龙城区"
        },
        {
            "parentId": "211300",
            "cityId": "211321",
            "spell": "cyx",
            "city": "朝阳县"
        },
        {
            "parentId": "211300",
            "cityId": "211322",
            "spell": "jpx",
            "city": "建平县"
        },
        {
            "parentId": "211300",
            "cityId": "211324",
            "spell": "klqzymgzzzx",
            "city": "喀喇沁左翼蒙古族自治县"
        },
        {
            "parentId": "211300",
            "cityId": "211381",
            "spell": "bps",
            "city": "北票市"
        },
        {
            "parentId": "211300",
            "cityId": "211382",
            "spell": "lys",
            "city": "凌源市"
        },
        {
            "parentId": "210000",
            "cityId": "211400",
            "spell": "hlds",
            "city": "葫芦岛市"
        },
        {
            "parentId": "211400",
            "cityId": "211401",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "211400",
            "cityId": "211402",
            "spell": "lsq",
            "city": "连山区"
        },
        {
            "parentId": "211400",
            "cityId": "211403",
            "spell": "lgq",
            "city": "龙港区"
        },
        {
            "parentId": "211400",
            "cityId": "211404",
            "spell": "npq",
            "city": "南票区"
        },
        {
            "parentId": "211400",
            "cityId": "211421",
            "spell": "szx",
            "city": "绥中县"
        },
        {
            "parentId": "211400",
            "cityId": "211422",
            "spell": "jcx",
            "city": "建昌县"
        },
        {
            "parentId": "211400",
            "cityId": "211481",
            "spell": "xcs",
            "city": "兴城市"
        },
        {
            "parentId": "0",
            "cityId": "220000",
            "spell": "jls",
            "city": "吉林省"
        },
        {
            "parentId": "220000",
            "cityId": "220100",
            "spell": "ccs",
            "city": "长春市"
        },
        {
            "parentId": "220100",
            "cityId": "220101",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "220100",
            "cityId": "220102",
            "spell": "ngq",
            "city": "南关区"
        },
        {
            "parentId": "220100",
            "cityId": "220103",
            "spell": "kcq",
            "city": "宽城区"
        },
        {
            "parentId": "220100",
            "cityId": "220104",
            "spell": "cy q",
            "city": "朝阳 区"
        },
        {
            "parentId": "220100",
            "cityId": "220105",
            "spell": "edq",
            "city": "二道区"
        },
        {
            "parentId": "220100",
            "cityId": "220106",
            "spell": "lyq",
            "city": "绿园区"
        },
        {
            "parentId": "220100",
            "cityId": "220112",
            "spell": "syq",
            "city": "双阳区"
        },
        {
            "parentId": "220100",
            "cityId": "220122",
            "spell": "nax",
            "city": "农安县"
        },
        {
            "parentId": "220100",
            "cityId": "220181",
            "spell": "jts",
            "city": "九台市"
        },
        {
            "parentId": "220100",
            "cityId": "220182",
            "spell": "yss",
            "city": "榆树市"
        },
        {
            "parentId": "220100",
            "cityId": "220183",
            "spell": "dhs",
            "city": "德惠市"
        },
        {
            "parentId": "220000",
            "cityId": "220200",
            "spell": "jls",
            "city": "吉林市"
        },
        {
            "parentId": "220200",
            "cityId": "220201",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "220200",
            "cityId": "220202",
            "spell": "cyq",
            "city": "昌邑区"
        },
        {
            "parentId": "220200",
            "cityId": "220203",
            "spell": "ltq",
            "city": "龙潭区"
        },
        {
            "parentId": "220200",
            "cityId": "220204",
            "spell": "cyq",
            "city": "船营区"
        },
        {
            "parentId": "220200",
            "cityId": "220211",
            "spell": "fmq",
            "city": "丰满区"
        },
        {
            "parentId": "220200",
            "cityId": "220221",
            "spell": "yjx",
            "city": "永吉县"
        },
        {
            "parentId": "220200",
            "cityId": "220281",
            "spell": "jhs",
            "city": "蛟河市"
        },
        {
            "parentId": "220200",
            "cityId": "220282",
            "spell": "hds",
            "city": "桦甸市"
        },
        {
            "parentId": "220200",
            "cityId": "220283",
            "spell": "sls",
            "city": "舒兰市"
        },
        {
            "parentId": "220200",
            "cityId": "220284",
            "spell": "pss",
            "city": "磐石市"
        },
        {
            "parentId": "220000",
            "cityId": "220300",
            "spell": "sps",
            "city": "四平市"
        },
        {
            "parentId": "220300",
            "cityId": "220301",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "220300",
            "cityId": "220302",
            "spell": "txq",
            "city": "铁西区"
        },
        {
            "parentId": "220300",
            "cityId": "220303",
            "spell": "tdq",
            "city": "铁东区"
        },
        {
            "parentId": "220300",
            "cityId": "220322",
            "spell": "lsx",
            "city": "梨树县"
        },
        {
            "parentId": "220300",
            "cityId": "220323",
            "spell": "ytmzzzx",
            "city": "伊通满族自治县"
        },
        {
            "parentId": "220300",
            "cityId": "220381",
            "spell": "gzls",
            "city": "公主岭市"
        },
        {
            "parentId": "220300",
            "cityId": "220382",
            "spell": "sls",
            "city": "双辽市"
        },
        {
            "parentId": "220000",
            "cityId": "220400",
            "spell": "lys",
            "city": "辽源市"
        },
        {
            "parentId": "220400",
            "cityId": "220401",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "220400",
            "cityId": "220402",
            "spell": "lsq",
            "city": "龙山区"
        },
        {
            "parentId": "220400",
            "cityId": "220403",
            "spell": "xaq",
            "city": "西安区"
        },
        {
            "parentId": "220400",
            "cityId": "220421",
            "spell": "dfx",
            "city": "东丰县"
        },
        {
            "parentId": "220400",
            "cityId": "220422",
            "spell": "dlx",
            "city": "东辽县"
        },
        {
            "parentId": "220000",
            "cityId": "220500",
            "spell": "ths",
            "city": "通化市"
        },
        {
            "parentId": "220500",
            "cityId": "220501",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "220500",
            "cityId": "220502",
            "spell": "dcq",
            "city": "东昌区"
        },
        {
            "parentId": "220500",
            "cityId": "220503",
            "spell": "edjq",
            "city": "二道江区"
        },
        {
            "parentId": "220500",
            "cityId": "220521",
            "spell": "thx",
            "city": "通化县"
        },
        {
            "parentId": "220500",
            "cityId": "220523",
            "spell": "hnx",
            "city": "辉南县"
        },
        {
            "parentId": "220500",
            "cityId": "220524",
            "spell": "lhx",
            "city": "柳河县"
        },
        {
            "parentId": "220500",
            "cityId": "220581",
            "spell": "mhks",
            "city": "梅河口市"
        },
        {
            "parentId": "220500",
            "cityId": "220582",
            "spell": "jas",
            "city": "集安市"
        },
        {
            "parentId": "220000",
            "cityId": "220600",
            "spell": "bss",
            "city": "白山市"
        },
        {
            "parentId": "220600",
            "cityId": "220601",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "220600",
            "cityId": "220602",
            "spell": "hjq",
            "city": "浑江区"
        },
        {
            "parentId": "220600",
            "cityId": "220605",
            "spell": "jyq",
            "city": "江源区"
        },
        {
            "parentId": "220600",
            "cityId": "220621",
            "spell": "fsx",
            "city": "抚松县"
        },
        {
            "parentId": "220600",
            "cityId": "220622",
            "spell": "jyx",
            "city": "靖宇县"
        },
        {
            "parentId": "220600",
            "cityId": "220623",
            "spell": "cbcxzzzx",
            "city": "长白朝鲜族自治县"
        },
        {
            "parentId": "220600",
            "cityId": "220681",
            "spell": "ljs",
            "city": "临江市"
        },
        {
            "parentId": "220000",
            "cityId": "220700",
            "spell": "sys",
            "city": "松原市"
        },
        {
            "parentId": "220700",
            "cityId": "220701",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "220700",
            "cityId": "220702",
            "spell": "njq",
            "city": "宁江区"
        },
        {
            "parentId": "220700",
            "cityId": "220721",
            "spell": "qgelsmgzzzx",
            "city": "前郭尔罗斯蒙古族自治县"
        },
        {
            "parentId": "220700",
            "cityId": "220722",
            "spell": "clx",
            "city": "长岭县"
        },
        {
            "parentId": "220700",
            "cityId": "220723",
            "spell": "gax",
            "city": "乾安县"
        },
        {
            "parentId": "220700",
            "cityId": "220781",
            "spell": "fys",
            "city": "扶余市"
        },
        {
            "parentId": "220000",
            "cityId": "220800",
            "spell": "bcs",
            "city": "白城市"
        },
        {
            "parentId": "220800",
            "cityId": "220801",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "220800",
            "cityId": "220802",
            "spell": "tbq",
            "city": "洮北区"
        },
        {
            "parentId": "220800",
            "cityId": "220821",
            "spell": "zlx",
            "city": "镇赉县"
        },
        {
            "parentId": "220800",
            "cityId": "220822",
            "spell": "tyx",
            "city": "通榆县"
        },
        {
            "parentId": "220800",
            "cityId": "220881",
            "spell": "tns",
            "city": "洮南市"
        },
        {
            "parentId": "220800",
            "cityId": "220882",
            "spell": "das",
            "city": "大安市"
        },
        {
            "parentId": "220000",
            "cityId": "222400",
            "spell": "ybcxzzzz",
            "city": "延边朝鲜族自治州"
        },
        {
            "parentId": "222400",
            "cityId": "222401",
            "spell": "yjs",
            "city": "延吉市"
        },
        {
            "parentId": "222400",
            "cityId": "222402",
            "spell": "tms",
            "city": "图们市"
        },
        {
            "parentId": "222400",
            "cityId": "222403",
            "spell": "dhs",
            "city": "敦化市"
        },
        {
            "parentId": "222400",
            "cityId": "222404",
            "spell": "hcs",
            "city": "珲春市"
        },
        {
            "parentId": "222400",
            "cityId": "222405",
            "spell": "ljs",
            "city": "龙井市"
        },
        {
            "parentId": "222400",
            "cityId": "222406",
            "spell": "hls",
            "city": "和龙市"
        },
        {
            "parentId": "222400",
            "cityId": "222424",
            "spell": "wqx",
            "city": "汪清县"
        },
        {
            "parentId": "222400",
            "cityId": "222426",
            "spell": "atx",
            "city": "安图县"
        },
        {
            "parentId": "0",
            "cityId": "230000",
            "spell": "hljs",
            "city": "黑龙江省"
        },
        {
            "parentId": "230000",
            "cityId": "230100",
            "spell": "hebs",
            "city": "哈尔滨市"
        },
        {
            "parentId": "230100",
            "cityId": "230101",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "230100",
            "cityId": "230102",
            "spell": "dlq",
            "city": "道里区"
        },
        {
            "parentId": "230100",
            "cityId": "230103",
            "spell": "ngq",
            "city": "南岗区"
        },
        {
            "parentId": "230100",
            "cityId": "230104",
            "spell": "dwq",
            "city": "道外区"
        },
        {
            "parentId": "230100",
            "cityId": "230108",
            "spell": "pfq",
            "city": "平房区"
        },
        {
            "parentId": "230100",
            "cityId": "230109",
            "spell": "sbq",
            "city": "松北区"
        },
        {
            "parentId": "230100",
            "cityId": "230110",
            "spell": "xfq",
            "city": "香坊区"
        },
        {
            "parentId": "230100",
            "cityId": "230111",
            "spell": "hlq",
            "city": "呼兰区"
        },
        {
            "parentId": "230100",
            "cityId": "230112",
            "spell": "acq",
            "city": "阿城区"
        },
        {
            "parentId": "230100",
            "cityId": "230123",
            "spell": "ylx",
            "city": "依兰县"
        },
        {
            "parentId": "230100",
            "cityId": "230124",
            "spell": "fzx",
            "city": "方正县"
        },
        {
            "parentId": "230100",
            "cityId": "230125",
            "spell": "bx",
            "city": "宾县"
        },
        {
            "parentId": "230100",
            "cityId": "230126",
            "spell": "byx",
            "city": "巴彦县"
        },
        {
            "parentId": "230100",
            "cityId": "230127",
            "spell": "mlx",
            "city": "木兰县"
        },
        {
            "parentId": "230100",
            "cityId": "230128",
            "spell": "thx",
            "city": "通河县"
        },
        {
            "parentId": "230100",
            "cityId": "230129",
            "spell": "ysx",
            "city": "延寿县"
        },
        {
            "parentId": "230100",
            "cityId": "230182",
            "spell": "scs",
            "city": "双城市"
        },
        {
            "parentId": "230100",
            "cityId": "230183",
            "spell": "szs",
            "city": "尚志市"
        },
        {
            "parentId": "230100",
            "cityId": "230184",
            "spell": "wcs",
            "city": "五常市"
        },
        {
            "parentId": "230000",
            "cityId": "230200",
            "spell": "qqhes",
            "city": "齐齐哈尔市"
        },
        {
            "parentId": "230200",
            "cityId": "230201",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "230200",
            "cityId": "230202",
            "spell": "lsq",
            "city": "龙沙区"
        },
        {
            "parentId": "230200",
            "cityId": "230203",
            "spell": "jhq",
            "city": "建华区"
        },
        {
            "parentId": "230200",
            "cityId": "230204",
            "spell": "tfq",
            "city": "铁锋区"
        },
        {
            "parentId": "230200",
            "cityId": "230205",
            "spell": "aaxq",
            "city": "昂昂溪区"
        },
        {
            "parentId": "230200",
            "cityId": "230206",
            "spell": "flejq",
            "city": "富拉尔基区"
        },
        {
            "parentId": "230200",
            "cityId": "230207",
            "spell": "nzsq",
            "city": "碾子山区"
        },
        {
            "parentId": "230200",
            "cityId": "230208",
            "spell": "mlsdwezq",
            "city": "梅里斯达斡尔族区"
        },
        {
            "parentId": "230200",
            "cityId": "230221",
            "spell": "ljx",
            "city": "龙江县"
        },
        {
            "parentId": "230200",
            "cityId": "230223",
            "spell": "yax",
            "city": "依安县"
        },
        {
            "parentId": "230200",
            "cityId": "230224",
            "spell": "tlx",
            "city": "泰来县"
        },
        {
            "parentId": "230200",
            "cityId": "230225",
            "spell": "gnx",
            "city": "甘南县"
        },
        {
            "parentId": "230200",
            "cityId": "230227",
            "spell": "fyx",
            "city": "富裕县"
        },
        {
            "parentId": "230200",
            "cityId": "230229",
            "spell": "ksx",
            "city": "克山县"
        },
        {
            "parentId": "230200",
            "cityId": "230230",
            "spell": "kdx",
            "city": "克东县"
        },
        {
            "parentId": "230200",
            "cityId": "230231",
            "spell": "bqx",
            "city": "拜泉县"
        },
        {
            "parentId": "230200",
            "cityId": "230281",
            "spell": "nhs",
            "city": "讷河市"
        },
        {
            "parentId": "230000",
            "cityId": "230300",
            "spell": "jxs",
            "city": "鸡西市"
        },
        {
            "parentId": "230300",
            "cityId": "230301",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "230300",
            "cityId": "230302",
            "spell": "jgq",
            "city": "鸡冠区"
        },
        {
            "parentId": "230300",
            "cityId": "230303",
            "spell": "hsq",
            "city": "恒山区"
        },
        {
            "parentId": "230300",
            "cityId": "230304",
            "spell": "ddq",
            "city": "滴道区"
        },
        {
            "parentId": "230300",
            "cityId": "230305",
            "spell": "lsq",
            "city": "梨树区"
        },
        {
            "parentId": "230300",
            "cityId": "230306",
            "spell": "czhq",
            "city": "城子河区"
        },
        {
            "parentId": "230300",
            "cityId": "230307",
            "spell": "msq",
            "city": "麻山区"
        },
        {
            "parentId": "230300",
            "cityId": "230321",
            "spell": "jdx",
            "city": "鸡东县"
        },
        {
            "parentId": "230300",
            "cityId": "230381",
            "spell": "hls",
            "city": "虎林市"
        },
        {
            "parentId": "230300",
            "cityId": "230382",
            "spell": "mss",
            "city": "密山市"
        },
        {
            "parentId": "230000",
            "cityId": "230400",
            "spell": "hgs",
            "city": "鹤岗市"
        },
        {
            "parentId": "230400",
            "cityId": "230401",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "230400",
            "cityId": "230402",
            "spell": "xyq",
            "city": "向阳区"
        },
        {
            "parentId": "230400",
            "cityId": "230403",
            "spell": "gnq",
            "city": "工农区"
        },
        {
            "parentId": "230400",
            "cityId": "230404",
            "spell": "nsq",
            "city": "南山区"
        },
        {
            "parentId": "230400",
            "cityId": "230405",
            "spell": "xaq",
            "city": "兴安区"
        },
        {
            "parentId": "230400",
            "cityId": "230406",
            "spell": "dsq",
            "city": "东山区"
        },
        {
            "parentId": "230400",
            "cityId": "230407",
            "spell": "xsq",
            "city": "兴山区"
        },
        {
            "parentId": "230400",
            "cityId": "230421",
            "spell": "lbx",
            "city": "萝北县"
        },
        {
            "parentId": "230400",
            "cityId": "230422",
            "spell": "sbx",
            "city": "绥滨县"
        },
        {
            "parentId": "230000",
            "cityId": "230500",
            "spell": "syss",
            "city": "双鸭山市"
        },
        {
            "parentId": "230500",
            "cityId": "230501",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "230500",
            "cityId": "230502",
            "spell": "jsq",
            "city": "尖山区"
        },
        {
            "parentId": "230500",
            "cityId": "230503",
            "spell": "ldq",
            "city": "岭东区"
        },
        {
            "parentId": "230500",
            "cityId": "230505",
            "spell": "sftq",
            "city": "四方台区"
        },
        {
            "parentId": "230500",
            "cityId": "230506",
            "spell": "bsq",
            "city": "宝山区"
        },
        {
            "parentId": "230500",
            "cityId": "230521",
            "spell": "jxx",
            "city": "集贤县"
        },
        {
            "parentId": "230500",
            "cityId": "230522",
            "spell": "yyx",
            "city": "友谊县"
        },
        {
            "parentId": "230500",
            "cityId": "230523",
            "spell": "bqx",
            "city": "宝清县"
        },
        {
            "parentId": "230500",
            "cityId": "230524",
            "spell": "rhx",
            "city": "饶河县"
        },
        {
            "parentId": "230000",
            "cityId": "230600",
            "spell": "dqs",
            "city": "大庆市"
        },
        {
            "parentId": "230600",
            "cityId": "230601",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "230600",
            "cityId": "230602",
            "spell": "setq",
            "city": "萨尔图区"
        },
        {
            "parentId": "230600",
            "cityId": "230603",
            "spell": "lfq",
            "city": "龙凤区"
        },
        {
            "parentId": "230600",
            "cityId": "230604",
            "spell": "rhlq",
            "city": "让胡路区"
        },
        {
            "parentId": "230600",
            "cityId": "230605",
            "spell": "hgq",
            "city": "红岗区"
        },
        {
            "parentId": "230600",
            "cityId": "230606",
            "spell": "dtq",
            "city": "大同区"
        },
        {
            "parentId": "230600",
            "cityId": "230621",
            "spell": "zzx",
            "city": "肇州县"
        },
        {
            "parentId": "230600",
            "cityId": "230622",
            "spell": "zyx",
            "city": "肇源县"
        },
        {
            "parentId": "230600",
            "cityId": "230623",
            "spell": "ldx",
            "city": "林甸县"
        },
        {
            "parentId": "230600",
            "cityId": "230624",
            "spell": "debtmgzzzx",
            "city": "杜尔伯特蒙古族自治县"
        },
        {
            "parentId": "230000",
            "cityId": "230700",
            "spell": "ycs",
            "city": "伊春市"
        },
        {
            "parentId": "230700",
            "cityId": "230701",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "230700",
            "cityId": "230702",
            "spell": "ycq",
            "city": "伊春区"
        },
        {
            "parentId": "230700",
            "cityId": "230703",
            "spell": "ncq",
            "city": "南岔区"
        },
        {
            "parentId": "230700",
            "cityId": "230704",
            "spell": "yhq",
            "city": "友好区"
        },
        {
            "parentId": "230700",
            "cityId": "230705",
            "spell": "xlq",
            "city": "西林区"
        },
        {
            "parentId": "230700",
            "cityId": "230706",
            "spell": "clq",
            "city": "翠峦区"
        },
        {
            "parentId": "230700",
            "cityId": "230707",
            "spell": "xqq",
            "city": "新青区"
        },
        {
            "parentId": "230700",
            "cityId": "230708",
            "spell": "mxq",
            "city": "美溪区"
        },
        {
            "parentId": "230700",
            "cityId": "230709",
            "spell": "jstq",
            "city": "金山屯区"
        },
        {
            "parentId": "230700",
            "cityId": "230710",
            "spell": "wyq",
            "city": "五营区"
        },
        {
            "parentId": "230700",
            "cityId": "230711",
            "spell": "wmhq",
            "city": "乌马河区"
        },
        {
            "parentId": "230700",
            "cityId": "230712",
            "spell": "twhq",
            "city": "汤旺河区"
        },
        {
            "parentId": "230700",
            "cityId": "230713",
            "spell": "dlq",
            "city": "带岭区"
        },
        {
            "parentId": "230700",
            "cityId": "230714",
            "spell": "wylq",
            "city": "乌伊岭区"
        },
        {
            "parentId": "230700",
            "cityId": "230715",
            "spell": "hxq",
            "city": "红星区"
        },
        {
            "parentId": "230700",
            "cityId": "230716",
            "spell": "sglq",
            "city": "上甘岭区"
        },
        {
            "parentId": "230700",
            "cityId": "230722",
            "spell": "jyx",
            "city": "嘉荫县"
        },
        {
            "parentId": "230700",
            "cityId": "230781",
            "spell": "tls",
            "city": "铁力市"
        },
        {
            "parentId": "230000",
            "cityId": "230800",
            "spell": "jmss",
            "city": "佳木斯市"
        },
        {
            "parentId": "230800",
            "cityId": "230801",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "230800",
            "cityId": "230803",
            "spell": "xyq",
            "city": "向阳区"
        },
        {
            "parentId": "230800",
            "cityId": "230804",
            "spell": "qjq",
            "city": "前进区"
        },
        {
            "parentId": "230800",
            "cityId": "230805",
            "spell": "dfq",
            "city": "东风区"
        },
        {
            "parentId": "230800",
            "cityId": "230811",
            "spell": "jq",
            "city": "郊区"
        },
        {
            "parentId": "230800",
            "cityId": "230822",
            "spell": "hnx",
            "city": "桦南县"
        },
        {
            "parentId": "230800",
            "cityId": "230826",
            "spell": "hcx",
            "city": "桦川县"
        },
        {
            "parentId": "230800",
            "cityId": "230828",
            "spell": "tyx",
            "city": "汤原县"
        },
        {
            "parentId": "230800",
            "cityId": "230833",
            "spell": "fyx",
            "city": "抚远县"
        },
        {
            "parentId": "230800",
            "cityId": "230881",
            "spell": "tjs",
            "city": "同江市"
        },
        {
            "parentId": "230800",
            "cityId": "230882",
            "spell": "fjs",
            "city": "富锦市"
        },
        {
            "parentId": "230000",
            "cityId": "230900",
            "spell": "qths",
            "city": "七台河市"
        },
        {
            "parentId": "230900",
            "cityId": "230901",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "230900",
            "cityId": "230902",
            "spell": "xxq",
            "city": "新兴区"
        },
        {
            "parentId": "230900",
            "cityId": "230903",
            "spell": "tsq",
            "city": "桃山区"
        },
        {
            "parentId": "230900",
            "cityId": "230904",
            "spell": "qzhq",
            "city": "茄子河区"
        },
        {
            "parentId": "230900",
            "cityId": "230921",
            "spell": "blx",
            "city": "勃利县"
        },
        {
            "parentId": "230000",
            "cityId": "231000",
            "spell": "mdjs",
            "city": "牡丹江市"
        },
        {
            "parentId": "231000",
            "cityId": "231001",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "231000",
            "cityId": "231002",
            "spell": "daq",
            "city": "东安区"
        },
        {
            "parentId": "231000",
            "cityId": "231003",
            "spell": "ymq",
            "city": "阳明区"
        },
        {
            "parentId": "231000",
            "cityId": "231004",
            "spell": "amq",
            "city": "爱民区"
        },
        {
            "parentId": "231000",
            "cityId": "231005",
            "spell": "xaq",
            "city": "西安区"
        },
        {
            "parentId": "231000",
            "cityId": "231024",
            "spell": "dnx",
            "city": "东宁县"
        },
        {
            "parentId": "231000",
            "cityId": "231025",
            "spell": "lkx",
            "city": "林口县"
        },
        {
            "parentId": "231000",
            "cityId": "231081",
            "spell": "sfhs",
            "city": "绥芬河市"
        },
        {
            "parentId": "231000",
            "cityId": "231083",
            "spell": "hls",
            "city": "海林市"
        },
        {
            "parentId": "231000",
            "cityId": "231084",
            "spell": "nas",
            "city": "宁安市"
        },
        {
            "parentId": "231000",
            "cityId": "231085",
            "spell": "mls",
            "city": "穆棱市"
        },
        {
            "parentId": "230000",
            "cityId": "231100",
            "spell": "hhs",
            "city": "黑河市"
        },
        {
            "parentId": "231100",
            "cityId": "231101",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "231100",
            "cityId": "231102",
            "spell": "ahq",
            "city": "爱辉区"
        },
        {
            "parentId": "231100",
            "cityId": "231121",
            "spell": "njx",
            "city": "嫩江县"
        },
        {
            "parentId": "231100",
            "cityId": "231123",
            "spell": "xkx",
            "city": "逊克县"
        },
        {
            "parentId": "231100",
            "cityId": "231124",
            "spell": "swx",
            "city": "孙吴县"
        },
        {
            "parentId": "231100",
            "cityId": "231181",
            "spell": "bas",
            "city": "北安市"
        },
        {
            "parentId": "231100",
            "cityId": "231182",
            "spell": "wdlcs",
            "city": "五大连池市"
        },
        {
            "parentId": "230000",
            "cityId": "231200",
            "spell": "shs",
            "city": "绥化市"
        },
        {
            "parentId": "231200",
            "cityId": "231201",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "231200",
            "cityId": "231202",
            "spell": "blq",
            "city": "北林区"
        },
        {
            "parentId": "231200",
            "cityId": "231221",
            "spell": "wkx",
            "city": "望奎县"
        },
        {
            "parentId": "231200",
            "cityId": "231222",
            "spell": "lxx",
            "city": "兰西县"
        },
        {
            "parentId": "231200",
            "cityId": "231223",
            "spell": "qgx",
            "city": "青冈县"
        },
        {
            "parentId": "231200",
            "cityId": "231224",
            "spell": "qax",
            "city": "庆安县"
        },
        {
            "parentId": "231200",
            "cityId": "231225",
            "spell": "msx",
            "city": "明水县"
        },
        {
            "parentId": "231200",
            "cityId": "231226",
            "spell": "slx",
            "city": "绥棱县"
        },
        {
            "parentId": "231200",
            "cityId": "231281",
            "spell": "ads",
            "city": "安达市"
        },
        {
            "parentId": "231200",
            "cityId": "231282",
            "spell": "zds",
            "city": "肇东市"
        },
        {
            "parentId": "231200",
            "cityId": "231283",
            "spell": "hls",
            "city": "海伦市"
        },
        {
            "parentId": "230000",
            "cityId": "232700",
            "spell": "dxaldq",
            "city": "大兴安岭地区"
        },
        {
            "parentId": "232700",
            "cityId": "232721",
            "spell": "hmx",
            "city": "呼玛县"
        },
        {
            "parentId": "232700",
            "cityId": "232722",
            "spell": "thx",
            "city": "塔河县"
        },
        {
            "parentId": "232700",
            "cityId": "232723",
            "spell": "mhx",
            "city": "漠河县"
        },
        {
            "parentId": "0",
            "cityId": "310000",
            "spell": "shs",
            "city": "上海市"
        },
        {
            "parentId": "310000",
            "cityId": "310100",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "310100",
            "cityId": "310101",
            "spell": "hpq",
            "city": "黄浦区"
        },
        {
            "parentId": "310100",
            "cityId": "310104",
            "spell": "xhq",
            "city": "徐汇区"
        },
        {
            "parentId": "310100",
            "cityId": "310105",
            "spell": "cnq",
            "city": "长宁区"
        },
        {
            "parentId": "310100",
            "cityId": "310106",
            "spell": "jaq",
            "city": "静安区"
        },
        {
            "parentId": "310100",
            "cityId": "310107",
            "spell": "ptq",
            "city": "普陀区"
        },
        {
            "parentId": "310100",
            "cityId": "310108",
            "spell": "zbq",
            "city": "闸北区"
        },
        {
            "parentId": "310100",
            "cityId": "310109",
            "spell": "hkq",
            "city": "虹口区"
        },
        {
            "parentId": "310100",
            "cityId": "310110",
            "spell": "ypq",
            "city": "杨浦区"
        },
        {
            "parentId": "310100",
            "cityId": "310112",
            "spell": "mxq",
            "city": "闵行区"
        },
        {
            "parentId": "310100",
            "cityId": "310113",
            "spell": "bsq",
            "city": "宝山区"
        },
        {
            "parentId": "310100",
            "cityId": "310114",
            "spell": "jdq",
            "city": "嘉定区"
        },
        {
            "parentId": "310100",
            "cityId": "310115",
            "spell": "pdxq",
            "city": "浦东新区"
        },
        {
            "parentId": "310100",
            "cityId": "310116",
            "spell": "jsq",
            "city": "金山区"
        },
        {
            "parentId": "310100",
            "cityId": "310117",
            "spell": "sjq",
            "city": "松江区"
        },
        {
            "parentId": "310100",
            "cityId": "310118",
            "spell": "qpq",
            "city": "青浦区"
        },
        {
            "parentId": "310100",
            "cityId": "310120",
            "spell": "fxq",
            "city": "奉贤区"
        },
        {
            "parentId": "310000",
            "cityId": "310200",
            "spell": "x",
            "city": "县"
        },
        {
            "parentId": "310200",
            "cityId": "310230",
            "spell": "cmx",
            "city": "崇明县"
        },
        {
            "parentId": "0",
            "cityId": "320000",
            "spell": "jss",
            "city": "江苏省"
        },
        {
            "parentId": "320000",
            "cityId": "320100",
            "spell": "njs",
            "city": "南京市"
        },
        {
            "parentId": "320100",
            "cityId": "320101",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "320100",
            "cityId": "320102",
            "spell": "xwq",
            "city": "玄武区"
        },
        {
            "parentId": "320100",
            "cityId": "320104",
            "spell": "qhq",
            "city": "秦淮区"
        },
        {
            "parentId": "320100",
            "cityId": "320105",
            "spell": "jyq",
            "city": "建邺区"
        },
        {
            "parentId": "320100",
            "cityId": "320106",
            "spell": "glq",
            "city": "鼓楼区"
        },
        {
            "parentId": "320100",
            "cityId": "320111",
            "spell": "pkq",
            "city": "浦口区"
        },
        {
            "parentId": "320100",
            "cityId": "320113",
            "spell": "qxq",
            "city": "栖霞区"
        },
        {
            "parentId": "320100",
            "cityId": "320114",
            "spell": "yhtq",
            "city": "雨花台区"
        },
        {
            "parentId": "320100",
            "cityId": "320115",
            "spell": "jnq",
            "city": "江宁区"
        },
        {
            "parentId": "320100",
            "cityId": "320116",
            "spell": "lhq",
            "city": "六合区"
        },
        {
            "parentId": "320100",
            "cityId": "320117",
            "spell": "lsq",
            "city": "溧水区"
        },
        {
            "parentId": "320100",
            "cityId": "320118",
            "spell": "gcq",
            "city": "高淳区"
        },
        {
            "parentId": "320000",
            "cityId": "320200",
            "spell": "wxs",
            "city": "无锡市"
        },
        {
            "parentId": "320200",
            "cityId": "320201",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "320200",
            "cityId": "320202",
            "spell": "caq",
            "city": "崇安区"
        },
        {
            "parentId": "320200",
            "cityId": "320203",
            "spell": "ncq",
            "city": "南长区"
        },
        {
            "parentId": "320200",
            "cityId": "320204",
            "spell": "btq",
            "city": "北塘区"
        },
        {
            "parentId": "320200",
            "cityId": "320205",
            "spell": "xsq",
            "city": "锡山区"
        },
        {
            "parentId": "320200",
            "cityId": "320206",
            "spell": "hsq",
            "city": "惠山区"
        },
        {
            "parentId": "320200",
            "cityId": "320211",
            "spell": "bhq",
            "city": "滨湖区"
        },
        {
            "parentId": "320200",
            "cityId": "320281",
            "spell": "jys",
            "city": "江阴市"
        },
        {
            "parentId": "320200",
            "cityId": "320282",
            "spell": "yxs",
            "city": "宜兴市"
        },
        {
            "parentId": "320000",
            "cityId": "320300",
            "spell": "xzs",
            "city": "徐州市"
        },
        {
            "parentId": "320300",
            "cityId": "320301",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "320300",
            "cityId": "320302",
            "spell": "glq",
            "city": "鼓楼区"
        },
        {
            "parentId": "320300",
            "cityId": "320303",
            "spell": "ylq",
            "city": "云龙区"
        },
        {
            "parentId": "320300",
            "cityId": "320305",
            "spell": "jwq",
            "city": "贾汪区"
        },
        {
            "parentId": "320300",
            "cityId": "320311",
            "spell": "qsq",
            "city": "泉山区"
        },
        {
            "parentId": "320300",
            "cityId": "320312",
            "spell": "tsq",
            "city": "铜山区"
        },
        {
            "parentId": "320300",
            "cityId": "320321",
            "spell": "fx",
            "city": "丰县"
        },
        {
            "parentId": "320300",
            "cityId": "320322",
            "spell": "px",
            "city": "沛县"
        },
        {
            "parentId": "320300",
            "cityId": "320324",
            "spell": "hnx",
            "city": "睢宁县"
        },
        {
            "parentId": "320300",
            "cityId": "320381",
            "spell": "xys",
            "city": "新沂市"
        },
        {
            "parentId": "320300",
            "cityId": "320382",
            "spell": "pzs",
            "city": "邳州市"
        },
        {
            "parentId": "320000",
            "cityId": "320400",
            "spell": "czs",
            "city": "常州市"
        },
        {
            "parentId": "320400",
            "cityId": "320401",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "320400",
            "cityId": "320402",
            "spell": "tnq",
            "city": "天宁区"
        },
        {
            "parentId": "320400",
            "cityId": "320404",
            "spell": "zlq",
            "city": "钟楼区"
        },
        {
            "parentId": "320400",
            "cityId": "320405",
            "spell": "qsyq",
            "city": "戚墅堰区"
        },
        {
            "parentId": "320400",
            "cityId": "320411",
            "spell": "xbq",
            "city": "新北区"
        },
        {
            "parentId": "320400",
            "cityId": "320412",
            "spell": "wjq",
            "city": "武进区"
        },
        {
            "parentId": "320400",
            "cityId": "320481",
            "spell": "lys",
            "city": "溧阳市"
        },
        {
            "parentId": "320400",
            "cityId": "320482",
            "spell": "jts",
            "city": "金坛市"
        },
        {
            "parentId": "320000",
            "cityId": "320500",
            "spell": "szs",
            "city": "苏州市"
        },
        {
            "parentId": "320500",
            "cityId": "320501",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "320500",
            "cityId": "320505",
            "spell": "hqq",
            "city": "虎丘区"
        },
        {
            "parentId": "320500",
            "cityId": "320506",
            "spell": "wzq",
            "city": "吴中区"
        },
        {
            "parentId": "320500",
            "cityId": "320507",
            "spell": "xcq",
            "city": "相城区"
        },
        {
            "parentId": "320500",
            "cityId": "320508",
            "spell": "gsq",
            "city": "姑苏区"
        },
        {
            "parentId": "320500",
            "cityId": "320509",
            "spell": "wjq",
            "city": "吴江区"
        },
        {
            "parentId": "320500",
            "cityId": "320581",
            "spell": "css",
            "city": "常熟市"
        },
        {
            "parentId": "320500",
            "cityId": "320582",
            "spell": "zjgs",
            "city": "张家港市"
        },
        {
            "parentId": "320500",
            "cityId": "320583",
            "spell": "kss",
            "city": "昆山市"
        },
        {
            "parentId": "320500",
            "cityId": "320585",
            "spell": "tcs",
            "city": "太仓市"
        },
        {
            "parentId": "320000",
            "cityId": "320600",
            "spell": "nts",
            "city": "南通市"
        },
        {
            "parentId": "320600",
            "cityId": "320601",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "320600",
            "cityId": "320602",
            "spell": "ccq",
            "city": "崇川区"
        },
        {
            "parentId": "320600",
            "cityId": "320611",
            "spell": "gzq",
            "city": "港闸区"
        },
        {
            "parentId": "320600",
            "cityId": "320612",
            "spell": "tzq",
            "city": "通州区"
        },
        {
            "parentId": "320600",
            "cityId": "320621",
            "spell": "hax",
            "city": "海安县"
        },
        {
            "parentId": "320600",
            "cityId": "320623",
            "spell": "rdx",
            "city": "如东县"
        },
        {
            "parentId": "320600",
            "cityId": "320681",
            "spell": "qds",
            "city": "启东市"
        },
        {
            "parentId": "320600",
            "cityId": "320682",
            "spell": "rgs",
            "city": "如皋市"
        },
        {
            "parentId": "320600",
            "cityId": "320684",
            "spell": "hms",
            "city": "海门市"
        },
        {
            "parentId": "320000",
            "cityId": "320700",
            "spell": "lygs",
            "city": "连云港市"
        },
        {
            "parentId": "320700",
            "cityId": "320701",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "320700",
            "cityId": "320703",
            "spell": "lyq",
            "city": "连云区"
        },
        {
            "parentId": "320700",
            "cityId": "320705",
            "spell": "xpq",
            "city": "新浦区"
        },
        {
            "parentId": "320700",
            "cityId": "320706",
            "spell": "hzq",
            "city": "海州区"
        },
        {
            "parentId": "320700",
            "cityId": "320721",
            "spell": "gyx",
            "city": "赣榆县"
        },
        {
            "parentId": "320700",
            "cityId": "320722",
            "spell": "dhx",
            "city": "东海县"
        },
        {
            "parentId": "320700",
            "cityId": "320723",
            "spell": "gyx",
            "city": "灌云县"
        },
        {
            "parentId": "320700",
            "cityId": "320724",
            "spell": "gnx",
            "city": "灌南县"
        },
        {
            "parentId": "320000",
            "cityId": "320800",
            "spell": "has",
            "city": "淮安市"
        },
        {
            "parentId": "320800",
            "cityId": "320801",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "320800",
            "cityId": "320802",
            "spell": "qhq",
            "city": "清河区"
        },
        {
            "parentId": "320800",
            "cityId": "320803",
            "spell": "haq",
            "city": "淮安区"
        },
        {
            "parentId": "320800",
            "cityId": "320804",
            "spell": "hyq",
            "city": "淮阴区"
        },
        {
            "parentId": "320800",
            "cityId": "320811",
            "spell": "qpq",
            "city": "清浦区"
        },
        {
            "parentId": "320800",
            "cityId": "320826",
            "spell": "lsx",
            "city": "涟水县"
        },
        {
            "parentId": "320800",
            "cityId": "320829",
            "spell": "hzx",
            "city": "洪泽县"
        },
        {
            "parentId": "320800",
            "cityId": "320830",
            "spell": "xyx",
            "city": "盱眙县"
        },
        {
            "parentId": "320800",
            "cityId": "320831",
            "spell": "jhx",
            "city": "金湖县"
        },
        {
            "parentId": "320000",
            "cityId": "320900",
            "spell": "ycs",
            "city": "盐城市"
        },
        {
            "parentId": "320900",
            "cityId": "320901",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "320900",
            "cityId": "320902",
            "spell": "thq",
            "city": "亭湖区"
        },
        {
            "parentId": "320900",
            "cityId": "320903",
            "spell": "ydq",
            "city": "盐都区"
        },
        {
            "parentId": "320900",
            "cityId": "320921",
            "spell": "xsx",
            "city": "响水县"
        },
        {
            "parentId": "320900",
            "cityId": "320922",
            "spell": "bhx",
            "city": "滨海县"
        },
        {
            "parentId": "320900",
            "cityId": "320923",
            "spell": "fnx",
            "city": "阜宁县"
        },
        {
            "parentId": "320900",
            "cityId": "320924",
            "spell": "syx",
            "city": "射阳县"
        },
        {
            "parentId": "320900",
            "cityId": "320925",
            "spell": "jhx",
            "city": "建湖县"
        },
        {
            "parentId": "320900",
            "cityId": "320981",
            "spell": "dts",
            "city": "东台市"
        },
        {
            "parentId": "320900",
            "cityId": "320982",
            "spell": "dfs",
            "city": "大丰市"
        },
        {
            "parentId": "320000",
            "cityId": "321000",
            "spell": "yzs",
            "city": "扬州市"
        },
        {
            "parentId": "321000",
            "cityId": "321001",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "321000",
            "cityId": "321002",
            "spell": "glq",
            "city": "广陵区"
        },
        {
            "parentId": "321000",
            "cityId": "321003",
            "spell": "hjq",
            "city": "邗江区"
        },
        {
            "parentId": "321000",
            "cityId": "321012",
            "spell": "jdq",
            "city": "江都区"
        },
        {
            "parentId": "321000",
            "cityId": "321023",
            "spell": "byx",
            "city": "宝应县"
        },
        {
            "parentId": "321000",
            "cityId": "321081",
            "spell": "yzs",
            "city": "仪征市"
        },
        {
            "parentId": "321000",
            "cityId": "321084",
            "spell": "gys",
            "city": "高邮市"
        },
        {
            "parentId": "320000",
            "cityId": "321100",
            "spell": "zjs",
            "city": "镇江市"
        },
        {
            "parentId": "321100",
            "cityId": "321101",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "321100",
            "cityId": "321102",
            "spell": "jkq",
            "city": "京口区"
        },
        {
            "parentId": "321100",
            "cityId": "321111",
            "spell": "rzq",
            "city": "润州区"
        },
        {
            "parentId": "321100",
            "cityId": "321112",
            "spell": "dtq",
            "city": "丹徒区"
        },
        {
            "parentId": "321100",
            "cityId": "321181",
            "spell": "dys",
            "city": "丹阳市"
        },
        {
            "parentId": "321100",
            "cityId": "321182",
            "spell": "yzs",
            "city": "扬中市"
        },
        {
            "parentId": "321100",
            "cityId": "321183",
            "spell": "jrs",
            "city": "句容市"
        },
        {
            "parentId": "320000",
            "cityId": "321200",
            "spell": "tzs",
            "city": "泰州市"
        },
        {
            "parentId": "321200",
            "cityId": "321201",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "321200",
            "cityId": "321202",
            "spell": "hlq",
            "city": "海陵区"
        },
        {
            "parentId": "321200",
            "cityId": "321203",
            "spell": "ggq",
            "city": "高港区"
        },
        {
            "parentId": "321200",
            "cityId": "321204",
            "spell": "jyq",
            "city": "姜堰区"
        },
        {
            "parentId": "321200",
            "cityId": "321281",
            "spell": "xhs",
            "city": "兴化市"
        },
        {
            "parentId": "321200",
            "cityId": "321282",
            "spell": "jjs",
            "city": "靖江市"
        },
        {
            "parentId": "321200",
            "cityId": "321283",
            "spell": "txs",
            "city": "泰兴市"
        },
        {
            "parentId": "320000",
            "cityId": "321300",
            "spell": "sqs",
            "city": "宿迁市"
        },
        {
            "parentId": "321300",
            "cityId": "321301",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "321300",
            "cityId": "321302",
            "spell": "scq",
            "city": "宿城区"
        },
        {
            "parentId": "321300",
            "cityId": "321311",
            "spell": "syq",
            "city": "宿豫区"
        },
        {
            "parentId": "321300",
            "cityId": "321322",
            "spell": "syx",
            "city": "沭阳县"
        },
        {
            "parentId": "321300",
            "cityId": "321323",
            "spell": "syx",
            "city": "泗阳县"
        },
        {
            "parentId": "321300",
            "cityId": "321324",
            "spell": "shx",
            "city": "泗洪县"
        },
        {
            "parentId": "0",
            "cityId": "330000",
            "spell": "zjs",
            "city": "浙江省"
        },
        {
            "parentId": "330000",
            "cityId": "330100",
            "spell": "hzs",
            "city": "杭州市"
        },
        {
            "parentId": "330100",
            "cityId": "330101",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "330100",
            "cityId": "330102",
            "spell": "scq",
            "city": "上城区"
        },
        {
            "parentId": "330100",
            "cityId": "330103",
            "spell": "xcq",
            "city": "下城区"
        },
        {
            "parentId": "330100",
            "cityId": "330104",
            "spell": "jgq",
            "city": "江干区"
        },
        {
            "parentId": "330100",
            "cityId": "330105",
            "spell": "gsq",
            "city": "拱墅区"
        },
        {
            "parentId": "330100",
            "cityId": "330106",
            "spell": "xhq",
            "city": "西湖区"
        },
        {
            "parentId": "330100",
            "cityId": "330108",
            "spell": "bjq",
            "city": "滨江区"
        },
        {
            "parentId": "330100",
            "cityId": "330109",
            "spell": "xsq",
            "city": "萧山区"
        },
        {
            "parentId": "330100",
            "cityId": "330110",
            "spell": "yhq",
            "city": "余杭区"
        },
        {
            "parentId": "330100",
            "cityId": "330122",
            "spell": "tlx",
            "city": "桐庐县"
        },
        {
            "parentId": "330100",
            "cityId": "330127",
            "spell": "cax",
            "city": "淳安县"
        },
        {
            "parentId": "330100",
            "cityId": "330182",
            "spell": "jds",
            "city": "建德市"
        },
        {
            "parentId": "330100",
            "cityId": "330183",
            "spell": "fys",
            "city": "富阳市"
        },
        {
            "parentId": "330100",
            "cityId": "330185",
            "spell": "las",
            "city": "临安市"
        },
        {
            "parentId": "330000",
            "cityId": "330200",
            "spell": "nbs",
            "city": "宁波市"
        },
        {
            "parentId": "330200",
            "cityId": "330201",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "330200",
            "cityId": "330203",
            "spell": "hsq",
            "city": "海曙区"
        },
        {
            "parentId": "330200",
            "cityId": "330204",
            "spell": "jdq",
            "city": "江东区"
        },
        {
            "parentId": "330200",
            "cityId": "330205",
            "spell": "jbq",
            "city": "江北区"
        },
        {
            "parentId": "330200",
            "cityId": "330206",
            "spell": "blq",
            "city": "北仑区"
        },
        {
            "parentId": "330200",
            "cityId": "330211",
            "spell": "zhq",
            "city": "镇海区"
        },
        {
            "parentId": "330200",
            "cityId": "330212",
            "spell": "yzq",
            "city": "鄞州区"
        },
        {
            "parentId": "330200",
            "cityId": "330225",
            "spell": "xsx",
            "city": "象山县"
        },
        {
            "parentId": "330200",
            "cityId": "330226",
            "spell": "nhx",
            "city": "宁海县"
        },
        {
            "parentId": "330200",
            "cityId": "330281",
            "spell": "yys",
            "city": "余姚市"
        },
        {
            "parentId": "330200",
            "cityId": "330282",
            "spell": "cxs",
            "city": "慈溪市"
        },
        {
            "parentId": "330200",
            "cityId": "330283",
            "spell": "fhs",
            "city": "奉化市"
        },
        {
            "parentId": "330000",
            "cityId": "330300",
            "spell": "wzs",
            "city": "温州市"
        },
        {
            "parentId": "330300",
            "cityId": "330301",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "330300",
            "cityId": "330302",
            "spell": "lcq",
            "city": "鹿城区"
        },
        {
            "parentId": "330300",
            "cityId": "330303",
            "spell": "lwq",
            "city": "龙湾区"
        },
        {
            "parentId": "330300",
            "cityId": "330304",
            "spell": "ohq",
            "city": "瓯海区"
        },
        {
            "parentId": "330300",
            "cityId": "330322",
            "spell": "dtx",
            "city": "洞头县"
        },
        {
            "parentId": "330300",
            "cityId": "330324",
            "spell": "yjx",
            "city": "永嘉县"
        },
        {
            "parentId": "330300",
            "cityId": "330326",
            "spell": "pyx",
            "city": "平阳县"
        },
        {
            "parentId": "330300",
            "cityId": "330327",
            "spell": "cnx",
            "city": "苍南县"
        },
        {
            "parentId": "330300",
            "cityId": "330328",
            "spell": "wcx",
            "city": "文成县"
        },
        {
            "parentId": "330300",
            "cityId": "330329",
            "spell": "tsx",
            "city": "泰顺县"
        },
        {
            "parentId": "330300",
            "cityId": "330381",
            "spell": "ras",
            "city": "瑞安市"
        },
        {
            "parentId": "330300",
            "cityId": "330382",
            "spell": "lqs",
            "city": "乐清市"
        },
        {
            "parentId": "330000",
            "cityId": "330400",
            "spell": "jxs",
            "city": "嘉兴市"
        },
        {
            "parentId": "330400",
            "cityId": "330401",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "330400",
            "cityId": "330402",
            "spell": "nhq",
            "city": "南湖区"
        },
        {
            "parentId": "330400",
            "cityId": "330411",
            "spell": "xzq",
            "city": "秀洲区"
        },
        {
            "parentId": "330400",
            "cityId": "330421",
            "spell": "jsx",
            "city": "嘉善县"
        },
        {
            "parentId": "330400",
            "cityId": "330424",
            "spell": "hyx",
            "city": "海盐县"
        },
        {
            "parentId": "330400",
            "cityId": "330481",
            "spell": "hns",
            "city": "海宁市"
        },
        {
            "parentId": "330400",
            "cityId": "330482",
            "spell": "phs",
            "city": "平湖市"
        },
        {
            "parentId": "330400",
            "cityId": "330483",
            "spell": "txs",
            "city": "桐乡市"
        },
        {
            "parentId": "330000",
            "cityId": "330500",
            "spell": "hzs",
            "city": "湖州市"
        },
        {
            "parentId": "330500",
            "cityId": "330501",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "330500",
            "cityId": "330502",
            "spell": "wxq",
            "city": "吴兴区"
        },
        {
            "parentId": "330500",
            "cityId": "330503",
            "spell": "nxq",
            "city": "南浔区"
        },
        {
            "parentId": "330500",
            "cityId": "330521",
            "spell": "dqx",
            "city": "德清县"
        },
        {
            "parentId": "330500",
            "cityId": "330522",
            "spell": "cxx",
            "city": "长兴县"
        },
        {
            "parentId": "330500",
            "cityId": "330523",
            "spell": "ajx",
            "city": "安吉县"
        },
        {
            "parentId": "330000",
            "cityId": "330600",
            "spell": "sxs",
            "city": "绍兴市"
        },
        {
            "parentId": "330600",
            "cityId": "330601",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "330600",
            "cityId": "330602",
            "spell": "ycq",
            "city": "越城区"
        },
        {
            "parentId": "330600",
            "cityId": "330621",
            "spell": "sxx",
            "city": "绍兴县"
        },
        {
            "parentId": "330600",
            "cityId": "330624",
            "spell": "xcx",
            "city": "新昌县"
        },
        {
            "parentId": "330600",
            "cityId": "330681",
            "spell": "zjs",
            "city": "诸暨市"
        },
        {
            "parentId": "330600",
            "cityId": "330682",
            "spell": "sys",
            "city": "上虞市"
        },
        {
            "parentId": "330600",
            "cityId": "330683",
            "spell": "szs",
            "city": "嵊州市"
        },
        {
            "parentId": "330000",
            "cityId": "330700",
            "spell": "jhs",
            "city": "金华市"
        },
        {
            "parentId": "330700",
            "cityId": "330701",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "330700",
            "cityId": "330702",
            "spell": "wcq",
            "city": "婺城区"
        },
        {
            "parentId": "330700",
            "cityId": "330703",
            "spell": "jdq",
            "city": "金东区"
        },
        {
            "parentId": "330700",
            "cityId": "330723",
            "spell": "wyx",
            "city": "武义县"
        },
        {
            "parentId": "330700",
            "cityId": "330726",
            "spell": "pjx",
            "city": "浦江县"
        },
        {
            "parentId": "330700",
            "cityId": "330727",
            "spell": "pax",
            "city": "磐安县"
        },
        {
            "parentId": "330700",
            "cityId": "330781",
            "spell": "lxs",
            "city": "兰溪市"
        },
        {
            "parentId": "330700",
            "cityId": "330782",
            "spell": "yws",
            "city": "义乌市"
        },
        {
            "parentId": "330700",
            "cityId": "330783",
            "spell": "dys",
            "city": "东阳市"
        },
        {
            "parentId": "330700",
            "cityId": "330784",
            "spell": "yks",
            "city": "永康市"
        },
        {
            "parentId": "330000",
            "cityId": "330800",
            "spell": "qzs",
            "city": "衢州市"
        },
        {
            "parentId": "330800",
            "cityId": "330801",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "330800",
            "cityId": "330802",
            "spell": "kcq",
            "city": "柯城区"
        },
        {
            "parentId": "330800",
            "cityId": "330803",
            "spell": "qjq",
            "city": "衢江区"
        },
        {
            "parentId": "330800",
            "cityId": "330822",
            "spell": "csx",
            "city": "常山县"
        },
        {
            "parentId": "330800",
            "cityId": "330824",
            "spell": "khx",
            "city": "开化县"
        },
        {
            "parentId": "330800",
            "cityId": "330825",
            "spell": "lyx",
            "city": "龙游县"
        },
        {
            "parentId": "330800",
            "cityId": "330881",
            "spell": "jss",
            "city": "江山市"
        },
        {
            "parentId": "330000",
            "cityId": "330900",
            "spell": "zss",
            "city": "舟山市"
        },
        {
            "parentId": "330900",
            "cityId": "330901",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "330900",
            "cityId": "330902",
            "spell": "dhq",
            "city": "定海区"
        },
        {
            "parentId": "330900",
            "cityId": "330903",
            "spell": "ptq",
            "city": "普陀区"
        },
        {
            "parentId": "330900",
            "cityId": "330921",
            "spell": "dsx",
            "city": "岱山县"
        },
        {
            "parentId": "330900",
            "cityId": "330922",
            "spell": "ssx",
            "city": "嵊泗县"
        },
        {
            "parentId": "330000",
            "cityId": "331000",
            "spell": "tzs",
            "city": "台州市"
        },
        {
            "parentId": "331000",
            "cityId": "331001",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "331000",
            "cityId": "331002",
            "spell": "jjq",
            "city": "椒江区"
        },
        {
            "parentId": "331000",
            "cityId": "331003",
            "spell": "hyq",
            "city": "黄岩区"
        },
        {
            "parentId": "331000",
            "cityId": "331004",
            "spell": "lqq",
            "city": "路桥区"
        },
        {
            "parentId": "331000",
            "cityId": "331021",
            "spell": "yhx",
            "city": "玉环县"
        },
        {
            "parentId": "331000",
            "cityId": "331022",
            "spell": "smx",
            "city": "三门县"
        },
        {
            "parentId": "331000",
            "cityId": "331023",
            "spell": "ttx",
            "city": "天台县"
        },
        {
            "parentId": "331000",
            "cityId": "331024",
            "spell": "xjx",
            "city": "仙居县"
        },
        {
            "parentId": "331000",
            "cityId": "331081",
            "spell": "wls",
            "city": "温岭市"
        },
        {
            "parentId": "331000",
            "cityId": "331082",
            "spell": "lhs",
            "city": "临海市"
        },
        {
            "parentId": "330000",
            "cityId": "331100",
            "spell": "lss",
            "city": "丽水市"
        },
        {
            "parentId": "331100",
            "cityId": "331101",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "331100",
            "cityId": "331102",
            "spell": "ldq",
            "city": "莲都区"
        },
        {
            "parentId": "331100",
            "cityId": "331121",
            "spell": "qtx",
            "city": "青田县"
        },
        {
            "parentId": "331100",
            "cityId": "331122",
            "spell": "jyx",
            "city": "缙云县"
        },
        {
            "parentId": "331100",
            "cityId": "331123",
            "spell": "scx",
            "city": "遂昌县"
        },
        {
            "parentId": "331100",
            "cityId": "331124",
            "spell": "syx",
            "city": "松阳县"
        },
        {
            "parentId": "331100",
            "cityId": "331125",
            "spell": "yhx",
            "city": "云和县"
        },
        {
            "parentId": "331100",
            "cityId": "331126",
            "spell": "qyx",
            "city": "庆元县"
        },
        {
            "parentId": "331100",
            "cityId": "331127",
            "spell": "jnszzzx",
            "city": "景宁畲族自治县"
        },
        {
            "parentId": "331100",
            "cityId": "331181",
            "spell": "lqs",
            "city": "龙泉市"
        },
        {
            "parentId": "0",
            "cityId": "340000",
            "spell": "ahs",
            "city": "安徽省"
        },
        {
            "parentId": "340000",
            "cityId": "340100",
            "spell": "hfs",
            "city": "合肥市"
        },
        {
            "parentId": "340100",
            "cityId": "340101",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "340100",
            "cityId": "340102",
            "spell": "yhq",
            "city": "瑶海区"
        },
        {
            "parentId": "340100",
            "cityId": "340103",
            "spell": "lyq",
            "city": "庐阳区"
        },
        {
            "parentId": "340100",
            "cityId": "340104",
            "spell": "ssq",
            "city": "蜀山区"
        },
        {
            "parentId": "340100",
            "cityId": "340111",
            "spell": "bhq",
            "city": "包河区"
        },
        {
            "parentId": "340100",
            "cityId": "340121",
            "spell": "cfx",
            "city": "长丰县"
        },
        {
            "parentId": "340100",
            "cityId": "340122",
            "spell": "fdx",
            "city": "肥东县"
        },
        {
            "parentId": "340100",
            "cityId": "340123",
            "spell": "fxx",
            "city": "肥西县"
        },
        {
            "parentId": "340100",
            "cityId": "340124",
            "spell": "ljx",
            "city": "庐江县"
        },
        {
            "parentId": "340100",
            "cityId": "340181",
            "spell": "chs",
            "city": "巢湖市"
        },
        {
            "parentId": "340000",
            "cityId": "340200",
            "spell": "whs",
            "city": "芜湖市"
        },
        {
            "parentId": "340200",
            "cityId": "340201",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "340200",
            "cityId": "340202",
            "spell": "jhq",
            "city": "镜湖区"
        },
        {
            "parentId": "340200",
            "cityId": "340203",
            "spell": "yjq",
            "city": "弋江区"
        },
        {
            "parentId": "340200",
            "cityId": "340207",
            "spell": "jjq",
            "city": "鸠江区"
        },
        {
            "parentId": "340200",
            "cityId": "340208",
            "spell": "ssq",
            "city": "三山区"
        },
        {
            "parentId": "340200",
            "cityId": "340221",
            "spell": "whx",
            "city": "芜湖县"
        },
        {
            "parentId": "340200",
            "cityId": "340222",
            "spell": "fcx",
            "city": "繁昌县"
        },
        {
            "parentId": "340200",
            "cityId": "340223",
            "spell": "nlx",
            "city": "南陵县"
        },
        {
            "parentId": "340200",
            "cityId": "340225",
            "spell": "wwx",
            "city": "无为县"
        },
        {
            "parentId": "340000",
            "cityId": "340300",
            "spell": "bbs",
            "city": "蚌埠市"
        },
        {
            "parentId": "340300",
            "cityId": "340301",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "340300",
            "cityId": "340302",
            "spell": "lzhq",
            "city": "龙子湖区"
        },
        {
            "parentId": "340300",
            "cityId": "340303",
            "spell": "bsq",
            "city": "蚌山区"
        },
        {
            "parentId": "340300",
            "cityId": "340304",
            "spell": "yhq",
            "city": "禹会区"
        },
        {
            "parentId": "340300",
            "cityId": "340311",
            "spell": "hsq",
            "city": "淮上区"
        },
        {
            "parentId": "340300",
            "cityId": "340321",
            "spell": "hyx",
            "city": "怀远县"
        },
        {
            "parentId": "340300",
            "cityId": "340322",
            "spell": "whx",
            "city": "五河县"
        },
        {
            "parentId": "340300",
            "cityId": "340323",
            "spell": "gzx",
            "city": "固镇县"
        },
        {
            "parentId": "340000",
            "cityId": "340400",
            "spell": "hns",
            "city": "淮南市"
        },
        {
            "parentId": "340400",
            "cityId": "340401",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "340400",
            "cityId": "340402",
            "spell": "dtq",
            "city": "大通区"
        },
        {
            "parentId": "340400",
            "cityId": "340403",
            "spell": "tjaq",
            "city": "田家庵区"
        },
        {
            "parentId": "340400",
            "cityId": "340404",
            "spell": "xjjq",
            "city": "谢家集区"
        },
        {
            "parentId": "340400",
            "cityId": "340405",
            "spell": "bgsq",
            "city": "八公山区"
        },
        {
            "parentId": "340400",
            "cityId": "340406",
            "spell": "pjq",
            "city": "潘集区"
        },
        {
            "parentId": "340400",
            "cityId": "340421",
            "spell": "ftx",
            "city": "凤台县"
        },
        {
            "parentId": "340000",
            "cityId": "340500",
            "spell": "mass",
            "city": "马鞍山市"
        },
        {
            "parentId": "340500",
            "cityId": "340501",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "340500",
            "cityId": "340503",
            "spell": "hsq",
            "city": "花山区"
        },
        {
            "parentId": "340500",
            "cityId": "340504",
            "spell": "ysq",
            "city": "雨山区"
        },
        {
            "parentId": "340500",
            "cityId": "340506",
            "spell": "bwq",
            "city": "博望区"
        },
        {
            "parentId": "340500",
            "cityId": "340521",
            "spell": "dtx",
            "city": "当涂县"
        },
        {
            "parentId": "340500",
            "cityId": "340522",
            "spell": "hsx",
            "city": "含山县"
        },
        {
            "parentId": "340500",
            "cityId": "340523",
            "spell": "hx",
            "city": "和县"
        },
        {
            "parentId": "340000",
            "cityId": "340600",
            "spell": "hbs",
            "city": "淮北市"
        },
        {
            "parentId": "340600",
            "cityId": "340601",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "340600",
            "cityId": "340602",
            "spell": "djq",
            "city": "杜集区"
        },
        {
            "parentId": "340600",
            "cityId": "340603",
            "spell": "xsq",
            "city": "相山区"
        },
        {
            "parentId": "340600",
            "cityId": "340604",
            "spell": "lsq",
            "city": "烈山区"
        },
        {
            "parentId": "340600",
            "cityId": "340621",
            "spell": "sxx",
            "city": "濉溪县"
        },
        {
            "parentId": "340000",
            "cityId": "340700",
            "spell": "tls",
            "city": "铜陵市"
        },
        {
            "parentId": "340700",
            "cityId": "340701",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "340700",
            "cityId": "340702",
            "spell": "tgsq",
            "city": "铜官山区"
        },
        {
            "parentId": "340700",
            "cityId": "340703",
            "spell": "szsq",
            "city": "狮子山区"
        },
        {
            "parentId": "340700",
            "cityId": "340711",
            "spell": "jq",
            "city": "郊区"
        },
        {
            "parentId": "340700",
            "cityId": "340721",
            "spell": "tlx",
            "city": "铜陵县"
        },
        {
            "parentId": "340000",
            "cityId": "340800",
            "spell": "aqs",
            "city": "安庆市"
        },
        {
            "parentId": "340800",
            "cityId": "340801",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "340800",
            "cityId": "340802",
            "spell": "yjq",
            "city": "迎江区"
        },
        {
            "parentId": "340800",
            "cityId": "340803",
            "spell": "dgq",
            "city": "大观区"
        },
        {
            "parentId": "340800",
            "cityId": "340811",
            "spell": "yxq",
            "city": "宜秀区"
        },
        {
            "parentId": "340800",
            "cityId": "340822",
            "spell": "hnx",
            "city": "怀宁县"
        },
        {
            "parentId": "340800",
            "cityId": "340823",
            "spell": "zyx",
            "city": "枞阳县"
        },
        {
            "parentId": "340800",
            "cityId": "340824",
            "spell": "qsx",
            "city": "潜山县"
        },
        {
            "parentId": "340800",
            "cityId": "340825",
            "spell": "thx",
            "city": "太湖县"
        },
        {
            "parentId": "340800",
            "cityId": "340826",
            "spell": "ssx",
            "city": "宿松县"
        },
        {
            "parentId": "340800",
            "cityId": "340827",
            "spell": "wjx",
            "city": "望江县"
        },
        {
            "parentId": "340800",
            "cityId": "340828",
            "spell": "yxx",
            "city": "岳西县"
        },
        {
            "parentId": "340800",
            "cityId": "340881",
            "spell": "tcs",
            "city": "桐城市"
        },
        {
            "parentId": "340000",
            "cityId": "341000",
            "spell": "hss",
            "city": "黄山市"
        },
        {
            "parentId": "341000",
            "cityId": "341001",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "341000",
            "cityId": "341002",
            "spell": "txq",
            "city": "屯溪区"
        },
        {
            "parentId": "341000",
            "cityId": "341003",
            "spell": "hsq",
            "city": "黄山区"
        },
        {
            "parentId": "341000",
            "cityId": "341004",
            "spell": "hzq",
            "city": "徽州区"
        },
        {
            "parentId": "341000",
            "cityId": "341021",
            "spell": "sx",
            "city": "歙县"
        },
        {
            "parentId": "341000",
            "cityId": "341022",
            "spell": "xnx",
            "city": "休宁县"
        },
        {
            "parentId": "341000",
            "cityId": "341023",
            "spell": "yx",
            "city": "黟县"
        },
        {
            "parentId": "341000",
            "cityId": "341024",
            "spell": "qmx",
            "city": "祁门县"
        },
        {
            "parentId": "340000",
            "cityId": "341100",
            "spell": "czs",
            "city": "滁州市"
        },
        {
            "parentId": "341100",
            "cityId": "341101",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "341100",
            "cityId": "341102",
            "spell": "lyq",
            "city": "琅琊区"
        },
        {
            "parentId": "341100",
            "cityId": "341103",
            "spell": "nqq",
            "city": "南谯区"
        },
        {
            "parentId": "341100",
            "cityId": "341122",
            "spell": "lax",
            "city": "来安县"
        },
        {
            "parentId": "341100",
            "cityId": "341124",
            "spell": "qjx",
            "city": "全椒县"
        },
        {
            "parentId": "341100",
            "cityId": "341125",
            "spell": "dyx",
            "city": "定远县"
        },
        {
            "parentId": "341100",
            "cityId": "341126",
            "spell": "fyx",
            "city": "凤阳县"
        },
        {
            "parentId": "341100",
            "cityId": "341181",
            "spell": "tcs",
            "city": "天长市"
        },
        {
            "parentId": "341100",
            "cityId": "341182",
            "spell": "mgs",
            "city": "明光市"
        },
        {
            "parentId": "340000",
            "cityId": "341200",
            "spell": "fys",
            "city": "阜阳市"
        },
        {
            "parentId": "341200",
            "cityId": "341201",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "341200",
            "cityId": "341202",
            "spell": "yzq",
            "city": "颍州区"
        },
        {
            "parentId": "341200",
            "cityId": "341203",
            "spell": "ydq",
            "city": "颍东区"
        },
        {
            "parentId": "341200",
            "cityId": "341204",
            "spell": "yqq",
            "city": "颍泉区"
        },
        {
            "parentId": "341200",
            "cityId": "341221",
            "spell": "lqx",
            "city": "临泉县"
        },
        {
            "parentId": "341200",
            "cityId": "341222",
            "spell": "thx",
            "city": "太和县"
        },
        {
            "parentId": "341200",
            "cityId": "341225",
            "spell": "fnx",
            "city": "阜南县"
        },
        {
            "parentId": "341200",
            "cityId": "341226",
            "spell": "ysx",
            "city": "颍上县"
        },
        {
            "parentId": "341200",
            "cityId": "341282",
            "spell": "jss",
            "city": "界首市"
        },
        {
            "parentId": "340000",
            "cityId": "341300",
            "spell": "szs",
            "city": "宿州市"
        },
        {
            "parentId": "341300",
            "cityId": "341301",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "341300",
            "cityId": "341302",
            "spell": "yqq",
            "city": "埇桥区"
        },
        {
            "parentId": "341300",
            "cityId": "341321",
            "spell": "dsx",
            "city": "砀山县"
        },
        {
            "parentId": "341300",
            "cityId": "341322",
            "spell": "xx",
            "city": "萧县"
        },
        {
            "parentId": "341300",
            "cityId": "341323",
            "spell": "lbx",
            "city": "灵璧县"
        },
        {
            "parentId": "341300",
            "cityId": "341324",
            "spell": "sx",
            "city": "泗县"
        },
        {
            "parentId": "340000",
            "cityId": "341500",
            "spell": "las",
            "city": "六安市"
        },
        {
            "parentId": "341500",
            "cityId": "341501",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "341500",
            "cityId": "341502",
            "spell": "jaq",
            "city": "金安区"
        },
        {
            "parentId": "341500",
            "cityId": "341503",
            "spell": "yaq",
            "city": "裕安区"
        },
        {
            "parentId": "341500",
            "cityId": "341521",
            "spell": "sx",
            "city": "寿县"
        },
        {
            "parentId": "341500",
            "cityId": "341522",
            "spell": "hqx",
            "city": "霍邱县"
        },
        {
            "parentId": "341500",
            "cityId": "341523",
            "spell": "scx",
            "city": "舒城县"
        },
        {
            "parentId": "341500",
            "cityId": "341524",
            "spell": "jzx",
            "city": "金寨县"
        },
        {
            "parentId": "341500",
            "cityId": "341525",
            "spell": "hsx",
            "city": "霍山县"
        },
        {
            "parentId": "340000",
            "cityId": "341600",
            "spell": "bzs",
            "city": "亳州市"
        },
        {
            "parentId": "341600",
            "cityId": "341601",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "341600",
            "cityId": "341602",
            "spell": "qcq",
            "city": "谯城区"
        },
        {
            "parentId": "341600",
            "cityId": "341621",
            "spell": "wyx",
            "city": "涡阳县"
        },
        {
            "parentId": "341600",
            "cityId": "341622",
            "spell": "mcx",
            "city": "蒙城县"
        },
        {
            "parentId": "341600",
            "cityId": "341623",
            "spell": "lxx",
            "city": "利辛县"
        },
        {
            "parentId": "340000",
            "cityId": "341700",
            "spell": "czs",
            "city": "池州市"
        },
        {
            "parentId": "341700",
            "cityId": "341701",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "341700",
            "cityId": "341702",
            "spell": "gcq",
            "city": "贵池区"
        },
        {
            "parentId": "341700",
            "cityId": "341721",
            "spell": "dzx",
            "city": "东至县"
        },
        {
            "parentId": "341700",
            "cityId": "341722",
            "spell": "stx",
            "city": "石台县"
        },
        {
            "parentId": "341700",
            "cityId": "341723",
            "spell": "qyx",
            "city": "青阳县"
        },
        {
            "parentId": "340000",
            "cityId": "341800",
            "spell": "xcs",
            "city": "宣城市"
        },
        {
            "parentId": "341800",
            "cityId": "341801",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "341800",
            "cityId": "341802",
            "spell": "xzq",
            "city": "宣州区"
        },
        {
            "parentId": "341800",
            "cityId": "341821",
            "spell": "lxx",
            "city": "郎溪县"
        },
        {
            "parentId": "341800",
            "cityId": "341822",
            "spell": "gdx",
            "city": "广德县"
        },
        {
            "parentId": "341800",
            "cityId": "341823",
            "spell": "jx",
            "city": "泾县"
        },
        {
            "parentId": "341800",
            "cityId": "341824",
            "spell": "jxx",
            "city": "绩溪县"
        },
        {
            "parentId": "341800",
            "cityId": "341825",
            "spell": "jdx",
            "city": "旌德县"
        },
        {
            "parentId": "341800",
            "cityId": "341881",
            "spell": "ngs",
            "city": "宁国市"
        },
        {
            "parentId": "0",
            "cityId": "350000",
            "spell": "fjs",
            "city": "福建省"
        },
        {
            "parentId": "350000",
            "cityId": "350100",
            "spell": "fzs",
            "city": "福州市"
        },
        {
            "parentId": "350100",
            "cityId": "350101",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "350100",
            "cityId": "350102",
            "spell": "glq",
            "city": "鼓楼区"
        },
        {
            "parentId": "350100",
            "cityId": "350103",
            "spell": "tjq",
            "city": "台江区"
        },
        {
            "parentId": "350100",
            "cityId": "350104",
            "spell": "csq",
            "city": "仓山区"
        },
        {
            "parentId": "350100",
            "cityId": "350105",
            "spell": "mwq",
            "city": "马尾区"
        },
        {
            "parentId": "350100",
            "cityId": "350111",
            "spell": "jaq",
            "city": "晋安区"
        },
        {
            "parentId": "350100",
            "cityId": "350121",
            "spell": "mhx",
            "city": "闽侯县"
        },
        {
            "parentId": "350100",
            "cityId": "350122",
            "spell": "ljx",
            "city": "连江县"
        },
        {
            "parentId": "350100",
            "cityId": "350123",
            "spell": "lyx",
            "city": "罗源县"
        },
        {
            "parentId": "350100",
            "cityId": "350124",
            "spell": "mqx",
            "city": "闽清县"
        },
        {
            "parentId": "350100",
            "cityId": "350125",
            "spell": "ytx",
            "city": "永泰县"
        },
        {
            "parentId": "350100",
            "cityId": "350128",
            "spell": "ptx",
            "city": "平潭县"
        },
        {
            "parentId": "350100",
            "cityId": "350181",
            "spell": "fqs",
            "city": "福清市"
        },
        {
            "parentId": "350100",
            "cityId": "350182",
            "spell": "cls",
            "city": "长乐市"
        },
        {
            "parentId": "350000",
            "cityId": "350200",
            "spell": "xms",
            "city": "厦门市"
        },
        {
            "parentId": "350200",
            "cityId": "350201",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "350200",
            "cityId": "350203",
            "spell": "smq",
            "city": "思明区"
        },
        {
            "parentId": "350200",
            "cityId": "350205",
            "spell": "hcq",
            "city": "海沧区"
        },
        {
            "parentId": "350200",
            "cityId": "350206",
            "spell": "hlq",
            "city": "湖里区"
        },
        {
            "parentId": "350200",
            "cityId": "350211",
            "spell": "jmq",
            "city": "集美区"
        },
        {
            "parentId": "350200",
            "cityId": "350212",
            "spell": "taq",
            "city": "同安区"
        },
        {
            "parentId": "350200",
            "cityId": "350213",
            "spell": "xaq",
            "city": "翔安区"
        },
        {
            "parentId": "350000",
            "cityId": "350300",
            "spell": "pts",
            "city": "莆田市"
        },
        {
            "parentId": "350300",
            "cityId": "350301",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "350300",
            "cityId": "350302",
            "spell": "cxq",
            "city": "城厢区"
        },
        {
            "parentId": "350300",
            "cityId": "350303",
            "spell": "hjq",
            "city": "涵江区"
        },
        {
            "parentId": "350300",
            "cityId": "350304",
            "spell": "lcq",
            "city": "荔城区"
        },
        {
            "parentId": "350300",
            "cityId": "350305",
            "spell": "xyq",
            "city": "秀屿区"
        },
        {
            "parentId": "350300",
            "cityId": "350322",
            "spell": "xyx",
            "city": "仙游县"
        },
        {
            "parentId": "350000",
            "cityId": "350400",
            "spell": "sms",
            "city": "三明市"
        },
        {
            "parentId": "350400",
            "cityId": "350401",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "350400",
            "cityId": "350402",
            "spell": "mlq",
            "city": "梅列区"
        },
        {
            "parentId": "350400",
            "cityId": "350403",
            "spell": "syq",
            "city": "三元区"
        },
        {
            "parentId": "350400",
            "cityId": "350421",
            "spell": "mxx",
            "city": "明溪县"
        },
        {
            "parentId": "350400",
            "cityId": "350423",
            "spell": "qlx",
            "city": "清流县"
        },
        {
            "parentId": "350400",
            "cityId": "350424",
            "spell": "nhx",
            "city": "宁化县"
        },
        {
            "parentId": "350400",
            "cityId": "350425",
            "spell": "dtx",
            "city": "大田县"
        },
        {
            "parentId": "350400",
            "cityId": "350426",
            "spell": "yxx",
            "city": "尤溪县"
        },
        {
            "parentId": "350400",
            "cityId": "350427",
            "spell": "sx",
            "city": "沙县"
        },
        {
            "parentId": "350400",
            "cityId": "350428",
            "spell": "jlx",
            "city": "将乐县"
        },
        {
            "parentId": "350400",
            "cityId": "350429",
            "spell": "tnx",
            "city": "泰宁县"
        },
        {
            "parentId": "350400",
            "cityId": "350430",
            "spell": "jnx",
            "city": "建宁县"
        },
        {
            "parentId": "350400",
            "cityId": "350481",
            "spell": "yas",
            "city": "永安市"
        },
        {
            "parentId": "350000",
            "cityId": "350500",
            "spell": "qzs",
            "city": "泉州市"
        },
        {
            "parentId": "350500",
            "cityId": "350501",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "350500",
            "cityId": "350502",
            "spell": "lcq",
            "city": "鲤城区"
        },
        {
            "parentId": "350500",
            "cityId": "350503",
            "spell": "fzq",
            "city": "丰泽区"
        },
        {
            "parentId": "350500",
            "cityId": "350504",
            "spell": "ljq",
            "city": "洛江区"
        },
        {
            "parentId": "350500",
            "cityId": "350505",
            "spell": "qgq",
            "city": "泉港区"
        },
        {
            "parentId": "350500",
            "cityId": "350521",
            "spell": "hax",
            "city": "惠安县"
        },
        {
            "parentId": "350500",
            "cityId": "350524",
            "spell": "axx",
            "city": "安溪县"
        },
        {
            "parentId": "350500",
            "cityId": "350525",
            "spell": "ycx",
            "city": "永春县"
        },
        {
            "parentId": "350500",
            "cityId": "350526",
            "spell": "dhx",
            "city": "德化县"
        },
        {
            "parentId": "350500",
            "cityId": "350527",
            "spell": "jmx",
            "city": "金门县"
        },
        {
            "parentId": "350500",
            "cityId": "350581",
            "spell": "sss",
            "city": "石狮市"
        },
        {
            "parentId": "350500",
            "cityId": "350582",
            "spell": "jjs",
            "city": "晋江市"
        },
        {
            "parentId": "350500",
            "cityId": "350583",
            "spell": "nas",
            "city": "南安市"
        },
        {
            "parentId": "350000",
            "cityId": "350600",
            "spell": "zzs",
            "city": "漳州市"
        },
        {
            "parentId": "350600",
            "cityId": "350601",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "350600",
            "cityId": "350602",
            "spell": "xcq",
            "city": "芗城区"
        },
        {
            "parentId": "350600",
            "cityId": "350603",
            "spell": "lwq",
            "city": "龙文区"
        },
        {
            "parentId": "350600",
            "cityId": "350622",
            "spell": "yxx",
            "city": "云霄县"
        },
        {
            "parentId": "350600",
            "cityId": "350623",
            "spell": "zpx",
            "city": "漳浦县"
        },
        {
            "parentId": "350600",
            "cityId": "350624",
            "spell": "zax",
            "city": "诏安县"
        },
        {
            "parentId": "350600",
            "cityId": "350625",
            "spell": "ctx",
            "city": "长泰县"
        },
        {
            "parentId": "350600",
            "cityId": "350626",
            "spell": "dsx",
            "city": "东山县"
        },
        {
            "parentId": "350600",
            "cityId": "350627",
            "spell": "njx",
            "city": "南靖县"
        },
        {
            "parentId": "350600",
            "cityId": "350628",
            "spell": "phx",
            "city": "平和县"
        },
        {
            "parentId": "350600",
            "cityId": "350629",
            "spell": "hax",
            "city": "华安县"
        },
        {
            "parentId": "350600",
            "cityId": "350681",
            "spell": "lhs",
            "city": "龙海市"
        },
        {
            "parentId": "350000",
            "cityId": "350700",
            "spell": "nps",
            "city": "南平市"
        },
        {
            "parentId": "350700",
            "cityId": "350701",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "350700",
            "cityId": "350702",
            "spell": "ypq",
            "city": "延平区"
        },
        {
            "parentId": "350700",
            "cityId": "350721",
            "spell": "scx",
            "city": "顺昌县"
        },
        {
            "parentId": "350700",
            "cityId": "350722",
            "spell": "pcx",
            "city": "浦城县"
        },
        {
            "parentId": "350700",
            "cityId": "350723",
            "spell": "gzx",
            "city": "光泽县"
        },
        {
            "parentId": "350700",
            "cityId": "350724",
            "spell": "sxx",
            "city": "松溪县"
        },
        {
            "parentId": "350700",
            "cityId": "350725",
            "spell": "zhx",
            "city": "政和县"
        },
        {
            "parentId": "350700",
            "cityId": "350781",
            "spell": "sws",
            "city": "邵武市"
        },
        {
            "parentId": "350700",
            "cityId": "350782",
            "spell": "wyss",
            "city": "武夷山市"
        },
        {
            "parentId": "350700",
            "cityId": "350783",
            "spell": "jos",
            "city": "建瓯市"
        },
        {
            "parentId": "350700",
            "cityId": "350784",
            "spell": "jys",
            "city": "建阳市"
        },
        {
            "parentId": "350000",
            "cityId": "350800",
            "spell": "lys",
            "city": "龙岩市"
        },
        {
            "parentId": "350800",
            "cityId": "350801",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "350800",
            "cityId": "350802",
            "spell": "xlq",
            "city": "新罗区"
        },
        {
            "parentId": "350800",
            "cityId": "350821",
            "spell": "ctx",
            "city": "长汀县"
        },
        {
            "parentId": "350800",
            "cityId": "350822",
            "spell": "ydx",
            "city": "永定县"
        },
        {
            "parentId": "350800",
            "cityId": "350823",
            "spell": "shx",
            "city": "上杭县"
        },
        {
            "parentId": "350800",
            "cityId": "350824",
            "spell": "wpx",
            "city": "武平县"
        },
        {
            "parentId": "350800",
            "cityId": "350825",
            "spell": "lcx",
            "city": "连城县"
        },
        {
            "parentId": "350800",
            "cityId": "350881",
            "spell": "zps",
            "city": "漳平市"
        },
        {
            "parentId": "350000",
            "cityId": "350900",
            "spell": "nds",
            "city": "宁德市"
        },
        {
            "parentId": "350900",
            "cityId": "350901",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "350900",
            "cityId": "350902",
            "spell": "jcq",
            "city": "蕉城区"
        },
        {
            "parentId": "350900",
            "cityId": "350921",
            "spell": "xpx",
            "city": "霞浦县"
        },
        {
            "parentId": "350900",
            "cityId": "350922",
            "spell": "gtx",
            "city": "古田县"
        },
        {
            "parentId": "350900",
            "cityId": "350923",
            "spell": "pnx",
            "city": "屏南县"
        },
        {
            "parentId": "350900",
            "cityId": "350924",
            "spell": "snx",
            "city": "寿宁县"
        },
        {
            "parentId": "350900",
            "cityId": "350925",
            "spell": "znx",
            "city": "周宁县"
        },
        {
            "parentId": "350900",
            "cityId": "350926",
            "spell": "zrx",
            "city": "柘荣县"
        },
        {
            "parentId": "350900",
            "cityId": "350981",
            "spell": "fas",
            "city": "福安市"
        },
        {
            "parentId": "350900",
            "cityId": "350982",
            "spell": "fds",
            "city": "福鼎市"
        },
        {
            "parentId": "0",
            "cityId": "360000",
            "spell": "jxs",
            "city": "江西省"
        },
        {
            "parentId": "360000",
            "cityId": "360100",
            "spell": "ncs",
            "city": "南昌市"
        },
        {
            "parentId": "360100",
            "cityId": "360101",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "360100",
            "cityId": "360102",
            "spell": "dhq",
            "city": "东湖区"
        },
        {
            "parentId": "360100",
            "cityId": "360103",
            "spell": "xhq",
            "city": "西湖区"
        },
        {
            "parentId": "360100",
            "cityId": "360104",
            "spell": "qypq",
            "city": "青云谱区"
        },
        {
            "parentId": "360100",
            "cityId": "360105",
            "spell": "wlq",
            "city": "湾里区"
        },
        {
            "parentId": "360100",
            "cityId": "360111",
            "spell": "qshq",
            "city": "青山湖区"
        },
        {
            "parentId": "360100",
            "cityId": "360121",
            "spell": "ncx",
            "city": "南昌县"
        },
        {
            "parentId": "360100",
            "cityId": "360122",
            "spell": "xjx",
            "city": "新建县"
        },
        {
            "parentId": "360100",
            "cityId": "360123",
            "spell": "ayx",
            "city": "安义县"
        },
        {
            "parentId": "360100",
            "cityId": "360124",
            "spell": "jxx",
            "city": "进贤县"
        },
        {
            "parentId": "360000",
            "cityId": "360200",
            "spell": "jdzs",
            "city": "景德镇市"
        },
        {
            "parentId": "360200",
            "cityId": "360201",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "360200",
            "cityId": "360202",
            "spell": "cjq",
            "city": "昌江区"
        },
        {
            "parentId": "360200",
            "cityId": "360203",
            "spell": "zsq",
            "city": "珠山区"
        },
        {
            "parentId": "360200",
            "cityId": "360222",
            "spell": "flx",
            "city": "浮梁县"
        },
        {
            "parentId": "360200",
            "cityId": "360281",
            "spell": "lps",
            "city": "乐平市"
        },
        {
            "parentId": "360000",
            "cityId": "360300",
            "spell": "pxs",
            "city": "萍乡市"
        },
        {
            "parentId": "360300",
            "cityId": "360301",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "360300",
            "cityId": "360302",
            "spell": "ayq",
            "city": "安源区"
        },
        {
            "parentId": "360300",
            "cityId": "360313",
            "spell": "xdq",
            "city": "湘东区"
        },
        {
            "parentId": "360300",
            "cityId": "360321",
            "spell": "lhx",
            "city": "莲花县"
        },
        {
            "parentId": "360300",
            "cityId": "360322",
            "spell": "slx",
            "city": "上栗县"
        },
        {
            "parentId": "360300",
            "cityId": "360323",
            "spell": "lxx",
            "city": "芦溪县"
        },
        {
            "parentId": "360000",
            "cityId": "360400",
            "spell": "jjs",
            "city": "九江市"
        },
        {
            "parentId": "360400",
            "cityId": "360401",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "360400",
            "cityId": "360402",
            "spell": "lsq",
            "city": "庐山区"
        },
        {
            "parentId": "360400",
            "cityId": "360403",
            "spell": "xyq",
            "city": "浔阳区"
        },
        {
            "parentId": "360400",
            "cityId": "360421",
            "spell": "jjx",
            "city": "九江县"
        },
        {
            "parentId": "360400",
            "cityId": "360423",
            "spell": "wnx",
            "city": "武宁县"
        },
        {
            "parentId": "360400",
            "cityId": "360424",
            "spell": "xsx",
            "city": "修水县"
        },
        {
            "parentId": "360400",
            "cityId": "360425",
            "spell": "yxx",
            "city": "永修县"
        },
        {
            "parentId": "360400",
            "cityId": "360426",
            "spell": "dax",
            "city": "德安县"
        },
        {
            "parentId": "360400",
            "cityId": "360427",
            "spell": "xzx",
            "city": "星子县"
        },
        {
            "parentId": "360400",
            "cityId": "360428",
            "spell": "dcx",
            "city": "都昌县"
        },
        {
            "parentId": "360400",
            "cityId": "360429",
            "spell": "hkx",
            "city": "湖口县"
        },
        {
            "parentId": "360400",
            "cityId": "360430",
            "spell": "pzx",
            "city": "彭泽县"
        },
        {
            "parentId": "360400",
            "cityId": "360481",
            "spell": "rcs",
            "city": "瑞昌市"
        },
        {
            "parentId": "360400",
            "cityId": "360482",
            "spell": "gqcs",
            "city": "共青城市"
        },
        {
            "parentId": "360000",
            "cityId": "360500",
            "spell": "xys",
            "city": "新余市"
        },
        {
            "parentId": "360500",
            "cityId": "360501",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "360500",
            "cityId": "360502",
            "spell": "ysq",
            "city": "渝水区"
        },
        {
            "parentId": "360500",
            "cityId": "360521",
            "spell": "fyx",
            "city": "分宜县"
        },
        {
            "parentId": "360000",
            "cityId": "360600",
            "spell": "yts",
            "city": "鹰潭市"
        },
        {
            "parentId": "360600",
            "cityId": "360601",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "360600",
            "cityId": "360602",
            "spell": "yhq",
            "city": "月湖区"
        },
        {
            "parentId": "360600",
            "cityId": "360622",
            "spell": "yjx",
            "city": "余江县"
        },
        {
            "parentId": "360600",
            "cityId": "360681",
            "spell": "gxs",
            "city": "贵溪市"
        },
        {
            "parentId": "360000",
            "cityId": "360700",
            "spell": "gzs",
            "city": "赣州市"
        },
        {
            "parentId": "360700",
            "cityId": "360701",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "360700",
            "cityId": "360702",
            "spell": "zgq",
            "city": "章贡区"
        },
        {
            "parentId": "360700",
            "cityId": "360721",
            "spell": "gx",
            "city": "赣县"
        },
        {
            "parentId": "360700",
            "cityId": "360722",
            "spell": "xfx",
            "city": "信丰县"
        },
        {
            "parentId": "360700",
            "cityId": "360723",
            "spell": "dyx",
            "city": "大余县"
        },
        {
            "parentId": "360700",
            "cityId": "360724",
            "spell": "syx",
            "city": "上犹县"
        },
        {
            "parentId": "360700",
            "cityId": "360725",
            "spell": "cyx",
            "city": "崇义县"
        },
        {
            "parentId": "360700",
            "cityId": "360726",
            "spell": "ayx",
            "city": "安远县"
        },
        {
            "parentId": "360700",
            "cityId": "360727",
            "spell": "lnx",
            "city": "龙南县"
        },
        {
            "parentId": "360700",
            "cityId": "360728",
            "spell": "dnx",
            "city": "定南县"
        },
        {
            "parentId": "360700",
            "cityId": "360729",
            "spell": "qnx",
            "city": "全南县"
        },
        {
            "parentId": "360700",
            "cityId": "360730",
            "spell": "ndx",
            "city": "宁都县"
        },
        {
            "parentId": "360700",
            "cityId": "360731",
            "spell": "ydx",
            "city": "于都县"
        },
        {
            "parentId": "360700",
            "cityId": "360732",
            "spell": "xgx",
            "city": "兴国县"
        },
        {
            "parentId": "360700",
            "cityId": "360733",
            "spell": "hcx",
            "city": "会昌县"
        },
        {
            "parentId": "360700",
            "cityId": "360734",
            "spell": "xwx",
            "city": "寻乌县"
        },
        {
            "parentId": "360700",
            "cityId": "360735",
            "spell": "scx",
            "city": "石城县"
        },
        {
            "parentId": "360700",
            "cityId": "360781",
            "spell": "rjs",
            "city": "瑞金市"
        },
        {
            "parentId": "360700",
            "cityId": "360782",
            "spell": "nks",
            "city": "南康市"
        },
        {
            "parentId": "360000",
            "cityId": "360800",
            "spell": "jas",
            "city": "吉安市"
        },
        {
            "parentId": "360800",
            "cityId": "360801",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "360800",
            "cityId": "360802",
            "spell": "jzq",
            "city": "吉州区"
        },
        {
            "parentId": "360800",
            "cityId": "360803",
            "spell": "qyq",
            "city": "青原区"
        },
        {
            "parentId": "360800",
            "cityId": "360821",
            "spell": "jax",
            "city": "吉安县"
        },
        {
            "parentId": "360800",
            "cityId": "360822",
            "spell": "jsx",
            "city": "吉水县"
        },
        {
            "parentId": "360800",
            "cityId": "360823",
            "spell": "xjx",
            "city": "峡江县"
        },
        {
            "parentId": "360800",
            "cityId": "360824",
            "spell": "xgx",
            "city": "新干县"
        },
        {
            "parentId": "360800",
            "cityId": "360825",
            "spell": "yfx",
            "city": "永丰县"
        },
        {
            "parentId": "360800",
            "cityId": "360826",
            "spell": "thx",
            "city": "泰和县"
        },
        {
            "parentId": "360800",
            "cityId": "360827",
            "spell": "scx",
            "city": "遂川县"
        },
        {
            "parentId": "360800",
            "cityId": "360828",
            "spell": "wax",
            "city": "万安县"
        },
        {
            "parentId": "360800",
            "cityId": "360829",
            "spell": "afx",
            "city": "安福县"
        },
        {
            "parentId": "360800",
            "cityId": "360830",
            "spell": "yxx",
            "city": "永新县"
        },
        {
            "parentId": "360800",
            "cityId": "360881",
            "spell": "jgss",
            "city": "井冈山市"
        },
        {
            "parentId": "360000",
            "cityId": "360900",
            "spell": "ycs",
            "city": "宜春市"
        },
        {
            "parentId": "360900",
            "cityId": "360901",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "360900",
            "cityId": "360902",
            "spell": "yzq",
            "city": "袁州区"
        },
        {
            "parentId": "360900",
            "cityId": "360921",
            "spell": "fxx",
            "city": "奉新县"
        },
        {
            "parentId": "360900",
            "cityId": "360922",
            "spell": "wzx",
            "city": "万载县"
        },
        {
            "parentId": "360900",
            "cityId": "360923",
            "spell": "sgx",
            "city": "上高县"
        },
        {
            "parentId": "360900",
            "cityId": "360924",
            "spell": "yfx",
            "city": "宜丰县"
        },
        {
            "parentId": "360900",
            "cityId": "360925",
            "spell": "jax",
            "city": "靖安县"
        },
        {
            "parentId": "360900",
            "cityId": "360926",
            "spell": "tgx",
            "city": "铜鼓县"
        },
        {
            "parentId": "360900",
            "cityId": "360981",
            "spell": "fcs",
            "city": "丰城市"
        },
        {
            "parentId": "360900",
            "cityId": "360982",
            "spell": "zss",
            "city": "樟树市"
        },
        {
            "parentId": "360900",
            "cityId": "360983",
            "spell": "gas",
            "city": "高安市"
        },
        {
            "parentId": "360000",
            "cityId": "361000",
            "spell": "fzs",
            "city": "抚州市"
        },
        {
            "parentId": "361000",
            "cityId": "361001",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "361000",
            "cityId": "361002",
            "spell": "lcq",
            "city": "临川区"
        },
        {
            "parentId": "361000",
            "cityId": "361021",
            "spell": "ncx",
            "city": "南城县"
        },
        {
            "parentId": "361000",
            "cityId": "361022",
            "spell": "lcx",
            "city": "黎川县"
        },
        {
            "parentId": "361000",
            "cityId": "361023",
            "spell": "nfx",
            "city": "南丰县"
        },
        {
            "parentId": "361000",
            "cityId": "361024",
            "spell": "crx",
            "city": "崇仁县"
        },
        {
            "parentId": "361000",
            "cityId": "361025",
            "spell": "lax",
            "city": "乐安县"
        },
        {
            "parentId": "361000",
            "cityId": "361026",
            "spell": "yhx",
            "city": "宜黄县"
        },
        {
            "parentId": "361000",
            "cityId": "361027",
            "spell": "jxx",
            "city": "金溪县"
        },
        {
            "parentId": "361000",
            "cityId": "361028",
            "spell": "zxx",
            "city": "资溪县"
        },
        {
            "parentId": "361000",
            "cityId": "361029",
            "spell": "dxx",
            "city": "东乡县"
        },
        {
            "parentId": "361000",
            "cityId": "361030",
            "spell": "gcx",
            "city": "广昌县"
        },
        {
            "parentId": "360000",
            "cityId": "361100",
            "spell": "srs",
            "city": "上饶市"
        },
        {
            "parentId": "361100",
            "cityId": "361101",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "361100",
            "cityId": "361102",
            "spell": "xzq",
            "city": "信州区"
        },
        {
            "parentId": "361100",
            "cityId": "361121",
            "spell": "srx",
            "city": "上饶县"
        },
        {
            "parentId": "361100",
            "cityId": "361122",
            "spell": "gfx",
            "city": "广丰县"
        },
        {
            "parentId": "361100",
            "cityId": "361123",
            "spell": "ysx",
            "city": "玉山县"
        },
        {
            "parentId": "361100",
            "cityId": "361124",
            "spell": "qsx",
            "city": "铅山县"
        },
        {
            "parentId": "361100",
            "cityId": "361125",
            "spell": "hfx",
            "city": "横峰县"
        },
        {
            "parentId": "361100",
            "cityId": "361126",
            "spell": "yyx",
            "city": "弋阳县"
        },
        {
            "parentId": "361100",
            "cityId": "361127",
            "spell": "ygx",
            "city": "余干县"
        },
        {
            "parentId": "361100",
            "cityId": "361128",
            "spell": "pyx",
            "city": "鄱阳县"
        },
        {
            "parentId": "361100",
            "cityId": "361129",
            "spell": "wnx",
            "city": "万年县"
        },
        {
            "parentId": "361100",
            "cityId": "361130",
            "spell": "wyx",
            "city": "婺源县"
        },
        {
            "parentId": "361100",
            "cityId": "361181",
            "spell": "dxs",
            "city": "德兴市"
        },
        {
            "parentId": "0",
            "cityId": "370000",
            "spell": "sds",
            "city": "山东省"
        },
        {
            "parentId": "370000",
            "cityId": "370100",
            "spell": "jns",
            "city": "济南市"
        },
        {
            "parentId": "370100",
            "cityId": "370101",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "370100",
            "cityId": "370102",
            "spell": "lxq",
            "city": "历下区"
        },
        {
            "parentId": "370100",
            "cityId": "370103",
            "spell": "szq",
            "city": "市中区"
        },
        {
            "parentId": "370100",
            "cityId": "370104",
            "spell": "hyq",
            "city": "槐荫区"
        },
        {
            "parentId": "370100",
            "cityId": "370105",
            "spell": "tqq",
            "city": "天桥区"
        },
        {
            "parentId": "370100",
            "cityId": "370112",
            "spell": "lcq",
            "city": "历城区"
        },
        {
            "parentId": "370100",
            "cityId": "370113",
            "spell": "cqq",
            "city": "长清区"
        },
        {
            "parentId": "370100",
            "cityId": "370124",
            "spell": "pyx",
            "city": "平阴县"
        },
        {
            "parentId": "370100",
            "cityId": "370125",
            "spell": "jyx",
            "city": "济阳县"
        },
        {
            "parentId": "370100",
            "cityId": "370126",
            "spell": "shx",
            "city": "商河县"
        },
        {
            "parentId": "370100",
            "cityId": "370181",
            "spell": "zqs",
            "city": "章丘市"
        },
        {
            "parentId": "370000",
            "cityId": "370200",
            "spell": "qds",
            "city": "青岛市"
        },
        {
            "parentId": "370200",
            "cityId": "370201",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "370200",
            "cityId": "370202",
            "spell": "snq",
            "city": "市南区"
        },
        {
            "parentId": "370200",
            "cityId": "370203",
            "spell": "sbq",
            "city": "市北区"
        },
        {
            "parentId": "370200",
            "cityId": "370211",
            "spell": "hdq",
            "city": "黄岛区"
        },
        {
            "parentId": "370200",
            "cityId": "370212",
            "spell": "lsq",
            "city": "崂山区"
        },
        {
            "parentId": "370200",
            "cityId": "370213",
            "spell": "lcq",
            "city": "李沧区"
        },
        {
            "parentId": "370200",
            "cityId": "370214",
            "spell": "cyq",
            "city": "城阳区"
        },
        {
            "parentId": "370200",
            "cityId": "370281",
            "spell": "jzs",
            "city": "胶州市"
        },
        {
            "parentId": "370200",
            "cityId": "370282",
            "spell": "jms",
            "city": "即墨市"
        },
        {
            "parentId": "370200",
            "cityId": "370283",
            "spell": "pds",
            "city": "平度市"
        },
        {
            "parentId": "370200",
            "cityId": "370285",
            "spell": "lxs",
            "city": "莱西市"
        },
        {
            "parentId": "370000",
            "cityId": "370300",
            "spell": "zbs",
            "city": "淄博市"
        },
        {
            "parentId": "370300",
            "cityId": "370301",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "370300",
            "cityId": "370302",
            "spell": "zcq",
            "city": "淄川区"
        },
        {
            "parentId": "370300",
            "cityId": "370303",
            "spell": "zdq",
            "city": "张店区"
        },
        {
            "parentId": "370300",
            "cityId": "370304",
            "spell": "bsq",
            "city": "博山区"
        },
        {
            "parentId": "370300",
            "cityId": "370305",
            "spell": "lzq",
            "city": "临淄区"
        },
        {
            "parentId": "370300",
            "cityId": "370306",
            "spell": "zcq",
            "city": "周村区"
        },
        {
            "parentId": "370300",
            "cityId": "370321",
            "spell": "htx",
            "city": "桓台县"
        },
        {
            "parentId": "370300",
            "cityId": "370322",
            "spell": "gqx",
            "city": "高青县"
        },
        {
            "parentId": "370300",
            "cityId": "370323",
            "spell": "yyx",
            "city": "沂源县"
        },
        {
            "parentId": "370000",
            "cityId": "370400",
            "spell": "zzs",
            "city": "枣庄市"
        },
        {
            "parentId": "370400",
            "cityId": "370401",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "370400",
            "cityId": "370402",
            "spell": "szq",
            "city": "市中区"
        },
        {
            "parentId": "370400",
            "cityId": "370403",
            "spell": "xcq",
            "city": "薛城区"
        },
        {
            "parentId": "370400",
            "cityId": "370404",
            "spell": "ycq",
            "city": "峄城区"
        },
        {
            "parentId": "370400",
            "cityId": "370405",
            "spell": "tezq",
            "city": "台儿庄区"
        },
        {
            "parentId": "370400",
            "cityId": "370406",
            "spell": "stq",
            "city": "山亭区"
        },
        {
            "parentId": "370400",
            "cityId": "370481",
            "spell": "tzs",
            "city": "滕州市"
        },
        {
            "parentId": "370000",
            "cityId": "370500",
            "spell": "dys",
            "city": "东营市"
        },
        {
            "parentId": "370500",
            "cityId": "370501",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "370500",
            "cityId": "370502",
            "spell": "dyq",
            "city": "东营区"
        },
        {
            "parentId": "370500",
            "cityId": "370503",
            "spell": "hkq",
            "city": "河口区"
        },
        {
            "parentId": "370500",
            "cityId": "370521",
            "spell": "klx",
            "city": "垦利县"
        },
        {
            "parentId": "370500",
            "cityId": "370522",
            "spell": "ljx",
            "city": "利津县"
        },
        {
            "parentId": "370500",
            "cityId": "370523",
            "spell": "grx",
            "city": "广饶县"
        },
        {
            "parentId": "370000",
            "cityId": "370600",
            "spell": "yts",
            "city": "烟台市"
        },
        {
            "parentId": "370600",
            "cityId": "370601",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "370600",
            "cityId": "370602",
            "spell": "zfq",
            "city": "芝罘区"
        },
        {
            "parentId": "370600",
            "cityId": "370611",
            "spell": "fsq",
            "city": "福山区"
        },
        {
            "parentId": "370600",
            "cityId": "370612",
            "spell": "mpq",
            "city": "牟平区"
        },
        {
            "parentId": "370600",
            "cityId": "370613",
            "spell": "lsq",
            "city": "莱山区"
        },
        {
            "parentId": "370600",
            "cityId": "370634",
            "spell": "cdx",
            "city": "长岛县"
        },
        {
            "parentId": "370600",
            "cityId": "370681",
            "spell": "lks",
            "city": "龙口市"
        },
        {
            "parentId": "370600",
            "cityId": "370682",
            "spell": "lys",
            "city": "莱阳市"
        },
        {
            "parentId": "370600",
            "cityId": "370683",
            "spell": "lzs",
            "city": "莱州市"
        },
        {
            "parentId": "370600",
            "cityId": "370684",
            "spell": "pls",
            "city": "蓬莱市"
        },
        {
            "parentId": "370600",
            "cityId": "370685",
            "spell": "zys",
            "city": "招远市"
        },
        {
            "parentId": "370600",
            "cityId": "370686",
            "spell": "qxs",
            "city": "栖霞市"
        },
        {
            "parentId": "370600",
            "cityId": "370687",
            "spell": "hys",
            "city": "海阳市"
        },
        {
            "parentId": "370000",
            "cityId": "370700",
            "spell": "wfs",
            "city": "潍坊市"
        },
        {
            "parentId": "370700",
            "cityId": "370701",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "370700",
            "cityId": "370702",
            "spell": "wcq",
            "city": "潍城区"
        },
        {
            "parentId": "370700",
            "cityId": "370703",
            "spell": "htq",
            "city": "寒亭区"
        },
        {
            "parentId": "370700",
            "cityId": "370704",
            "spell": "fzq",
            "city": "坊子区"
        },
        {
            "parentId": "370700",
            "cityId": "370705",
            "spell": "kwq",
            "city": "奎文区"
        },
        {
            "parentId": "370700",
            "cityId": "370724",
            "spell": "lqx",
            "city": "临朐县"
        },
        {
            "parentId": "370700",
            "cityId": "370725",
            "spell": "clx",
            "city": "昌乐县"
        },
        {
            "parentId": "370700",
            "cityId": "370781",
            "spell": "qzs",
            "city": "青州市"
        },
        {
            "parentId": "370700",
            "cityId": "370782",
            "spell": "zcs",
            "city": "诸城市"
        },
        {
            "parentId": "370700",
            "cityId": "370783",
            "spell": "sgs",
            "city": "寿光市"
        },
        {
            "parentId": "370700",
            "cityId": "370784",
            "spell": "aqs",
            "city": "安丘市"
        },
        {
            "parentId": "370700",
            "cityId": "370785",
            "spell": "gms",
            "city": "高密市"
        },
        {
            "parentId": "370700",
            "cityId": "370786",
            "spell": "cys",
            "city": "昌邑市"
        },
        {
            "parentId": "370000",
            "cityId": "370800",
            "spell": "jns",
            "city": "济宁市"
        },
        {
            "parentId": "370800",
            "cityId": "370801",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "370800",
            "cityId": "370802",
            "spell": "szq",
            "city": "市中区"
        },
        {
            "parentId": "370800",
            "cityId": "370811",
            "spell": "rcq",
            "city": "任城区"
        },
        {
            "parentId": "370800",
            "cityId": "370826",
            "spell": "wsx",
            "city": "微山县"
        },
        {
            "parentId": "370800",
            "cityId": "370827",
            "spell": "ytx",
            "city": "鱼台县"
        },
        {
            "parentId": "370800",
            "cityId": "370828",
            "spell": "jxx",
            "city": "金乡县"
        },
        {
            "parentId": "370800",
            "cityId": "370829",
            "spell": "jxx",
            "city": "嘉祥县"
        },
        {
            "parentId": "370800",
            "cityId": "370830",
            "spell": "wsx",
            "city": "汶上县"
        },
        {
            "parentId": "370800",
            "cityId": "370831",
            "spell": "ssx",
            "city": "泗水县"
        },
        {
            "parentId": "370800",
            "cityId": "370832",
            "spell": "lsx",
            "city": "梁山县"
        },
        {
            "parentId": "370800",
            "cityId": "370881",
            "spell": "qfs",
            "city": "曲阜市"
        },
        {
            "parentId": "370800",
            "cityId": "370882",
            "spell": "yzs",
            "city": "兖州市"
        },
        {
            "parentId": "370800",
            "cityId": "370883",
            "spell": "zcs",
            "city": "邹城市"
        },
        {
            "parentId": "370000",
            "cityId": "370900",
            "spell": "tas",
            "city": "泰安市"
        },
        {
            "parentId": "370900",
            "cityId": "370901",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "370900",
            "cityId": "370902",
            "spell": "tsq",
            "city": "泰山区"
        },
        {
            "parentId": "370900",
            "cityId": "370911",
            "spell": "dyq",
            "city": "岱岳区"
        },
        {
            "parentId": "370900",
            "cityId": "370921",
            "spell": "nyx",
            "city": "宁阳县"
        },
        {
            "parentId": "370900",
            "cityId": "370923",
            "spell": "dpx",
            "city": "东平县"
        },
        {
            "parentId": "370900",
            "cityId": "370982",
            "spell": "xts",
            "city": "新泰市"
        },
        {
            "parentId": "370900",
            "cityId": "370983",
            "spell": "fcs",
            "city": "肥城市"
        },
        {
            "parentId": "370000",
            "cityId": "371000",
            "spell": "whs",
            "city": "威海市"
        },
        {
            "parentId": "371000",
            "cityId": "371001",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "371000",
            "cityId": "371002",
            "spell": "hcq",
            "city": "环翠区"
        },
        {
            "parentId": "371000",
            "cityId": "371081",
            "spell": "wds",
            "city": "文登市"
        },
        {
            "parentId": "371000",
            "cityId": "371082",
            "spell": "rcs",
            "city": "荣成市"
        },
        {
            "parentId": "371000",
            "cityId": "371083",
            "spell": "rss",
            "city": "乳山市"
        },
        {
            "parentId": "370000",
            "cityId": "371100",
            "spell": "rzs",
            "city": "日照市"
        },
        {
            "parentId": "371100",
            "cityId": "371101",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "371100",
            "cityId": "371102",
            "spell": "dgq",
            "city": "东港区"
        },
        {
            "parentId": "371100",
            "cityId": "371103",
            "spell": "lsq",
            "city": "岚山区"
        },
        {
            "parentId": "371100",
            "cityId": "371121",
            "spell": "wlx",
            "city": "五莲县"
        },
        {
            "parentId": "371100",
            "cityId": "371122",
            "spell": "jx",
            "city": "莒县"
        },
        {
            "parentId": "370000",
            "cityId": "371200",
            "spell": "lws",
            "city": "莱芜市"
        },
        {
            "parentId": "371200",
            "cityId": "371201",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "371200",
            "cityId": "371202",
            "spell": "lcq",
            "city": "莱城区"
        },
        {
            "parentId": "371200",
            "cityId": "371203",
            "spell": "gcq",
            "city": "钢城区"
        },
        {
            "parentId": "370000",
            "cityId": "371300",
            "spell": "lys",
            "city": "临沂市"
        },
        {
            "parentId": "371300",
            "cityId": "371301",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "371300",
            "cityId": "371302",
            "spell": "lsq",
            "city": "兰山区"
        },
        {
            "parentId": "371300",
            "cityId": "371311",
            "spell": "lzq",
            "city": "罗庄区"
        },
        {
            "parentId": "371300",
            "cityId": "371312",
            "spell": "hdq",
            "city": "河东区"
        },
        {
            "parentId": "371300",
            "cityId": "371321",
            "spell": "ynx",
            "city": "沂南县"
        },
        {
            "parentId": "371300",
            "cityId": "371322",
            "spell": "tcx",
            "city": "郯城县"
        },
        {
            "parentId": "371300",
            "cityId": "371323",
            "spell": "ysx",
            "city": "沂水县"
        },
        {
            "parentId": "371300",
            "cityId": "371324",
            "spell": "csx",
            "city": "苍山县"
        },
        {
            "parentId": "371300",
            "cityId": "371325",
            "spell": "fx",
            "city": "费县"
        },
        {
            "parentId": "371300",
            "cityId": "371326",
            "spell": "pyx",
            "city": "平邑县"
        },
        {
            "parentId": "371300",
            "cityId": "371327",
            "spell": "jnx",
            "city": "莒南县"
        },
        {
            "parentId": "371300",
            "cityId": "371328",
            "spell": "myx",
            "city": "蒙阴县"
        },
        {
            "parentId": "371300",
            "cityId": "371329",
            "spell": "lsx",
            "city": "临沭县"
        },
        {
            "parentId": "370000",
            "cityId": "371400",
            "spell": "dzs",
            "city": "德州市"
        },
        {
            "parentId": "371400",
            "cityId": "371401",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "371400",
            "cityId": "371402",
            "spell": "dcq",
            "city": "德城区"
        },
        {
            "parentId": "371400",
            "cityId": "371421",
            "spell": "lx",
            "city": "陵县"
        },
        {
            "parentId": "371400",
            "cityId": "371422",
            "spell": "njx",
            "city": "宁津县"
        },
        {
            "parentId": "371400",
            "cityId": "371423",
            "spell": "qyx",
            "city": "庆云县"
        },
        {
            "parentId": "371400",
            "cityId": "371424",
            "spell": "lyx",
            "city": "临邑县"
        },
        {
            "parentId": "371400",
            "cityId": "371425",
            "spell": "qhx",
            "city": "齐河县"
        },
        {
            "parentId": "371400",
            "cityId": "371426",
            "spell": "pyx",
            "city": "平原县"
        },
        {
            "parentId": "371400",
            "cityId": "371427",
            "spell": "xjx",
            "city": "夏津县"
        },
        {
            "parentId": "371400",
            "cityId": "371428",
            "spell": "wcx",
            "city": "武城县"
        },
        {
            "parentId": "371400",
            "cityId": "371481",
            "spell": "lls",
            "city": "乐陵市"
        },
        {
            "parentId": "371400",
            "cityId": "371482",
            "spell": "ycs",
            "city": "禹城市"
        },
        {
            "parentId": "370000",
            "cityId": "371500",
            "spell": "lcs",
            "city": "聊城市"
        },
        {
            "parentId": "371500",
            "cityId": "371501",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "371500",
            "cityId": "371502",
            "spell": "dcfq",
            "city": "东昌府区"
        },
        {
            "parentId": "371500",
            "cityId": "371521",
            "spell": "ygx",
            "city": "阳谷县"
        },
        {
            "parentId": "371500",
            "cityId": "371522",
            "spell": "sx",
            "city": "莘县"
        },
        {
            "parentId": "371500",
            "cityId": "371523",
            "spell": "cpx",
            "city": "茌平县"
        },
        {
            "parentId": "371500",
            "cityId": "371524",
            "spell": "dex",
            "city": "东阿县"
        },
        {
            "parentId": "371500",
            "cityId": "371525",
            "spell": "gx",
            "city": "冠县"
        },
        {
            "parentId": "371500",
            "cityId": "371526",
            "spell": "gtx",
            "city": "高唐县"
        },
        {
            "parentId": "371500",
            "cityId": "371581",
            "spell": "lqs",
            "city": "临清市"
        },
        {
            "parentId": "370000",
            "cityId": "371600",
            "spell": "bzs",
            "city": "滨州市"
        },
        {
            "parentId": "371600",
            "cityId": "371601",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "371600",
            "cityId": "371602",
            "spell": "bcq",
            "city": "滨城区"
        },
        {
            "parentId": "371600",
            "cityId": "371621",
            "spell": "hmx",
            "city": "惠民县"
        },
        {
            "parentId": "371600",
            "cityId": "371622",
            "spell": "yxx",
            "city": "阳信县"
        },
        {
            "parentId": "371600",
            "cityId": "371623",
            "spell": "wdx",
            "city": "无棣县"
        },
        {
            "parentId": "371600",
            "cityId": "371624",
            "spell": "zhx",
            "city": "沾化县"
        },
        {
            "parentId": "371600",
            "cityId": "371625",
            "spell": "bxx",
            "city": "博兴县"
        },
        {
            "parentId": "371600",
            "cityId": "371626",
            "spell": "zpx",
            "city": "邹平县"
        },
        {
            "parentId": "370000",
            "cityId": "371700",
            "spell": "hzs",
            "city": "菏泽市"
        },
        {
            "parentId": "371700",
            "cityId": "371701",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "371700",
            "cityId": "371702",
            "spell": "mdq",
            "city": "牡丹区"
        },
        {
            "parentId": "371700",
            "cityId": "371721",
            "spell": "cx",
            "city": "曹县"
        },
        {
            "parentId": "371700",
            "cityId": "371722",
            "spell": "dx",
            "city": "单县"
        },
        {
            "parentId": "371700",
            "cityId": "371723",
            "spell": "cwx",
            "city": "成武县"
        },
        {
            "parentId": "371700",
            "cityId": "371724",
            "spell": "jyx",
            "city": "巨野县"
        },
        {
            "parentId": "371700",
            "cityId": "371725",
            "spell": "ycx",
            "city": "郓城县"
        },
        {
            "parentId": "371700",
            "cityId": "371726",
            "spell": "jcx",
            "city": "鄄城县"
        },
        {
            "parentId": "371700",
            "cityId": "371727",
            "spell": "dtx",
            "city": "定陶县"
        },
        {
            "parentId": "371700",
            "cityId": "371728",
            "spell": "dmx",
            "city": "东明县"
        },
        {
            "parentId": "0",
            "cityId": "410000",
            "spell": "hns",
            "city": "河南省"
        },
        {
            "parentId": "410000",
            "cityId": "410100",
            "spell": "zzs",
            "city": "郑州市"
        },
        {
            "parentId": "410100",
            "cityId": "410101",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "410100",
            "cityId": "410102",
            "spell": "zyq",
            "city": "中原区"
        },
        {
            "parentId": "410100",
            "cityId": "410103",
            "spell": "eqq",
            "city": "二七区"
        },
        {
            "parentId": "410100",
            "cityId": "410104",
            "spell": "gchzq",
            "city": "管城回族区"
        },
        {
            "parentId": "410100",
            "cityId": "410105",
            "spell": "jsq",
            "city": "金水区"
        },
        {
            "parentId": "410100",
            "cityId": "410106",
            "spell": "sjq",
            "city": "上街区"
        },
        {
            "parentId": "410100",
            "cityId": "410108",
            "spell": "hjq",
            "city": "惠济区"
        },
        {
            "parentId": "410100",
            "cityId": "410122",
            "spell": "zmx",
            "city": "中牟县"
        },
        {
            "parentId": "410100",
            "cityId": "410181",
            "spell": "gys",
            "city": "巩义市"
        },
        {
            "parentId": "410100",
            "cityId": "410182",
            "spell": "xys",
            "city": "荥阳市"
        },
        {
            "parentId": "410100",
            "cityId": "410183",
            "spell": "xms",
            "city": "新密市"
        },
        {
            "parentId": "410100",
            "cityId": "410184",
            "spell": "xzs",
            "city": "新郑市"
        },
        {
            "parentId": "410100",
            "cityId": "410185",
            "spell": "dfs",
            "city": "登封市"
        },
        {
            "parentId": "410000",
            "cityId": "410200",
            "spell": "kfs",
            "city": "开封市"
        },
        {
            "parentId": "410200",
            "cityId": "410201",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "410200",
            "cityId": "410202",
            "spell": "ltq",
            "city": "龙亭区"
        },
        {
            "parentId": "410200",
            "cityId": "410203",
            "spell": "shhzq",
            "city": "顺河回族区"
        },
        {
            "parentId": "410200",
            "cityId": "410204",
            "spell": "glq",
            "city": "鼓楼区"
        },
        {
            "parentId": "410200",
            "cityId": "410205",
            "spell": "ywtq",
            "city": "禹王台区"
        },
        {
            "parentId": "410200",
            "cityId": "410211",
            "spell": "jmq",
            "city": "金明区"
        },
        {
            "parentId": "410200",
            "cityId": "410221",
            "spell": "qx",
            "city": "杞县"
        },
        {
            "parentId": "410200",
            "cityId": "410222",
            "spell": "txx",
            "city": "通许县"
        },
        {
            "parentId": "410200",
            "cityId": "410223",
            "spell": "wsx",
            "city": "尉氏县"
        },
        {
            "parentId": "410200",
            "cityId": "410224",
            "spell": "kfx",
            "city": "开封县"
        },
        {
            "parentId": "410200",
            "cityId": "410225",
            "spell": "lkx",
            "city": "兰考县"
        },
        {
            "parentId": "410000",
            "cityId": "410300",
            "spell": "lys",
            "city": "洛阳市"
        },
        {
            "parentId": "410300",
            "cityId": "410301",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "410300",
            "cityId": "410302",
            "spell": "lcq",
            "city": "老城区"
        },
        {
            "parentId": "410300",
            "cityId": "410303",
            "spell": "xgq",
            "city": "西工区"
        },
        {
            "parentId": "410300",
            "cityId": "410304",
            "spell": "chhzq",
            "city": "瀍河回族区"
        },
        {
            "parentId": "410300",
            "cityId": "410305",
            "spell": "jxq",
            "city": "涧西区"
        },
        {
            "parentId": "410300",
            "cityId": "410306",
            "spell": "jlq",
            "city": "吉利区"
        },
        {
            "parentId": "410300",
            "cityId": "410311",
            "spell": "llq",
            "city": "洛龙区"
        },
        {
            "parentId": "410300",
            "cityId": "410322",
            "spell": "mjx",
            "city": "孟津县"
        },
        {
            "parentId": "410300",
            "cityId": "410323",
            "spell": "xax",
            "city": "新安县"
        },
        {
            "parentId": "410300",
            "cityId": "410324",
            "spell": "lcx",
            "city": "栾川县"
        },
        {
            "parentId": "410300",
            "cityId": "410325",
            "spell": "sx",
            "city": "嵩县"
        },
        {
            "parentId": "410300",
            "cityId": "410326",
            "spell": "ryx",
            "city": "汝阳县"
        },
        {
            "parentId": "410300",
            "cityId": "410327",
            "spell": "yyx",
            "city": "宜阳县"
        },
        {
            "parentId": "410300",
            "cityId": "410328",
            "spell": "lnx",
            "city": "洛宁县"
        },
        {
            "parentId": "410300",
            "cityId": "410329",
            "spell": "ycx",
            "city": "伊川县"
        },
        {
            "parentId": "410300",
            "cityId": "410381",
            "spell": "yss",
            "city": "偃师市"
        },
        {
            "parentId": "410000",
            "cityId": "410400",
            "spell": "pdss",
            "city": "平顶山市"
        },
        {
            "parentId": "410400",
            "cityId": "410401",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "410400",
            "cityId": "410402",
            "spell": "xhq",
            "city": "新华区"
        },
        {
            "parentId": "410400",
            "cityId": "410403",
            "spell": "wdq",
            "city": "卫东区"
        },
        {
            "parentId": "410400",
            "cityId": "410404",
            "spell": "slq",
            "city": "石龙区"
        },
        {
            "parentId": "410400",
            "cityId": "410411",
            "spell": "zhq",
            "city": "湛河区"
        },
        {
            "parentId": "410400",
            "cityId": "410421",
            "spell": "bfx",
            "city": "宝丰县"
        },
        {
            "parentId": "410400",
            "cityId": "410422",
            "spell": "yx",
            "city": "叶县"
        },
        {
            "parentId": "410400",
            "cityId": "410423",
            "spell": "lsx",
            "city": "鲁山县"
        },
        {
            "parentId": "410400",
            "cityId": "410425",
            "spell": "jx",
            "city": "郏县"
        },
        {
            "parentId": "410400",
            "cityId": "410481",
            "spell": "wgs",
            "city": "舞钢市"
        },
        {
            "parentId": "410400",
            "cityId": "410482",
            "spell": "rzs",
            "city": "汝州市"
        },
        {
            "parentId": "410000",
            "cityId": "410500",
            "spell": "ays",
            "city": "安阳市"
        },
        {
            "parentId": "410500",
            "cityId": "410501",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "410500",
            "cityId": "410502",
            "spell": "wfq",
            "city": "文峰区"
        },
        {
            "parentId": "410500",
            "cityId": "410503",
            "spell": "bgq",
            "city": "北关区"
        },
        {
            "parentId": "410500",
            "cityId": "410505",
            "spell": "ydq",
            "city": "殷都区"
        },
        {
            "parentId": "410500",
            "cityId": "410506",
            "spell": "laq",
            "city": "龙安区"
        },
        {
            "parentId": "410500",
            "cityId": "410522",
            "spell": "ayx",
            "city": "安阳县"
        },
        {
            "parentId": "410500",
            "cityId": "410523",
            "spell": "tyx",
            "city": "汤阴县"
        },
        {
            "parentId": "410500",
            "cityId": "410526",
            "spell": "hx",
            "city": "滑县"
        },
        {
            "parentId": "410500",
            "cityId": "410527",
            "spell": "nhx",
            "city": "内黄县"
        },
        {
            "parentId": "410500",
            "cityId": "410581",
            "spell": "lzs",
            "city": "林州市"
        },
        {
            "parentId": "410000",
            "cityId": "410600",
            "spell": "hbs",
            "city": "鹤壁市"
        },
        {
            "parentId": "410600",
            "cityId": "410601",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "410600",
            "cityId": "410602",
            "spell": "hsq",
            "city": "鹤山区"
        },
        {
            "parentId": "410600",
            "cityId": "410603",
            "spell": "scq",
            "city": "山城区"
        },
        {
            "parentId": "410600",
            "cityId": "410611",
            "spell": "qbq",
            "city": "淇滨区"
        },
        {
            "parentId": "410600",
            "cityId": "410621",
            "spell": "jx",
            "city": "浚县"
        },
        {
            "parentId": "410600",
            "cityId": "410622",
            "spell": "qx",
            "city": "淇县"
        },
        {
            "parentId": "410000",
            "cityId": "410700",
            "spell": "xxs",
            "city": "新乡市"
        },
        {
            "parentId": "410700",
            "cityId": "410701",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "410700",
            "cityId": "410702",
            "spell": "hqq",
            "city": "红旗区"
        },
        {
            "parentId": "410700",
            "cityId": "410703",
            "spell": "wbq",
            "city": "卫滨区"
        },
        {
            "parentId": "410700",
            "cityId": "410704",
            "spell": "fqq",
            "city": "凤泉区"
        },
        {
            "parentId": "410700",
            "cityId": "410711",
            "spell": "myq",
            "city": "牧野区"
        },
        {
            "parentId": "410700",
            "cityId": "410721",
            "spell": "xxx",
            "city": "新乡县"
        },
        {
            "parentId": "410700",
            "cityId": "410724",
            "spell": "hjx",
            "city": "获嘉县"
        },
        {
            "parentId": "410700",
            "cityId": "410725",
            "spell": "yyx",
            "city": "原阳县"
        },
        {
            "parentId": "410700",
            "cityId": "410726",
            "spell": "yjx",
            "city": "延津县"
        },
        {
            "parentId": "410700",
            "cityId": "410727",
            "spell": "fqx",
            "city": "封丘县"
        },
        {
            "parentId": "410700",
            "cityId": "410728",
            "spell": "cyx",
            "city": "长垣县"
        },
        {
            "parentId": "410700",
            "cityId": "410781",
            "spell": "whs",
            "city": "卫辉市"
        },
        {
            "parentId": "410700",
            "cityId": "410782",
            "spell": "hxs",
            "city": "辉县市"
        },
        {
            "parentId": "410000",
            "cityId": "410800",
            "spell": "jzs",
            "city": "焦作市"
        },
        {
            "parentId": "410800",
            "cityId": "410801",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "410800",
            "cityId": "410802",
            "spell": "jfq",
            "city": "解放区"
        },
        {
            "parentId": "410800",
            "cityId": "410803",
            "spell": "zzq",
            "city": "中站区"
        },
        {
            "parentId": "410800",
            "cityId": "410804",
            "spell": "mcq",
            "city": "马村区"
        },
        {
            "parentId": "410800",
            "cityId": "410811",
            "spell": "syq",
            "city": "山阳区"
        },
        {
            "parentId": "410800",
            "cityId": "410821",
            "spell": "xwx",
            "city": "修武县"
        },
        {
            "parentId": "410800",
            "cityId": "410822",
            "spell": "bax",
            "city": "博爱县"
        },
        {
            "parentId": "410800",
            "cityId": "410823",
            "spell": "wzx",
            "city": "武陟县"
        },
        {
            "parentId": "410800",
            "cityId": "410825",
            "spell": "wx",
            "city": "温县"
        },
        {
            "parentId": "410800",
            "cityId": "410882",
            "spell": "qys",
            "city": "沁阳市"
        },
        {
            "parentId": "410800",
            "cityId": "410883",
            "spell": "mzs",
            "city": "孟州市"
        },
        {
            "parentId": "410000",
            "cityId": "410900",
            "spell": "pys",
            "city": "濮阳市"
        },
        {
            "parentId": "410900",
            "cityId": "410901",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "410900",
            "cityId": "410902",
            "spell": "hlq",
            "city": "华龙区"
        },
        {
            "parentId": "410900",
            "cityId": "410922",
            "spell": "qfx",
            "city": "清丰县"
        },
        {
            "parentId": "410900",
            "cityId": "410923",
            "spell": "nlx",
            "city": "南乐县"
        },
        {
            "parentId": "410900",
            "cityId": "410926",
            "spell": "fx",
            "city": "范县"
        },
        {
            "parentId": "410900",
            "cityId": "410927",
            "spell": "tqx",
            "city": "台前县"
        },
        {
            "parentId": "410900",
            "cityId": "410928",
            "spell": "pyx",
            "city": "濮阳县"
        },
        {
            "parentId": "410000",
            "cityId": "411000",
            "spell": "xcs",
            "city": "许昌市"
        },
        {
            "parentId": "411000",
            "cityId": "411001",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "411000",
            "cityId": "411002",
            "spell": "wdq",
            "city": "魏都区"
        },
        {
            "parentId": "411000",
            "cityId": "411023",
            "spell": "xcx",
            "city": "许昌县"
        },
        {
            "parentId": "411000",
            "cityId": "411024",
            "spell": "ylx",
            "city": "鄢陵县"
        },
        {
            "parentId": "411000",
            "cityId": "411025",
            "spell": "xcx",
            "city": "襄城县"
        },
        {
            "parentId": "411000",
            "cityId": "411081",
            "spell": "yzs",
            "city": "禹州市"
        },
        {
            "parentId": "411000",
            "cityId": "411082",
            "spell": "cgs",
            "city": "长葛市"
        },
        {
            "parentId": "410000",
            "cityId": "411100",
            "spell": "lhs",
            "city": "漯河市"
        },
        {
            "parentId": "411100",
            "cityId": "411101",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "411100",
            "cityId": "411102",
            "spell": "yhq",
            "city": "源汇区"
        },
        {
            "parentId": "411100",
            "cityId": "411103",
            "spell": "ycq",
            "city": "郾城区"
        },
        {
            "parentId": "411100",
            "cityId": "411104",
            "spell": "zlq",
            "city": "召陵区"
        },
        {
            "parentId": "411100",
            "cityId": "411121",
            "spell": "wyx",
            "city": "舞阳县"
        },
        {
            "parentId": "411100",
            "cityId": "411122",
            "spell": "lyx",
            "city": "临颍县"
        },
        {
            "parentId": "410000",
            "cityId": "411200",
            "spell": "smxs",
            "city": "三门峡市"
        },
        {
            "parentId": "411200",
            "cityId": "411201",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "411200",
            "cityId": "411202",
            "spell": "hbq",
            "city": "湖滨区"
        },
        {
            "parentId": "411200",
            "cityId": "411221",
            "spell": "mcx",
            "city": "渑池县"
        },
        {
            "parentId": "411200",
            "cityId": "411222",
            "spell": "sx",
            "city": "陕县"
        },
        {
            "parentId": "411200",
            "cityId": "411224",
            "spell": "lsx",
            "city": "卢氏县"
        },
        {
            "parentId": "411200",
            "cityId": "411281",
            "spell": "yms",
            "city": "义马市"
        },
        {
            "parentId": "411200",
            "cityId": "411282",
            "spell": "lbs",
            "city": "灵宝市"
        },
        {
            "parentId": "410000",
            "cityId": "411300",
            "spell": "nys",
            "city": "南阳市"
        },
        {
            "parentId": "411300",
            "cityId": "411301",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "411300",
            "cityId": "411302",
            "spell": "wcq",
            "city": "宛城区"
        },
        {
            "parentId": "411300",
            "cityId": "411303",
            "spell": "wlq",
            "city": "卧龙区"
        },
        {
            "parentId": "411300",
            "cityId": "411321",
            "spell": "nzx",
            "city": "南召县"
        },
        {
            "parentId": "411300",
            "cityId": "411322",
            "spell": "fcx",
            "city": "方城县"
        },
        {
            "parentId": "411300",
            "cityId": "411323",
            "spell": "xxx",
            "city": "西峡县"
        },
        {
            "parentId": "411300",
            "cityId": "411324",
            "spell": "zpx",
            "city": "镇平县"
        },
        {
            "parentId": "411300",
            "cityId": "411325",
            "spell": "nxx",
            "city": "内乡县"
        },
        {
            "parentId": "411300",
            "cityId": "411326",
            "spell": "xcx",
            "city": "淅川县"
        },
        {
            "parentId": "411300",
            "cityId": "411327",
            "spell": "sqx",
            "city": "社旗县"
        },
        {
            "parentId": "411300",
            "cityId": "411328",
            "spell": "thx",
            "city": "唐河县"
        },
        {
            "parentId": "411300",
            "cityId": "411329",
            "spell": "xyx",
            "city": "新野县"
        },
        {
            "parentId": "411300",
            "cityId": "411330",
            "spell": "tbx",
            "city": "桐柏县"
        },
        {
            "parentId": "411300",
            "cityId": "411381",
            "spell": "dzs",
            "city": "邓州市"
        },
        {
            "parentId": "410000",
            "cityId": "411400",
            "spell": "sqs",
            "city": "商丘市"
        },
        {
            "parentId": "411400",
            "cityId": "411401",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "411400",
            "cityId": "411402",
            "spell": "lyq",
            "city": "梁园区"
        },
        {
            "parentId": "411400",
            "cityId": "411403",
            "spell": "hyq",
            "city": "睢阳区"
        },
        {
            "parentId": "411400",
            "cityId": "411421",
            "spell": "mqx",
            "city": "民权县"
        },
        {
            "parentId": "411400",
            "cityId": "411422",
            "spell": "hx",
            "city": "睢县"
        },
        {
            "parentId": "411400",
            "cityId": "411423",
            "spell": "nlx",
            "city": "宁陵县"
        },
        {
            "parentId": "411400",
            "cityId": "411424",
            "spell": "zcx",
            "city": "柘城县"
        },
        {
            "parentId": "411400",
            "cityId": "411425",
            "spell": "ycx",
            "city": "虞城县"
        },
        {
            "parentId": "411400",
            "cityId": "411426",
            "spell": "xyx",
            "city": "夏邑县"
        },
        {
            "parentId": "411400",
            "cityId": "411481",
            "spell": "ycs",
            "city": "永城市"
        },
        {
            "parentId": "410000",
            "cityId": "411500",
            "spell": "xys",
            "city": "信阳市"
        },
        {
            "parentId": "411500",
            "cityId": "411501",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "411500",
            "cityId": "411502",
            "spell": "shq",
            "city": "浉河区"
        },
        {
            "parentId": "411500",
            "cityId": "411503",
            "spell": "pqq",
            "city": "平桥区"
        },
        {
            "parentId": "411500",
            "cityId": "411521",
            "spell": "lsx",
            "city": "罗山县"
        },
        {
            "parentId": "411500",
            "cityId": "411522",
            "spell": "gsx",
            "city": "光山县"
        },
        {
            "parentId": "411500",
            "cityId": "411523",
            "spell": "xx",
            "city": "新县"
        },
        {
            "parentId": "411500",
            "cityId": "411524",
            "spell": "scx",
            "city": "商城县"
        },
        {
            "parentId": "411500",
            "cityId": "411525",
            "spell": "gsx",
            "city": "固始县"
        },
        {
            "parentId": "411500",
            "cityId": "411526",
            "spell": "hcx",
            "city": "潢川县"
        },
        {
            "parentId": "411500",
            "cityId": "411527",
            "spell": "hbx",
            "city": "淮滨县"
        },
        {
            "parentId": "411500",
            "cityId": "411528",
            "spell": "xx",
            "city": "息县"
        },
        {
            "parentId": "410000",
            "cityId": "411600",
            "spell": "zks",
            "city": "周口市"
        },
        {
            "parentId": "411600",
            "cityId": "411601",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "411600",
            "cityId": "411602",
            "spell": "chq",
            "city": "川汇区"
        },
        {
            "parentId": "411600",
            "cityId": "411621",
            "spell": "fgx",
            "city": "扶沟县"
        },
        {
            "parentId": "411600",
            "cityId": "411622",
            "spell": "xhx",
            "city": "西华县"
        },
        {
            "parentId": "411600",
            "cityId": "411623",
            "spell": "ssx",
            "city": "商水县"
        },
        {
            "parentId": "411600",
            "cityId": "411624",
            "spell": "sqx",
            "city": "沈丘县"
        },
        {
            "parentId": "411600",
            "cityId": "411625",
            "spell": "dcx",
            "city": "郸城县"
        },
        {
            "parentId": "411600",
            "cityId": "411626",
            "spell": "hyx",
            "city": "淮阳县"
        },
        {
            "parentId": "411600",
            "cityId": "411627",
            "spell": "tkx",
            "city": "太康县"
        },
        {
            "parentId": "411600",
            "cityId": "411628",
            "spell": "lyx",
            "city": "鹿邑县"
        },
        {
            "parentId": "411600",
            "cityId": "411681",
            "spell": "xcs",
            "city": "项城市"
        },
        {
            "parentId": "410000",
            "cityId": "411700",
            "spell": "zmds",
            "city": "驻马店市"
        },
        {
            "parentId": "411700",
            "cityId": "411701",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "411700",
            "cityId": "411702",
            "spell": "ycq",
            "city": "驿城区"
        },
        {
            "parentId": "411700",
            "cityId": "411721",
            "spell": "xpx",
            "city": "西平县"
        },
        {
            "parentId": "411700",
            "cityId": "411722",
            "spell": "scx",
            "city": "上蔡县"
        },
        {
            "parentId": "411700",
            "cityId": "411723",
            "spell": "pyx",
            "city": "平舆县"
        },
        {
            "parentId": "411700",
            "cityId": "411724",
            "spell": "zyx",
            "city": "正阳县"
        },
        {
            "parentId": "411700",
            "cityId": "411725",
            "spell": "qsx",
            "city": "确山县"
        },
        {
            "parentId": "411700",
            "cityId": "411726",
            "spell": "byx",
            "city": "泌阳县"
        },
        {
            "parentId": "411700",
            "cityId": "411727",
            "spell": "rnx",
            "city": "汝南县"
        },
        {
            "parentId": "411700",
            "cityId": "411728",
            "spell": "spx",
            "city": "遂平县"
        },
        {
            "parentId": "411700",
            "cityId": "411729",
            "spell": "xcx",
            "city": "新蔡县"
        },
        {
            "parentId": "410000",
            "cityId": "419000",
            "spell": "szxxjxzqh",
            "city": "省直辖县级行政区划"
        },
        {
            "parentId": "419000",
            "cityId": "419001",
            "spell": "jys",
            "city": "济源市"
        },
        {
            "parentId": "0",
            "cityId": "420000",
            "spell": "hbs",
            "city": "湖北省"
        },
        {
            "parentId": "420000",
            "cityId": "420100",
            "spell": "whs",
            "city": "武汉市"
        },
        {
            "parentId": "420100",
            "cityId": "420101",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "420100",
            "cityId": "420102",
            "spell": "jaq",
            "city": "江岸区"
        },
        {
            "parentId": "420100",
            "cityId": "420103",
            "spell": "jhq",
            "city": "江汉区"
        },
        {
            "parentId": "420100",
            "cityId": "420104",
            "spell": "qkq",
            "city": "硚口区"
        },
        {
            "parentId": "420100",
            "cityId": "420105",
            "spell": "hyq",
            "city": "汉阳区"
        },
        {
            "parentId": "420100",
            "cityId": "420106",
            "spell": "wcq",
            "city": "武昌区"
        },
        {
            "parentId": "420100",
            "cityId": "420107",
            "spell": "qsq",
            "city": "青山区"
        },
        {
            "parentId": "420100",
            "cityId": "420111",
            "spell": "hsq",
            "city": "洪山区"
        },
        {
            "parentId": "420100",
            "cityId": "420112",
            "spell": "dxhq",
            "city": "东西湖区"
        },
        {
            "parentId": "420100",
            "cityId": "420113",
            "spell": "hnq",
            "city": "汉南区"
        },
        {
            "parentId": "420100",
            "cityId": "420114",
            "spell": "cdq",
            "city": "蔡甸区"
        },
        {
            "parentId": "420100",
            "cityId": "420115",
            "spell": "jxq",
            "city": "江夏区"
        },
        {
            "parentId": "420100",
            "cityId": "420116",
            "spell": "hbq",
            "city": "黄陂区"
        },
        {
            "parentId": "420100",
            "cityId": "420117",
            "spell": "xzq",
            "city": "新洲区"
        },
        {
            "parentId": "420000",
            "cityId": "420200",
            "spell": "hss",
            "city": "黄石市"
        },
        {
            "parentId": "420200",
            "cityId": "420201",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "420200",
            "cityId": "420202",
            "spell": "hsgq",
            "city": "黄石港区"
        },
        {
            "parentId": "420200",
            "cityId": "420203",
            "spell": "xssq",
            "city": "西塞山区"
        },
        {
            "parentId": "420200",
            "cityId": "420204",
            "spell": "xlq",
            "city": "下陆区"
        },
        {
            "parentId": "420200",
            "cityId": "420205",
            "spell": "tsq",
            "city": "铁山区"
        },
        {
            "parentId": "420200",
            "cityId": "420222",
            "spell": "yxx",
            "city": "阳新县"
        },
        {
            "parentId": "420200",
            "cityId": "420281",
            "spell": "dys",
            "city": "大冶市"
        },
        {
            "parentId": "420000",
            "cityId": "420300",
            "spell": "sys",
            "city": "十堰市"
        },
        {
            "parentId": "420300",
            "cityId": "420301",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "420300",
            "cityId": "420302",
            "spell": "mjq",
            "city": "茅箭区"
        },
        {
            "parentId": "420300",
            "cityId": "420303",
            "spell": "zwq",
            "city": "张湾区"
        },
        {
            "parentId": "420300",
            "cityId": "420321",
            "spell": "yx",
            "city": "郧县"
        },
        {
            "parentId": "420300",
            "cityId": "420322",
            "spell": "yxx",
            "city": "郧西县"
        },
        {
            "parentId": "420300",
            "cityId": "420323",
            "spell": "zsx",
            "city": "竹山县"
        },
        {
            "parentId": "420300",
            "cityId": "420324",
            "spell": "zxx",
            "city": "竹溪县"
        },
        {
            "parentId": "420300",
            "cityId": "420325",
            "spell": "fx",
            "city": "房县"
        },
        {
            "parentId": "420300",
            "cityId": "420381",
            "spell": "djks",
            "city": "丹江口市"
        },
        {
            "parentId": "420000",
            "cityId": "420500",
            "spell": "ycs",
            "city": "宜昌市"
        },
        {
            "parentId": "420500",
            "cityId": "420501",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "420500",
            "cityId": "420502",
            "spell": "xlq",
            "city": "西陵区"
        },
        {
            "parentId": "420500",
            "cityId": "420503",
            "spell": "wjgq",
            "city": "伍家岗区"
        },
        {
            "parentId": "420500",
            "cityId": "420504",
            "spell": "djq",
            "city": "点军区"
        },
        {
            "parentId": "420500",
            "cityId": "420505",
            "spell": "xtq",
            "city": "猇亭区"
        },
        {
            "parentId": "420500",
            "cityId": "420506",
            "spell": "ylq",
            "city": "夷陵区"
        },
        {
            "parentId": "420500",
            "cityId": "420525",
            "spell": "yax",
            "city": "远安县"
        },
        {
            "parentId": "420500",
            "cityId": "420526",
            "spell": "xsx",
            "city": "兴山县"
        },
        {
            "parentId": "420500",
            "cityId": "420527",
            "spell": "zgx",
            "city": "秭归县"
        },
        {
            "parentId": "420500",
            "cityId": "420528",
            "spell": "cytjzzzx",
            "city": "长阳土家族自治县"
        },
        {
            "parentId": "420500",
            "cityId": "420529",
            "spell": "wftjzzzx",
            "city": "五峰土家族自治县"
        },
        {
            "parentId": "420500",
            "cityId": "420581",
            "spell": "yds",
            "city": "宜都市"
        },
        {
            "parentId": "420500",
            "cityId": "420582",
            "spell": "dys",
            "city": "当阳市"
        },
        {
            "parentId": "420500",
            "cityId": "420583",
            "spell": "zjs",
            "city": "枝江市"
        },
        {
            "parentId": "420000",
            "cityId": "420600",
            "spell": "xys",
            "city": "襄阳市"
        },
        {
            "parentId": "420600",
            "cityId": "420601",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "420600",
            "cityId": "420602",
            "spell": "xcq",
            "city": "襄城区"
        },
        {
            "parentId": "420600",
            "cityId": "420606",
            "spell": "fcq",
            "city": "樊城区"
        },
        {
            "parentId": "420600",
            "cityId": "420607",
            "spell": "xzq",
            "city": "襄州区"
        },
        {
            "parentId": "420600",
            "cityId": "420624",
            "spell": "nzx",
            "city": "南漳县"
        },
        {
            "parentId": "420600",
            "cityId": "420625",
            "spell": "gcx",
            "city": "谷城县"
        },
        {
            "parentId": "420600",
            "cityId": "420626",
            "spell": "bkx",
            "city": "保康县"
        },
        {
            "parentId": "420600",
            "cityId": "420682",
            "spell": "lhks",
            "city": "老河口市"
        },
        {
            "parentId": "420600",
            "cityId": "420683",
            "spell": "zys",
            "city": "枣阳市"
        },
        {
            "parentId": "420600",
            "cityId": "420684",
            "spell": "ycs",
            "city": "宜城市"
        },
        {
            "parentId": "420000",
            "cityId": "420700",
            "spell": "ezs",
            "city": "鄂州市"
        },
        {
            "parentId": "420700",
            "cityId": "420701",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "420700",
            "cityId": "420702",
            "spell": "lzhq",
            "city": "梁子湖区"
        },
        {
            "parentId": "420700",
            "cityId": "420703",
            "spell": "hrq",
            "city": "华容区"
        },
        {
            "parentId": "420700",
            "cityId": "420704",
            "spell": "ecq",
            "city": "鄂城区"
        },
        {
            "parentId": "420000",
            "cityId": "420800",
            "spell": "jms",
            "city": "荆门市"
        },
        {
            "parentId": "420800",
            "cityId": "420801",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "420800",
            "cityId": "420802",
            "spell": "dbq",
            "city": "东宝区"
        },
        {
            "parentId": "420800",
            "cityId": "420804",
            "spell": "ddq",
            "city": "掇刀区"
        },
        {
            "parentId": "420800",
            "cityId": "420821",
            "spell": "jsx",
            "city": "京山县"
        },
        {
            "parentId": "420800",
            "cityId": "420822",
            "spell": "syx",
            "city": "沙洋县"
        },
        {
            "parentId": "420800",
            "cityId": "420881",
            "spell": "zxs",
            "city": "钟祥市"
        },
        {
            "parentId": "420000",
            "cityId": "420900",
            "spell": "xgs",
            "city": "孝感市"
        },
        {
            "parentId": "420900",
            "cityId": "420901",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "420900",
            "cityId": "420902",
            "spell": "xnq",
            "city": "孝南区"
        },
        {
            "parentId": "420900",
            "cityId": "420921",
            "spell": "xcx",
            "city": "孝昌县"
        },
        {
            "parentId": "420900",
            "cityId": "420922",
            "spell": "dwx",
            "city": "大悟县"
        },
        {
            "parentId": "420900",
            "cityId": "420923",
            "spell": "ymx",
            "city": "云梦县"
        },
        {
            "parentId": "420900",
            "cityId": "420981",
            "spell": "ycs",
            "city": "应城市"
        },
        {
            "parentId": "420900",
            "cityId": "420982",
            "spell": "als",
            "city": "安陆市"
        },
        {
            "parentId": "420900",
            "cityId": "420984",
            "spell": "hcs",
            "city": "汉川市"
        },
        {
            "parentId": "420000",
            "cityId": "421000",
            "spell": "jzs",
            "city": "荆州市"
        },
        {
            "parentId": "421000",
            "cityId": "421001",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "421000",
            "cityId": "421002",
            "spell": "ssq",
            "city": "沙市区"
        },
        {
            "parentId": "421000",
            "cityId": "421003",
            "spell": "jzq",
            "city": "荆州区"
        },
        {
            "parentId": "421000",
            "cityId": "421022",
            "spell": "gax",
            "city": "公安县"
        },
        {
            "parentId": "421000",
            "cityId": "421023",
            "spell": "jlx",
            "city": "监利县"
        },
        {
            "parentId": "421000",
            "cityId": "421024",
            "spell": "jlx",
            "city": "江陵县"
        },
        {
            "parentId": "421000",
            "cityId": "421081",
            "spell": "sss",
            "city": "石首市"
        },
        {
            "parentId": "421000",
            "cityId": "421083",
            "spell": "hhs",
            "city": "洪湖市"
        },
        {
            "parentId": "421000",
            "cityId": "421087",
            "spell": "szs",
            "city": "松滋市"
        },
        {
            "parentId": "420000",
            "cityId": "421100",
            "spell": "hgs",
            "city": "黄冈市"
        },
        {
            "parentId": "421100",
            "cityId": "421101",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "421100",
            "cityId": "421102",
            "spell": "hzq",
            "city": "黄州区"
        },
        {
            "parentId": "421100",
            "cityId": "421121",
            "spell": "tfx",
            "city": "团风县"
        },
        {
            "parentId": "421100",
            "cityId": "421122",
            "spell": "hax",
            "city": "红安县"
        },
        {
            "parentId": "421100",
            "cityId": "421123",
            "spell": "ltx",
            "city": "罗田县"
        },
        {
            "parentId": "421100",
            "cityId": "421124",
            "spell": "ysx",
            "city": "英山县"
        },
        {
            "parentId": "421100",
            "cityId": "421125",
            "spell": "xsx",
            "city": "浠水县"
        },
        {
            "parentId": "421100",
            "cityId": "421126",
            "spell": "qcx",
            "city": "蕲春县"
        },
        {
            "parentId": "421100",
            "cityId": "421127",
            "spell": "hmx",
            "city": "黄梅县"
        },
        {
            "parentId": "421100",
            "cityId": "421181",
            "spell": "mcs",
            "city": "麻城市"
        },
        {
            "parentId": "421100",
            "cityId": "421182",
            "spell": "wxs",
            "city": "武穴市"
        },
        {
            "parentId": "420000",
            "cityId": "421200",
            "spell": "xns",
            "city": "咸宁市"
        },
        {
            "parentId": "421200",
            "cityId": "421201",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "421200",
            "cityId": "421202",
            "spell": "xaq",
            "city": "咸安区"
        },
        {
            "parentId": "421200",
            "cityId": "421221",
            "spell": "jyx",
            "city": "嘉鱼县"
        },
        {
            "parentId": "421200",
            "cityId": "421222",
            "spell": "tcx",
            "city": "通城县"
        },
        {
            "parentId": "421200",
            "cityId": "421223",
            "spell": "cyx",
            "city": "崇阳县"
        },
        {
            "parentId": "421200",
            "cityId": "421224",
            "spell": "tsx",
            "city": "通山县"
        },
        {
            "parentId": "421200",
            "cityId": "421281",
            "spell": "cbs",
            "city": "赤壁市"
        },
        {
            "parentId": "420000",
            "cityId": "421300",
            "spell": "szs",
            "city": "随州市"
        },
        {
            "parentId": "421300",
            "cityId": "421301",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "421300",
            "cityId": "421303",
            "spell": "cdq",
            "city": "曾都区"
        },
        {
            "parentId": "421300",
            "cityId": "421321",
            "spell": "sx",
            "city": "随县"
        },
        {
            "parentId": "421300",
            "cityId": "421381",
            "spell": "gss",
            "city": "广水市"
        },
        {
            "parentId": "420000",
            "cityId": "422800",
            "spell": "estjzmzzzz",
            "city": "恩施土家族苗族自治州"
        },
        {
            "parentId": "422800",
            "cityId": "422801",
            "spell": "ess",
            "city": "恩施市"
        },
        {
            "parentId": "422800",
            "cityId": "422802",
            "spell": "lcs",
            "city": "利川市"
        },
        {
            "parentId": "422800",
            "cityId": "422822",
            "spell": "jsx",
            "city": "建始县"
        },
        {
            "parentId": "422800",
            "cityId": "422823",
            "spell": "bdx",
            "city": "巴东县"
        },
        {
            "parentId": "422800",
            "cityId": "422825",
            "spell": "xex",
            "city": "宣恩县"
        },
        {
            "parentId": "422800",
            "cityId": "422826",
            "spell": "xfx",
            "city": "咸丰县"
        },
        {
            "parentId": "422800",
            "cityId": "422827",
            "spell": "lfx",
            "city": "来凤县"
        },
        {
            "parentId": "422800",
            "cityId": "422828",
            "spell": "hfx",
            "city": "鹤峰县"
        },
        {
            "parentId": "420000",
            "cityId": "429000",
            "spell": "szxxjxzqh",
            "city": "省直辖县级行政区划"
        },
        {
            "parentId": "429000",
            "cityId": "429004",
            "spell": "xts",
            "city": "仙桃市"
        },
        {
            "parentId": "429000",
            "cityId": "429005",
            "spell": "qjs",
            "city": "潜江市"
        },
        {
            "parentId": "429000",
            "cityId": "429006",
            "spell": "tms",
            "city": "天门市"
        },
        {
            "parentId": "429000",
            "cityId": "429021",
            "spell": "snjlq",
            "city": "神农架林区"
        },
        {
            "parentId": "0",
            "cityId": "430000",
            "spell": "hns",
            "city": "湖南省"
        },
        {
            "parentId": "430000",
            "cityId": "430100",
            "spell": "css",
            "city": "长沙市"
        },
        {
            "parentId": "430100",
            "cityId": "430101",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "430100",
            "cityId": "430102",
            "spell": "frq",
            "city": "芙蓉区"
        },
        {
            "parentId": "430100",
            "cityId": "430103",
            "spell": "txq",
            "city": "天心区"
        },
        {
            "parentId": "430100",
            "cityId": "430104",
            "spell": "ylq",
            "city": "岳麓区"
        },
        {
            "parentId": "430100",
            "cityId": "430105",
            "spell": "kfq",
            "city": "开福区"
        },
        {
            "parentId": "430100",
            "cityId": "430111",
            "spell": "yhq",
            "city": "雨花区"
        },
        {
            "parentId": "430100",
            "cityId": "430112",
            "spell": "wcq",
            "city": "望城区"
        },
        {
            "parentId": "430100",
            "cityId": "430121",
            "spell": "csx",
            "city": "长沙县"
        },
        {
            "parentId": "430100",
            "cityId": "430124",
            "spell": "nxx",
            "city": "宁乡县"
        },
        {
            "parentId": "430100",
            "cityId": "430181",
            "spell": "lys",
            "city": "浏阳市"
        },
        {
            "parentId": "430000",
            "cityId": "430200",
            "spell": "zzs",
            "city": "株洲市"
        },
        {
            "parentId": "430200",
            "cityId": "430201",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "430200",
            "cityId": "430202",
            "spell": "htq",
            "city": "荷塘区"
        },
        {
            "parentId": "430200",
            "cityId": "430203",
            "spell": "lsq",
            "city": "芦淞区"
        },
        {
            "parentId": "430200",
            "cityId": "430204",
            "spell": "sfq",
            "city": "石峰区"
        },
        {
            "parentId": "430200",
            "cityId": "430211",
            "spell": "tyq",
            "city": "天元区"
        },
        {
            "parentId": "430200",
            "cityId": "430221",
            "spell": "zzx",
            "city": "株洲县"
        },
        {
            "parentId": "430200",
            "cityId": "430223",
            "spell": "yx",
            "city": "攸县"
        },
        {
            "parentId": "430200",
            "cityId": "430224",
            "spell": "clx",
            "city": "茶陵县"
        },
        {
            "parentId": "430200",
            "cityId": "430225",
            "spell": "ylx",
            "city": "炎陵县"
        },
        {
            "parentId": "430200",
            "cityId": "430281",
            "spell": "lls",
            "city": "醴陵市"
        },
        {
            "parentId": "430000",
            "cityId": "430300",
            "spell": "xts",
            "city": "湘潭市"
        },
        {
            "parentId": "430300",
            "cityId": "430301",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "430300",
            "cityId": "430302",
            "spell": "yhq",
            "city": "雨湖区"
        },
        {
            "parentId": "430300",
            "cityId": "430304",
            "spell": "ytq",
            "city": "岳塘区"
        },
        {
            "parentId": "430300",
            "cityId": "430321",
            "spell": "xtx",
            "city": "湘潭县"
        },
        {
            "parentId": "430300",
            "cityId": "430381",
            "spell": "xxs",
            "city": "湘乡市"
        },
        {
            "parentId": "430300",
            "cityId": "430382",
            "spell": "sss",
            "city": "韶山市"
        },
        {
            "parentId": "430000",
            "cityId": "430400",
            "spell": "hys",
            "city": "衡阳市"
        },
        {
            "parentId": "430400",
            "cityId": "430401",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "430400",
            "cityId": "430405",
            "spell": "zhq",
            "city": "珠晖区"
        },
        {
            "parentId": "430400",
            "cityId": "430406",
            "spell": "yfq",
            "city": "雁峰区"
        },
        {
            "parentId": "430400",
            "cityId": "430407",
            "spell": "sgq",
            "city": "石鼓区"
        },
        {
            "parentId": "430400",
            "cityId": "430408",
            "spell": "zxq",
            "city": "蒸湘区"
        },
        {
            "parentId": "430400",
            "cityId": "430412",
            "spell": "nyq",
            "city": "南岳区"
        },
        {
            "parentId": "430400",
            "cityId": "430421",
            "spell": "hyx",
            "city": "衡阳县"
        },
        {
            "parentId": "430400",
            "cityId": "430422",
            "spell": "hnx",
            "city": "衡南县"
        },
        {
            "parentId": "430400",
            "cityId": "430423",
            "spell": "hsx",
            "city": "衡山县"
        },
        {
            "parentId": "430400",
            "cityId": "430424",
            "spell": "hdx",
            "city": "衡东县"
        },
        {
            "parentId": "430400",
            "cityId": "430426",
            "spell": "qdx",
            "city": "祁东县"
        },
        {
            "parentId": "430400",
            "cityId": "430481",
            "spell": "lys",
            "city": "耒阳市"
        },
        {
            "parentId": "430400",
            "cityId": "430482",
            "spell": "cns",
            "city": "常宁市"
        },
        {
            "parentId": "430000",
            "cityId": "430500",
            "spell": "sys",
            "city": "邵阳市"
        },
        {
            "parentId": "430500",
            "cityId": "430501",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "430500",
            "cityId": "430502",
            "spell": "sqq",
            "city": "双清区"
        },
        {
            "parentId": "430500",
            "cityId": "430503",
            "spell": "dxq",
            "city": "大祥区"
        },
        {
            "parentId": "430500",
            "cityId": "430511",
            "spell": "btq",
            "city": "北塔区"
        },
        {
            "parentId": "430500",
            "cityId": "430521",
            "spell": "sdx",
            "city": "邵东县"
        },
        {
            "parentId": "430500",
            "cityId": "430522",
            "spell": "xsx",
            "city": "新邵县"
        },
        {
            "parentId": "430500",
            "cityId": "430523",
            "spell": "syx",
            "city": "邵阳县"
        },
        {
            "parentId": "430500",
            "cityId": "430524",
            "spell": "lhx",
            "city": "隆回县"
        },
        {
            "parentId": "430500",
            "cityId": "430525",
            "spell": "dkx",
            "city": "洞口县"
        },
        {
            "parentId": "430500",
            "cityId": "430527",
            "spell": "snx",
            "city": "绥宁县"
        },
        {
            "parentId": "430500",
            "cityId": "430528",
            "spell": "xnx",
            "city": "新宁县"
        },
        {
            "parentId": "430500",
            "cityId": "430529",
            "spell": "cbmzzzx",
            "city": "城步苗族自治县"
        },
        {
            "parentId": "430500",
            "cityId": "430581",
            "spell": "wgs",
            "city": "武冈市"
        },
        {
            "parentId": "430000",
            "cityId": "430600",
            "spell": "yys",
            "city": "岳阳市"
        },
        {
            "parentId": "430600",
            "cityId": "430601",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "430600",
            "cityId": "430602",
            "spell": "yylq",
            "city": "岳阳楼区"
        },
        {
            "parentId": "430600",
            "cityId": "430603",
            "spell": "yxq",
            "city": "云溪区"
        },
        {
            "parentId": "430600",
            "cityId": "430611",
            "spell": "jsq",
            "city": "君山区"
        },
        {
            "parentId": "430600",
            "cityId": "430621",
            "spell": "yyx",
            "city": "岳阳县"
        },
        {
            "parentId": "430600",
            "cityId": "430623",
            "spell": "hrx",
            "city": "华容县"
        },
        {
            "parentId": "430600",
            "cityId": "430624",
            "spell": "xyx",
            "city": "湘阴县"
        },
        {
            "parentId": "430600",
            "cityId": "430626",
            "spell": "pjx",
            "city": "平江县"
        },
        {
            "parentId": "430600",
            "cityId": "430681",
            "spell": "mls",
            "city": "汨罗市"
        },
        {
            "parentId": "430600",
            "cityId": "430682",
            "spell": "lxs",
            "city": "临湘市"
        },
        {
            "parentId": "430000",
            "cityId": "430700",
            "spell": "cds",
            "city": "常德市"
        },
        {
            "parentId": "430700",
            "cityId": "430701",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "430700",
            "cityId": "430702",
            "spell": "wlq",
            "city": "武陵区"
        },
        {
            "parentId": "430700",
            "cityId": "430703",
            "spell": "dcq",
            "city": "鼎城区"
        },
        {
            "parentId": "430700",
            "cityId": "430721",
            "spell": "axx",
            "city": "安乡县"
        },
        {
            "parentId": "430700",
            "cityId": "430722",
            "spell": "hsx",
            "city": "汉寿县"
        },
        {
            "parentId": "430700",
            "cityId": "430723",
            "spell": "lx",
            "city": "澧县"
        },
        {
            "parentId": "430700",
            "cityId": "430724",
            "spell": "llx",
            "city": "临澧县"
        },
        {
            "parentId": "430700",
            "cityId": "430725",
            "spell": "tyx",
            "city": "桃源县"
        },
        {
            "parentId": "430700",
            "cityId": "430726",
            "spell": "smx",
            "city": "石门县"
        },
        {
            "parentId": "430700",
            "cityId": "430781",
            "spell": "jss",
            "city": "津市市"
        },
        {
            "parentId": "430000",
            "cityId": "430800",
            "spell": "zjjs",
            "city": "张家界市"
        },
        {
            "parentId": "430800",
            "cityId": "430801",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "430800",
            "cityId": "430802",
            "spell": "ydq",
            "city": "永定区"
        },
        {
            "parentId": "430800",
            "cityId": "430811",
            "spell": "wlyq",
            "city": "武陵源区"
        },
        {
            "parentId": "430800",
            "cityId": "430821",
            "spell": "clx",
            "city": "慈利县"
        },
        {
            "parentId": "430800",
            "cityId": "430822",
            "spell": "szx",
            "city": "桑植县"
        },
        {
            "parentId": "430000",
            "cityId": "430900",
            "spell": "yys",
            "city": "益阳市"
        },
        {
            "parentId": "430900",
            "cityId": "430901",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "430900",
            "cityId": "430902",
            "spell": "zyq",
            "city": "资阳区"
        },
        {
            "parentId": "430900",
            "cityId": "430903",
            "spell": "hsq",
            "city": "赫山区"
        },
        {
            "parentId": "430900",
            "cityId": "430921",
            "spell": "nx",
            "city": "南县"
        },
        {
            "parentId": "430900",
            "cityId": "430922",
            "spell": "tjx",
            "city": "桃江县"
        },
        {
            "parentId": "430900",
            "cityId": "430923",
            "spell": "ahx",
            "city": "安化县"
        },
        {
            "parentId": "430900",
            "cityId": "430981",
            "spell": "yjs",
            "city": "沅江市"
        },
        {
            "parentId": "430000",
            "cityId": "431000",
            "spell": "czs",
            "city": "郴州市"
        },
        {
            "parentId": "431000",
            "cityId": "431001",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "431000",
            "cityId": "431002",
            "spell": "bhq",
            "city": "北湖区"
        },
        {
            "parentId": "431000",
            "cityId": "431003",
            "spell": "sxq",
            "city": "苏仙区"
        },
        {
            "parentId": "431000",
            "cityId": "431021",
            "spell": "gyx",
            "city": "桂阳县"
        },
        {
            "parentId": "431000",
            "cityId": "431022",
            "spell": "yzx",
            "city": "宜章县"
        },
        {
            "parentId": "431000",
            "cityId": "431023",
            "spell": "yxx",
            "city": "永兴县"
        },
        {
            "parentId": "431000",
            "cityId": "431024",
            "spell": "jhx",
            "city": "嘉禾县"
        },
        {
            "parentId": "431000",
            "cityId": "431025",
            "spell": "lwx",
            "city": "临武县"
        },
        {
            "parentId": "431000",
            "cityId": "431026",
            "spell": "rcx",
            "city": "汝城县"
        },
        {
            "parentId": "431000",
            "cityId": "431027",
            "spell": "gdx",
            "city": "桂东县"
        },
        {
            "parentId": "431000",
            "cityId": "431028",
            "spell": "arx",
            "city": "安仁县"
        },
        {
            "parentId": "431000",
            "cityId": "431081",
            "spell": "zxs",
            "city": "资兴市"
        },
        {
            "parentId": "430000",
            "cityId": "431100",
            "spell": "yzs",
            "city": "永州市"
        },
        {
            "parentId": "431100",
            "cityId": "431101",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "431100",
            "cityId": "431102",
            "spell": "llq",
            "city": "零陵区"
        },
        {
            "parentId": "431100",
            "cityId": "431103",
            "spell": "lstq",
            "city": "冷水滩区"
        },
        {
            "parentId": "431100",
            "cityId": "431121",
            "spell": "qyx",
            "city": "祁阳县"
        },
        {
            "parentId": "431100",
            "cityId": "431122",
            "spell": "dax",
            "city": "东安县"
        },
        {
            "parentId": "431100",
            "cityId": "431123",
            "spell": "spx",
            "city": "双牌县"
        },
        {
            "parentId": "431100",
            "cityId": "431124",
            "spell": "dx",
            "city": "道县"
        },
        {
            "parentId": "431100",
            "cityId": "431125",
            "spell": "jyx",
            "city": "江永县"
        },
        {
            "parentId": "431100",
            "cityId": "431126",
            "spell": "nyx",
            "city": "宁远县"
        },
        {
            "parentId": "431100",
            "cityId": "431127",
            "spell": "lsx",
            "city": "蓝山县"
        },
        {
            "parentId": "431100",
            "cityId": "431128",
            "spell": "xtx",
            "city": "新田县"
        },
        {
            "parentId": "431100",
            "cityId": "431129",
            "spell": "jhyzzzx",
            "city": "江华瑶族自治县"
        },
        {
            "parentId": "430000",
            "cityId": "431200",
            "spell": "hhs",
            "city": "怀化市"
        },
        {
            "parentId": "431200",
            "cityId": "431201",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "431200",
            "cityId": "431202",
            "spell": "hcq",
            "city": "鹤城区"
        },
        {
            "parentId": "431200",
            "cityId": "431221",
            "spell": "zfx",
            "city": "中方县"
        },
        {
            "parentId": "431200",
            "cityId": "431222",
            "spell": "ylx",
            "city": "沅陵县"
        },
        {
            "parentId": "431200",
            "cityId": "431223",
            "spell": "cxx",
            "city": "辰溪县"
        },
        {
            "parentId": "431200",
            "cityId": "431224",
            "spell": "xpx",
            "city": "溆浦县"
        },
        {
            "parentId": "431200",
            "cityId": "431225",
            "spell": "htx",
            "city": "会同县"
        },
        {
            "parentId": "431200",
            "cityId": "431226",
            "spell": "mymzzzx",
            "city": "麻阳苗族自治县"
        },
        {
            "parentId": "431200",
            "cityId": "431227",
            "spell": "xhdzzzx",
            "city": "新晃侗族自治县"
        },
        {
            "parentId": "431200",
            "cityId": "431228",
            "spell": "zjdzzzx",
            "city": "芷江侗族自治县"
        },
        {
            "parentId": "431200",
            "cityId": "431229",
            "spell": "jzmzdzzzx",
            "city": "靖州苗族侗族自治县"
        },
        {
            "parentId": "431200",
            "cityId": "431230",
            "spell": "tddzzzx",
            "city": "通道侗族自治县"
        },
        {
            "parentId": "431200",
            "cityId": "431281",
            "spell": "hjs",
            "city": "洪江市"
        },
        {
            "parentId": "430000",
            "cityId": "431300",
            "spell": "lds",
            "city": "娄底市"
        },
        {
            "parentId": "431300",
            "cityId": "431301",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "431300",
            "cityId": "431302",
            "spell": "lxq",
            "city": "娄星区"
        },
        {
            "parentId": "431300",
            "cityId": "431321",
            "spell": "sfx",
            "city": "双峰县"
        },
        {
            "parentId": "431300",
            "cityId": "431322",
            "spell": "xhx",
            "city": "新化县"
        },
        {
            "parentId": "431300",
            "cityId": "431381",
            "spell": "lsjs",
            "city": "冷水江市"
        },
        {
            "parentId": "431300",
            "cityId": "431382",
            "spell": "lys",
            "city": "涟源市"
        },
        {
            "parentId": "430000",
            "cityId": "433100",
            "spell": "xxtjzmzzzz",
            "city": "湘西土家族苗族自治州"
        },
        {
            "parentId": "433100",
            "cityId": "433101",
            "spell": "jss",
            "city": "吉首市"
        },
        {
            "parentId": "433100",
            "cityId": "433122",
            "spell": "lxx",
            "city": "泸溪县"
        },
        {
            "parentId": "433100",
            "cityId": "433123",
            "spell": "fhx",
            "city": "凤凰县"
        },
        {
            "parentId": "433100",
            "cityId": "433124",
            "spell": "hyx",
            "city": "花垣县"
        },
        {
            "parentId": "433100",
            "cityId": "433125",
            "spell": "bjx",
            "city": "保靖县"
        },
        {
            "parentId": "433100",
            "cityId": "433126",
            "spell": "gzx",
            "city": "古丈县"
        },
        {
            "parentId": "433100",
            "cityId": "433127",
            "spell": "ysx",
            "city": "永顺县"
        },
        {
            "parentId": "433100",
            "cityId": "433130",
            "spell": "lsx",
            "city": "龙山县"
        },
        {
            "parentId": "0",
            "cityId": "440000",
            "spell": "gds",
            "city": "广东省"
        },
        {
            "parentId": "440000",
            "cityId": "440100",
            "spell": "gzs",
            "city": "广州市"
        },
        {
            "parentId": "440100",
            "cityId": "440101",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "440100",
            "cityId": "440103",
            "spell": "lwq",
            "city": "荔湾区"
        },
        {
            "parentId": "440100",
            "cityId": "440104",
            "spell": "yxq",
            "city": "越秀区"
        },
        {
            "parentId": "440100",
            "cityId": "440105",
            "spell": "hzq",
            "city": "海珠区"
        },
        {
            "parentId": "440100",
            "cityId": "440106",
            "spell": "thq",
            "city": "天河区"
        },
        {
            "parentId": "440100",
            "cityId": "440111",
            "spell": "byq",
            "city": "白云区"
        },
        {
            "parentId": "440100",
            "cityId": "440112",
            "spell": "hpq",
            "city": "黄埔区"
        },
        {
            "parentId": "440100",
            "cityId": "440113",
            "spell": "fyq",
            "city": "番禺区"
        },
        {
            "parentId": "440100",
            "cityId": "440114",
            "spell": "hdq",
            "city": "花都区"
        },
        {
            "parentId": "440100",
            "cityId": "440115",
            "spell": "nsq",
            "city": "南沙区"
        },
        {
            "parentId": "440100",
            "cityId": "440116",
            "spell": "lgq",
            "city": "萝岗区"
        },
        {
            "parentId": "440100",
            "cityId": "440183",
            "spell": "zcs",
            "city": "增城市"
        },
        {
            "parentId": "440100",
            "cityId": "440184",
            "spell": "chs",
            "city": "从化市"
        },
        {
            "parentId": "440000",
            "cityId": "440200",
            "spell": "sgs",
            "city": "韶关市"
        },
        {
            "parentId": "440200",
            "cityId": "440201",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "440200",
            "cityId": "440203",
            "spell": "wjq",
            "city": "武江区"
        },
        {
            "parentId": "440200",
            "cityId": "440204",
            "spell": "zjq",
            "city": "浈江区"
        },
        {
            "parentId": "440200",
            "cityId": "440205",
            "spell": "qjq",
            "city": "曲江区"
        },
        {
            "parentId": "440200",
            "cityId": "440222",
            "spell": "sxx",
            "city": "始兴县"
        },
        {
            "parentId": "440200",
            "cityId": "440224",
            "spell": "rhx",
            "city": "仁化县"
        },
        {
            "parentId": "440200",
            "cityId": "440229",
            "spell": "wyx",
            "city": "翁源县"
        },
        {
            "parentId": "440200",
            "cityId": "440232",
            "spell": "ryyzzzx",
            "city": "乳源瑶族自治县"
        },
        {
            "parentId": "440200",
            "cityId": "440233",
            "spell": "xfx",
            "city": "新丰县"
        },
        {
            "parentId": "440200",
            "cityId": "440281",
            "spell": "lcs",
            "city": "乐昌市"
        },
        {
            "parentId": "440200",
            "cityId": "440282",
            "spell": "nxs",
            "city": "南雄市"
        },
        {
            "parentId": "440000",
            "cityId": "440300",
            "spell": "szs",
            "city": "深圳市"
        },
        {
            "parentId": "440300",
            "cityId": "440301",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "440300",
            "cityId": "440303",
            "spell": "lhq",
            "city": "罗湖区"
        },
        {
            "parentId": "440300",
            "cityId": "440304",
            "spell": "ftq",
            "city": "福田区"
        },
        {
            "parentId": "440300",
            "cityId": "440305",
            "spell": "nsq",
            "city": "南山区"
        },
        {
            "parentId": "440300",
            "cityId": "440306",
            "spell": "baq",
            "city": "宝安区"
        },
        {
            "parentId": "440300",
            "cityId": "440307",
            "spell": "lgq",
            "city": "龙岗区"
        },
        {
            "parentId": "440300",
            "cityId": "440308",
            "spell": "ytq",
            "city": "盐田区"
        },
        {
            "parentId": "440000",
            "cityId": "440400",
            "spell": "zhs",
            "city": "珠海市"
        },
        {
            "parentId": "440400",
            "cityId": "440401",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "440400",
            "cityId": "440402",
            "spell": "xzq",
            "city": "香洲区"
        },
        {
            "parentId": "440400",
            "cityId": "440403",
            "spell": "dmq",
            "city": "斗门区"
        },
        {
            "parentId": "440400",
            "cityId": "440404",
            "spell": "jwq",
            "city": "金湾区"
        },
        {
            "parentId": "440000",
            "cityId": "440500",
            "spell": "sts",
            "city": "汕头市"
        },
        {
            "parentId": "440500",
            "cityId": "440501",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "440500",
            "cityId": "440507",
            "spell": "lhq",
            "city": "龙湖区"
        },
        {
            "parentId": "440500",
            "cityId": "440511",
            "spell": "jpq",
            "city": "金平区"
        },
        {
            "parentId": "440500",
            "cityId": "440512",
            "spell": "hjq",
            "city": "濠江区"
        },
        {
            "parentId": "440500",
            "cityId": "440513",
            "spell": "cyq",
            "city": "潮阳区"
        },
        {
            "parentId": "440500",
            "cityId": "440514",
            "spell": "cnq",
            "city": "潮南区"
        },
        {
            "parentId": "440500",
            "cityId": "440515",
            "spell": "chq",
            "city": "澄海区"
        },
        {
            "parentId": "440500",
            "cityId": "440523",
            "spell": "nax",
            "city": "南澳县"
        },
        {
            "parentId": "440000",
            "cityId": "440600",
            "spell": "fss",
            "city": "佛山市"
        },
        {
            "parentId": "440600",
            "cityId": "440601",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "440600",
            "cityId": "440604",
            "spell": "ccq",
            "city": "禅城区"
        },
        {
            "parentId": "440600",
            "cityId": "440605",
            "spell": "nhq",
            "city": "南海区"
        },
        {
            "parentId": "440600",
            "cityId": "440606",
            "spell": "sdq",
            "city": "顺德区"
        },
        {
            "parentId": "440600",
            "cityId": "440607",
            "spell": "ssq",
            "city": "三水区"
        },
        {
            "parentId": "440600",
            "cityId": "440608",
            "spell": "gmq",
            "city": "高明区"
        },
        {
            "parentId": "440000",
            "cityId": "440700",
            "spell": "jms",
            "city": "江门市"
        },
        {
            "parentId": "440700",
            "cityId": "440701",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "440700",
            "cityId": "440703",
            "spell": "pjq",
            "city": "蓬江区"
        },
        {
            "parentId": "440700",
            "cityId": "440704",
            "spell": "jhq",
            "city": "江海区"
        },
        {
            "parentId": "440700",
            "cityId": "440705",
            "spell": "xhq",
            "city": "新会区"
        },
        {
            "parentId": "440700",
            "cityId": "440781",
            "spell": "tss",
            "city": "台山市"
        },
        {
            "parentId": "440700",
            "cityId": "440783",
            "spell": "kps",
            "city": "开平市"
        },
        {
            "parentId": "440700",
            "cityId": "440784",
            "spell": "hss",
            "city": "鹤山市"
        },
        {
            "parentId": "440700",
            "cityId": "440785",
            "spell": "eps",
            "city": "恩平市"
        },
        {
            "parentId": "440000",
            "cityId": "440800",
            "spell": "zjs",
            "city": "湛江市"
        },
        {
            "parentId": "440800",
            "cityId": "440801",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "440800",
            "cityId": "440802",
            "spell": "ckq",
            "city": "赤坎区"
        },
        {
            "parentId": "440800",
            "cityId": "440803",
            "spell": "xsq",
            "city": "霞山区"
        },
        {
            "parentId": "440800",
            "cityId": "440804",
            "spell": "ptq",
            "city": "坡头区"
        },
        {
            "parentId": "440800",
            "cityId": "440811",
            "spell": "mzq",
            "city": "麻章区"
        },
        {
            "parentId": "440800",
            "cityId": "440823",
            "spell": "sxx",
            "city": "遂溪县"
        },
        {
            "parentId": "440800",
            "cityId": "440825",
            "spell": "xwx",
            "city": "徐闻县"
        },
        {
            "parentId": "440800",
            "cityId": "440881",
            "spell": "ljs",
            "city": "廉江市"
        },
        {
            "parentId": "440800",
            "cityId": "440882",
            "spell": "lzs",
            "city": "雷州市"
        },
        {
            "parentId": "440800",
            "cityId": "440883",
            "spell": "wcs",
            "city": "吴川市"
        },
        {
            "parentId": "440000",
            "cityId": "440900",
            "spell": "mms",
            "city": "茂名市"
        },
        {
            "parentId": "440900",
            "cityId": "440901",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "440900",
            "cityId": "440902",
            "spell": "mnq",
            "city": "茂南区"
        },
        {
            "parentId": "440900",
            "cityId": "440903",
            "spell": "mgq",
            "city": "茂港区"
        },
        {
            "parentId": "440900",
            "cityId": "440923",
            "spell": "dbx",
            "city": "电白县"
        },
        {
            "parentId": "440900",
            "cityId": "440981",
            "spell": "gzs",
            "city": "高州市"
        },
        {
            "parentId": "440900",
            "cityId": "440982",
            "spell": "hzs",
            "city": "化州市"
        },
        {
            "parentId": "440900",
            "cityId": "440983",
            "spell": "xys",
            "city": "信宜市"
        },
        {
            "parentId": "440000",
            "cityId": "441200",
            "spell": "zqs",
            "city": "肇庆市"
        },
        {
            "parentId": "441200",
            "cityId": "441201",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "441200",
            "cityId": "441202",
            "spell": "dzq",
            "city": "端州区"
        },
        {
            "parentId": "441200",
            "cityId": "441203",
            "spell": "dhq",
            "city": "鼎湖区"
        },
        {
            "parentId": "441200",
            "cityId": "441223",
            "spell": "gnx",
            "city": "广宁县"
        },
        {
            "parentId": "441200",
            "cityId": "441224",
            "spell": "hjx",
            "city": "怀集县"
        },
        {
            "parentId": "441200",
            "cityId": "441225",
            "spell": "fkx",
            "city": "封开县"
        },
        {
            "parentId": "441200",
            "cityId": "441226",
            "spell": "dqx",
            "city": "德庆县"
        },
        {
            "parentId": "441200",
            "cityId": "441283",
            "spell": "gys",
            "city": "高要市"
        },
        {
            "parentId": "441200",
            "cityId": "441284",
            "spell": "shs",
            "city": "四会市"
        },
        {
            "parentId": "440000",
            "cityId": "441300",
            "spell": "hzs",
            "city": "惠州市"
        },
        {
            "parentId": "441300",
            "cityId": "441301",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "441300",
            "cityId": "441302",
            "spell": "hcq",
            "city": "惠城区"
        },
        {
            "parentId": "441300",
            "cityId": "441303",
            "spell": "hyq",
            "city": "惠阳区"
        },
        {
            "parentId": "441300",
            "cityId": "441322",
            "spell": "blx",
            "city": "博罗县"
        },
        {
            "parentId": "441300",
            "cityId": "441323",
            "spell": "hdx",
            "city": "惠东县"
        },
        {
            "parentId": "441300",
            "cityId": "441324",
            "spell": "lmx",
            "city": "龙门县"
        },
        {
            "parentId": "440000",
            "cityId": "441400",
            "spell": "mzs",
            "city": "梅州市"
        },
        {
            "parentId": "441400",
            "cityId": "441401",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "441400",
            "cityId": "441402",
            "spell": "mjq",
            "city": "梅江区"
        },
        {
            "parentId": "441400",
            "cityId": "441421",
            "spell": "mx",
            "city": "梅县"
        },
        {
            "parentId": "441400",
            "cityId": "441422",
            "spell": "dbx",
            "city": "大埔县"
        },
        {
            "parentId": "441400",
            "cityId": "441423",
            "spell": "fsx",
            "city": "丰顺县"
        },
        {
            "parentId": "441400",
            "cityId": "441424",
            "spell": "whx",
            "city": "五华县"
        },
        {
            "parentId": "441400",
            "cityId": "441426",
            "spell": "pyx",
            "city": "平远县"
        },
        {
            "parentId": "441400",
            "cityId": "441427",
            "spell": "jlx",
            "city": "蕉岭县"
        },
        {
            "parentId": "441400",
            "cityId": "441481",
            "spell": "xns",
            "city": "兴宁市"
        },
        {
            "parentId": "440000",
            "cityId": "441500",
            "spell": "sws",
            "city": "汕尾市"
        },
        {
            "parentId": "441500",
            "cityId": "441501",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "441500",
            "cityId": "441502",
            "spell": "cq",
            "city": "城区"
        },
        {
            "parentId": "441500",
            "cityId": "441521",
            "spell": "hfx",
            "city": "海丰县"
        },
        {
            "parentId": "441500",
            "cityId": "441523",
            "spell": "lhx",
            "city": "陆河县"
        },
        {
            "parentId": "441500",
            "cityId": "441581",
            "spell": "lfs",
            "city": "陆丰市"
        },
        {
            "parentId": "440000",
            "cityId": "441600",
            "spell": "hys",
            "city": "河源市"
        },
        {
            "parentId": "441600",
            "cityId": "441601",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "441600",
            "cityId": "441602",
            "spell": "ycq",
            "city": "源城区"
        },
        {
            "parentId": "441600",
            "cityId": "441621",
            "spell": "zjx",
            "city": "紫金县"
        },
        {
            "parentId": "441600",
            "cityId": "441622",
            "spell": "lcx",
            "city": "龙川县"
        },
        {
            "parentId": "441600",
            "cityId": "441623",
            "spell": "lpx",
            "city": "连平县"
        },
        {
            "parentId": "441600",
            "cityId": "441624",
            "spell": "hpx",
            "city": "和平县"
        },
        {
            "parentId": "441600",
            "cityId": "441625",
            "spell": "dyx",
            "city": "东源县"
        },
        {
            "parentId": "440000",
            "cityId": "441700",
            "spell": "yjs",
            "city": "阳江市"
        },
        {
            "parentId": "441700",
            "cityId": "441701",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "441700",
            "cityId": "441702",
            "spell": "jcq",
            "city": "江城区"
        },
        {
            "parentId": "441700",
            "cityId": "441721",
            "spell": "yxx",
            "city": "阳西县"
        },
        {
            "parentId": "441700",
            "cityId": "441723",
            "spell": "ydx",
            "city": "阳东县"
        },
        {
            "parentId": "441700",
            "cityId": "441781",
            "spell": "ycs",
            "city": "阳春市"
        },
        {
            "parentId": "440000",
            "cityId": "441800",
            "spell": "qys",
            "city": "清远市"
        },
        {
            "parentId": "441800",
            "cityId": "441801",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "441800",
            "cityId": "441802",
            "spell": "qcq",
            "city": "清城区"
        },
        {
            "parentId": "441800",
            "cityId": "441803",
            "spell": "qxq",
            "city": "清新区"
        },
        {
            "parentId": "441800",
            "cityId": "441821",
            "spell": "fgx",
            "city": "佛冈县"
        },
        {
            "parentId": "441800",
            "cityId": "441823",
            "spell": "ysx",
            "city": "阳山县"
        },
        {
            "parentId": "441800",
            "cityId": "441825",
            "spell": "lszzyzzzx",
            "city": "连山壮族瑶族自治县"
        },
        {
            "parentId": "441800",
            "cityId": "441826",
            "spell": "lnyzzzx",
            "city": "连南瑶族自治县"
        },
        {
            "parentId": "441800",
            "cityId": "441881",
            "spell": "yds",
            "city": "英德市"
        },
        {
            "parentId": "441800",
            "cityId": "441882",
            "spell": "lzs",
            "city": "连州市"
        },
        {
            "parentId": "440000",
            "cityId": "441900",
            "spell": "dgs",
            "city": "东莞市"
        },
        {
            "parentId": "440000",
            "cityId": "442000",
            "spell": "zss",
            "city": "中山市"
        },
        {
            "parentId": "440000",
            "cityId": "445100",
            "spell": "czs",
            "city": "潮州市"
        },
        {
            "parentId": "445100",
            "cityId": "445101",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "445100",
            "cityId": "445102",
            "spell": "xqq",
            "city": "湘桥区"
        },
        {
            "parentId": "445100",
            "cityId": "445103",
            "spell": "caq",
            "city": "潮安区"
        },
        {
            "parentId": "445100",
            "cityId": "445122",
            "spell": "rpx",
            "city": "饶平县"
        },
        {
            "parentId": "440000",
            "cityId": "445200",
            "spell": "jys",
            "city": "揭阳市"
        },
        {
            "parentId": "445200",
            "cityId": "445201",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "445200",
            "cityId": "445202",
            "spell": "rcq",
            "city": "榕城区"
        },
        {
            "parentId": "445200",
            "cityId": "445203",
            "spell": "jdq",
            "city": "揭东区"
        },
        {
            "parentId": "445200",
            "cityId": "445222",
            "spell": "jxx",
            "city": "揭西县"
        },
        {
            "parentId": "445200",
            "cityId": "445224",
            "spell": "hlx",
            "city": "惠来县"
        },
        {
            "parentId": "445200",
            "cityId": "445281",
            "spell": "pns",
            "city": "普宁市"
        },
        {
            "parentId": "440000",
            "cityId": "445300",
            "spell": "yfs",
            "city": "云浮市"
        },
        {
            "parentId": "445300",
            "cityId": "445301",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "445300",
            "cityId": "445302",
            "spell": "ycq",
            "city": "云城区"
        },
        {
            "parentId": "445300",
            "cityId": "445321",
            "spell": "xxx",
            "city": "新兴县"
        },
        {
            "parentId": "445300",
            "cityId": "445322",
            "spell": "ynx",
            "city": "郁南县"
        },
        {
            "parentId": "445300",
            "cityId": "445323",
            "spell": "yax",
            "city": "云安县"
        },
        {
            "parentId": "445300",
            "cityId": "445381",
            "spell": "lds",
            "city": "罗定市"
        },
        {
            "parentId": "0",
            "cityId": "450000",
            "spell": "gxzzzzq",
            "city": "广西壮族自治区"
        },
        {
            "parentId": "450000",
            "cityId": "450100",
            "spell": "nns",
            "city": "南宁市"
        },
        {
            "parentId": "450100",
            "cityId": "450101",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "450100",
            "cityId": "450102",
            "spell": "xnq",
            "city": "兴宁区"
        },
        {
            "parentId": "450100",
            "cityId": "450103",
            "spell": "qxq",
            "city": "青秀区"
        },
        {
            "parentId": "450100",
            "cityId": "450105",
            "spell": "jnq",
            "city": "江南区"
        },
        {
            "parentId": "450100",
            "cityId": "450107",
            "spell": "xxtq",
            "city": "西乡塘区"
        },
        {
            "parentId": "450100",
            "cityId": "450108",
            "spell": "lqq",
            "city": "良庆区"
        },
        {
            "parentId": "450100",
            "cityId": "450109",
            "spell": "ynq",
            "city": "邕宁区"
        },
        {
            "parentId": "450100",
            "cityId": "450122",
            "spell": "wmx",
            "city": "武鸣县"
        },
        {
            "parentId": "450100",
            "cityId": "450123",
            "spell": "lax",
            "city": "隆安县"
        },
        {
            "parentId": "450100",
            "cityId": "450124",
            "spell": "msx",
            "city": "马山县"
        },
        {
            "parentId": "450100",
            "cityId": "450125",
            "spell": "slx",
            "city": "上林县"
        },
        {
            "parentId": "450100",
            "cityId": "450126",
            "spell": "byx",
            "city": "宾阳县"
        },
        {
            "parentId": "450100",
            "cityId": "450127",
            "spell": "hx",
            "city": "横县"
        },
        {
            "parentId": "450000",
            "cityId": "450200",
            "spell": "lzs",
            "city": "柳州市"
        },
        {
            "parentId": "450200",
            "cityId": "450201",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "450200",
            "cityId": "450202",
            "spell": "czq",
            "city": "城中区"
        },
        {
            "parentId": "450200",
            "cityId": "450203",
            "spell": "yfq",
            "city": "鱼峰区"
        },
        {
            "parentId": "450200",
            "cityId": "450204",
            "spell": "lnq",
            "city": "柳南区"
        },
        {
            "parentId": "450200",
            "cityId": "450205",
            "spell": "lbq",
            "city": "柳北区"
        },
        {
            "parentId": "450200",
            "cityId": "450221",
            "spell": "ljx",
            "city": "柳江县"
        },
        {
            "parentId": "450200",
            "cityId": "450222",
            "spell": "lcx",
            "city": "柳城县"
        },
        {
            "parentId": "450200",
            "cityId": "450223",
            "spell": "lzx",
            "city": "鹿寨县"
        },
        {
            "parentId": "450200",
            "cityId": "450224",
            "spell": "rax",
            "city": "融安县"
        },
        {
            "parentId": "450200",
            "cityId": "450225",
            "spell": "rsmzzzx",
            "city": "融水苗族自治县"
        },
        {
            "parentId": "450200",
            "cityId": "450226",
            "spell": "sjdzzzx",
            "city": "三江侗族自治县"
        },
        {
            "parentId": "450000",
            "cityId": "450300",
            "spell": "gls",
            "city": "桂林市"
        },
        {
            "parentId": "450300",
            "cityId": "450301",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "450300",
            "cityId": "450302",
            "spell": "xfq",
            "city": "秀峰区"
        },
        {
            "parentId": "450300",
            "cityId": "450303",
            "spell": "dcq",
            "city": "叠彩区"
        },
        {
            "parentId": "450300",
            "cityId": "450304",
            "spell": "xsq",
            "city": "象山区"
        },
        {
            "parentId": "450300",
            "cityId": "450305",
            "spell": "qxq",
            "city": "七星区"
        },
        {
            "parentId": "450300",
            "cityId": "450311",
            "spell": "ysq",
            "city": "雁山区"
        },
        {
            "parentId": "450300",
            "cityId": "450312",
            "spell": "lgq",
            "city": "临桂区"
        },
        {
            "parentId": "450300",
            "cityId": "450321",
            "spell": "ysx",
            "city": "阳朔县"
        },
        {
            "parentId": "450300",
            "cityId": "450323",
            "spell": "lcx",
            "city": "灵川县"
        },
        {
            "parentId": "450300",
            "cityId": "450324",
            "spell": "qzx",
            "city": "全州县"
        },
        {
            "parentId": "450300",
            "cityId": "450325",
            "spell": "xax",
            "city": "兴安县"
        },
        {
            "parentId": "450300",
            "cityId": "450326",
            "spell": "yfx",
            "city": "永福县"
        },
        {
            "parentId": "450300",
            "cityId": "450327",
            "spell": "gyx",
            "city": "灌阳县"
        },
        {
            "parentId": "450300",
            "cityId": "450328",
            "spell": "lsgzzzx",
            "city": "龙胜各族自治县"
        },
        {
            "parentId": "450300",
            "cityId": "450329",
            "spell": "zyx",
            "city": "资源县"
        },
        {
            "parentId": "450300",
            "cityId": "450330",
            "spell": "plx",
            "city": "平乐县"
        },
        {
            "parentId": "450300",
            "cityId": "450331",
            "spell": "lpx",
            "city": "荔浦县"
        },
        {
            "parentId": "450300",
            "cityId": "450332",
            "spell": "gcyzzzx",
            "city": "恭城瑶族自治县"
        },
        {
            "parentId": "450000",
            "cityId": "450400",
            "spell": "wzs",
            "city": "梧州市"
        },
        {
            "parentId": "450400",
            "cityId": "450401",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "450400",
            "cityId": "450403",
            "spell": "wxq",
            "city": "万秀区"
        },
        {
            "parentId": "450400",
            "cityId": "450405",
            "spell": "czq",
            "city": "长洲区"
        },
        {
            "parentId": "450400",
            "cityId": "450406",
            "spell": "lxq",
            "city": "龙圩区"
        },
        {
            "parentId": "450400",
            "cityId": "450421",
            "spell": "cwx",
            "city": "苍梧县"
        },
        {
            "parentId": "450400",
            "cityId": "450422",
            "spell": "tx",
            "city": "藤县"
        },
        {
            "parentId": "450400",
            "cityId": "450423",
            "spell": "msx",
            "city": "蒙山县"
        },
        {
            "parentId": "450400",
            "cityId": "450481",
            "spell": "cxs",
            "city": "岑溪市"
        },
        {
            "parentId": "450000",
            "cityId": "450500",
            "spell": "bhs",
            "city": "北海市"
        },
        {
            "parentId": "450500",
            "cityId": "450501",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "450500",
            "cityId": "450502",
            "spell": "hcq",
            "city": "海城区"
        },
        {
            "parentId": "450500",
            "cityId": "450503",
            "spell": "yhq",
            "city": "银海区"
        },
        {
            "parentId": "450500",
            "cityId": "450512",
            "spell": "tsgq",
            "city": "铁山港区"
        },
        {
            "parentId": "450500",
            "cityId": "450521",
            "spell": "hpx",
            "city": "合浦县"
        },
        {
            "parentId": "450000",
            "cityId": "450600",
            "spell": "fcgs",
            "city": "防城港市"
        },
        {
            "parentId": "450600",
            "cityId": "450601",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "450600",
            "cityId": "450602",
            "spell": "gkq",
            "city": "港口区"
        },
        {
            "parentId": "450600",
            "cityId": "450603",
            "spell": "fcq",
            "city": "防城区"
        },
        {
            "parentId": "450600",
            "cityId": "450621",
            "spell": "ssx",
            "city": "上思县"
        },
        {
            "parentId": "450600",
            "cityId": "450681",
            "spell": "dxs",
            "city": "东兴市"
        },
        {
            "parentId": "450000",
            "cityId": "450700",
            "spell": "qzs",
            "city": "钦州市"
        },
        {
            "parentId": "450700",
            "cityId": "450701",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "450700",
            "cityId": "450702",
            "spell": "qnq",
            "city": "钦南区"
        },
        {
            "parentId": "450700",
            "cityId": "450703",
            "spell": "qbq",
            "city": "钦北区"
        },
        {
            "parentId": "450700",
            "cityId": "450721",
            "spell": "lsx",
            "city": "灵山县"
        },
        {
            "parentId": "450700",
            "cityId": "450722",
            "spell": "pbx",
            "city": "浦北县"
        },
        {
            "parentId": "450000",
            "cityId": "450800",
            "spell": "ggs",
            "city": "贵港市"
        },
        {
            "parentId": "450800",
            "cityId": "450801",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "450800",
            "cityId": "450802",
            "spell": "gbq",
            "city": "港北区"
        },
        {
            "parentId": "450800",
            "cityId": "450803",
            "spell": "gnq",
            "city": "港南区"
        },
        {
            "parentId": "450800",
            "cityId": "450804",
            "spell": "ttq",
            "city": "覃塘区"
        },
        {
            "parentId": "450800",
            "cityId": "450821",
            "spell": "pnx",
            "city": "平南县"
        },
        {
            "parentId": "450800",
            "cityId": "450881",
            "spell": "gps",
            "city": "桂平市"
        },
        {
            "parentId": "450000",
            "cityId": "450900",
            "spell": "yls",
            "city": "玉林市"
        },
        {
            "parentId": "450900",
            "cityId": "450901",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "450900",
            "cityId": "450902",
            "spell": "yzq",
            "city": "玉州区"
        },
        {
            "parentId": "450900",
            "cityId": "450903",
            "spell": "fmq",
            "city": "福绵区"
        },
        {
            "parentId": "450900",
            "cityId": "450921",
            "spell": "rx",
            "city": "容县"
        },
        {
            "parentId": "450900",
            "cityId": "450922",
            "spell": "lcx",
            "city": "陆川县"
        },
        {
            "parentId": "450900",
            "cityId": "450923",
            "spell": "bbx",
            "city": "博白县"
        },
        {
            "parentId": "450900",
            "cityId": "450924",
            "spell": "xyx",
            "city": "兴业县"
        },
        {
            "parentId": "450900",
            "cityId": "450981",
            "spell": "bls",
            "city": "北流市"
        },
        {
            "parentId": "450000",
            "cityId": "451000",
            "spell": "bss",
            "city": "百色市"
        },
        {
            "parentId": "451000",
            "cityId": "451001",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "451000",
            "cityId": "451002",
            "spell": "yjq",
            "city": "右江区"
        },
        {
            "parentId": "451000",
            "cityId": "451021",
            "spell": "tyx",
            "city": "田阳县"
        },
        {
            "parentId": "451000",
            "cityId": "451022",
            "spell": "tdx",
            "city": "田东县"
        },
        {
            "parentId": "451000",
            "cityId": "451023",
            "spell": "pgx",
            "city": "平果县"
        },
        {
            "parentId": "451000",
            "cityId": "451024",
            "spell": "dbx",
            "city": "德保县"
        },
        {
            "parentId": "451000",
            "cityId": "451025",
            "spell": "jxx",
            "city": "靖西县"
        },
        {
            "parentId": "451000",
            "cityId": "451026",
            "spell": "npx",
            "city": "那坡县"
        },
        {
            "parentId": "451000",
            "cityId": "451027",
            "spell": "lyx",
            "city": "凌云县"
        },
        {
            "parentId": "451000",
            "cityId": "451028",
            "spell": "lyx",
            "city": "乐业县"
        },
        {
            "parentId": "451000",
            "cityId": "451029",
            "spell": "tlx",
            "city": "田林县"
        },
        {
            "parentId": "451000",
            "cityId": "451030",
            "spell": "xlx",
            "city": "西林县"
        },
        {
            "parentId": "451000",
            "cityId": "451031",
            "spell": "llgzzzx",
            "city": "隆林各族自治县"
        },
        {
            "parentId": "450000",
            "cityId": "451100",
            "spell": "hzs",
            "city": "贺州市"
        },
        {
            "parentId": "451100",
            "cityId": "451101",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "451100",
            "cityId": "451102",
            "spell": "bbq",
            "city": "八步区"
        },
        {
            "parentId": "451100",
            "cityId": "451121",
            "spell": "zpx",
            "city": "昭平县"
        },
        {
            "parentId": "451100",
            "cityId": "451122",
            "spell": "zsx",
            "city": "钟山县"
        },
        {
            "parentId": "451100",
            "cityId": "451123",
            "spell": "fcyzzzx",
            "city": "富川瑶族自治县"
        },
        {
            "parentId": "450000",
            "cityId": "451200",
            "spell": "hcs",
            "city": "河池市"
        },
        {
            "parentId": "451200",
            "cityId": "451201",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "451200",
            "cityId": "451202",
            "spell": "jcjq",
            "city": "金城江区"
        },
        {
            "parentId": "451200",
            "cityId": "451221",
            "spell": "ndx",
            "city": "南丹县"
        },
        {
            "parentId": "451200",
            "cityId": "451222",
            "spell": "tex",
            "city": "天峨县"
        },
        {
            "parentId": "451200",
            "cityId": "451223",
            "spell": "fsx",
            "city": "凤山县"
        },
        {
            "parentId": "451200",
            "cityId": "451224",
            "spell": "dlx",
            "city": "东兰县"
        },
        {
            "parentId": "451200",
            "cityId": "451225",
            "spell": "lcmlzzzx",
            "city": "罗城仫佬族自治县"
        },
        {
            "parentId": "451200",
            "cityId": "451226",
            "spell": "hjmnzzzx",
            "city": "环江毛南族自治县"
        },
        {
            "parentId": "451200",
            "cityId": "451227",
            "spell": "bmyzzzx",
            "city": "巴马瑶族自治县"
        },
        {
            "parentId": "451200",
            "cityId": "451228",
            "spell": "dayzzzx",
            "city": "都安瑶族自治县"
        },
        {
            "parentId": "451200",
            "cityId": "451229",
            "spell": "dhyzzzx",
            "city": "大化瑶族自治县"
        },
        {
            "parentId": "451200",
            "cityId": "451281",
            "spell": "yzs",
            "city": "宜州市"
        },
        {
            "parentId": "450000",
            "cityId": "451300",
            "spell": "lbs",
            "city": "来宾市"
        },
        {
            "parentId": "451300",
            "cityId": "451301",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "451300",
            "cityId": "451302",
            "spell": "xbq",
            "city": "兴宾区"
        },
        {
            "parentId": "451300",
            "cityId": "451321",
            "spell": "xcx",
            "city": "忻城县"
        },
        {
            "parentId": "451300",
            "cityId": "451322",
            "spell": "xzx",
            "city": "象州县"
        },
        {
            "parentId": "451300",
            "cityId": "451323",
            "spell": "wxx",
            "city": "武宣县"
        },
        {
            "parentId": "451300",
            "cityId": "451324",
            "spell": "jxyzzzx",
            "city": "金秀瑶族自治县"
        },
        {
            "parentId": "451300",
            "cityId": "451381",
            "spell": "hss",
            "city": "合山市"
        },
        {
            "parentId": "450000",
            "cityId": "451400",
            "spell": "czs",
            "city": "崇左市"
        },
        {
            "parentId": "451400",
            "cityId": "451401",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "451400",
            "cityId": "451402",
            "spell": "jzq",
            "city": "江州区"
        },
        {
            "parentId": "451400",
            "cityId": "451421",
            "spell": "fsx",
            "city": "扶绥县"
        },
        {
            "parentId": "451400",
            "cityId": "451422",
            "spell": "nmx",
            "city": "宁明县"
        },
        {
            "parentId": "451400",
            "cityId": "451423",
            "spell": "lzx",
            "city": "龙州县"
        },
        {
            "parentId": "451400",
            "cityId": "451424",
            "spell": "dxx",
            "city": "大新县"
        },
        {
            "parentId": "451400",
            "cityId": "451425",
            "spell": "tdx",
            "city": "天等县"
        },
        {
            "parentId": "451400",
            "cityId": "451481",
            "spell": "pxs",
            "city": "凭祥市"
        },
        {
            "parentId": "0",
            "cityId": "460000",
            "spell": "hns",
            "city": "海南省"
        },
        {
            "parentId": "460000",
            "cityId": "460100",
            "spell": "hks",
            "city": "海口市"
        },
        {
            "parentId": "460100",
            "cityId": "460101",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "460100",
            "cityId": "460105",
            "spell": "xyq",
            "city": "秀英区"
        },
        {
            "parentId": "460100",
            "cityId": "460106",
            "spell": "lhq",
            "city": "龙华区"
        },
        {
            "parentId": "460100",
            "cityId": "460107",
            "spell": "qsq",
            "city": "琼山区"
        },
        {
            "parentId": "460100",
            "cityId": "460108",
            "spell": "mlq",
            "city": "美兰区"
        },
        {
            "parentId": "460000",
            "cityId": "460200",
            "spell": "sys",
            "city": "三亚市"
        },
        {
            "parentId": "460200",
            "cityId": "460201",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "460000",
            "cityId": "460300",
            "spell": "sss",
            "city": "三沙市"
        },
        {
            "parentId": "460300",
            "cityId": "460321",
            "spell": "xsqd",
            "city": "西沙群岛"
        },
        {
            "parentId": "460300",
            "cityId": "460322",
            "spell": "nsqd",
            "city": "南沙群岛"
        },
        {
            "parentId": "460300",
            "cityId": "460323",
            "spell": "zsqdddjjqhy",
            "city": "中沙群岛的岛礁及其海域"
        },
        {
            "parentId": "460000",
            "cityId": "469000",
            "spell": "szxxjxzqh",
            "city": "省直辖县级行政区划"
        },
        {
            "parentId": "469000",
            "cityId": "469001",
            "spell": "wzss",
            "city": "五指山市"
        },
        {
            "parentId": "469000",
            "cityId": "469002",
            "spell": "qhs",
            "city": "琼海市"
        },
        {
            "parentId": "469000",
            "cityId": "469003",
            "spell": "dzs",
            "city": "儋州市"
        },
        {
            "parentId": "469000",
            "cityId": "469005",
            "spell": "wcs",
            "city": "文昌市"
        },
        {
            "parentId": "469000",
            "cityId": "469006",
            "spell": "wns",
            "city": "万宁市"
        },
        {
            "parentId": "469000",
            "cityId": "469007",
            "spell": "dfs",
            "city": "东方市"
        },
        {
            "parentId": "469000",
            "cityId": "469021",
            "spell": "dax",
            "city": "定安县"
        },
        {
            "parentId": "469000",
            "cityId": "469022",
            "spell": "tcx",
            "city": "屯昌县"
        },
        {
            "parentId": "469000",
            "cityId": "469023",
            "spell": "cmx",
            "city": "澄迈县"
        },
        {
            "parentId": "469000",
            "cityId": "469024",
            "spell": "lgx",
            "city": "临高县"
        },
        {
            "parentId": "469000",
            "cityId": "469025",
            "spell": "bslzzzx",
            "city": "白沙黎族自治县"
        },
        {
            "parentId": "469000",
            "cityId": "469026",
            "spell": "cjlzzzx",
            "city": "昌江黎族自治县"
        },
        {
            "parentId": "469000",
            "cityId": "469027",
            "spell": "ldlzzzx",
            "city": "乐东黎族自治县"
        },
        {
            "parentId": "469000",
            "cityId": "469028",
            "spell": "lslzzzx",
            "city": "陵水黎族自治县"
        },
        {
            "parentId": "469000",
            "cityId": "469029",
            "spell": "btlzmzzzx",
            "city": "保亭黎族苗族自治县"
        },
        {
            "parentId": "469000",
            "cityId": "469030",
            "spell": "qzlzmzzzx",
            "city": "琼中黎族苗族自治县"
        },
        {
            "parentId": "0",
            "cityId": "500000",
            "spell": "cqs",
            "city": "重庆市"
        },
        {
            "parentId": "500000",
            "cityId": "500100",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "500100",
            "cityId": "500101",
            "spell": "wzq",
            "city": "万州区"
        },
        {
            "parentId": "500100",
            "cityId": "500102",
            "spell": "flq",
            "city": "涪陵区"
        },
        {
            "parentId": "500100",
            "cityId": "500103",
            "spell": "yzq",
            "city": "渝中区"
        },
        {
            "parentId": "500100",
            "cityId": "500104",
            "spell": "ddkq",
            "city": "大渡口区"
        },
        {
            "parentId": "500100",
            "cityId": "500105",
            "spell": "jbq",
            "city": "江北区"
        },
        {
            "parentId": "500100",
            "cityId": "500106",
            "spell": "spbq",
            "city": "沙坪坝区"
        },
        {
            "parentId": "500100",
            "cityId": "500107",
            "spell": "jlpq",
            "city": "九龙坡区"
        },
        {
            "parentId": "500100",
            "cityId": "500108",
            "spell": "naq",
            "city": "南岸区"
        },
        {
            "parentId": "500100",
            "cityId": "500109",
            "spell": "bbq",
            "city": "北碚区"
        },
        {
            "parentId": "500100",
            "cityId": "500110",
            "spell": "qjq",
            "city": "綦江区"
        },
        {
            "parentId": "500100",
            "cityId": "500111",
            "spell": "dzq",
            "city": "大足区"
        },
        {
            "parentId": "500100",
            "cityId": "500112",
            "spell": "ybq",
            "city": "渝北区"
        },
        {
            "parentId": "500100",
            "cityId": "500113",
            "spell": "bnq",
            "city": "巴南区"
        },
        {
            "parentId": "500100",
            "cityId": "500114",
            "spell": "qjq",
            "city": "黔江区"
        },
        {
            "parentId": "500100",
            "cityId": "500115",
            "spell": "csq",
            "city": "长寿区"
        },
        {
            "parentId": "500100",
            "cityId": "500116",
            "spell": "jjq",
            "city": "江津区"
        },
        {
            "parentId": "500100",
            "cityId": "500117",
            "spell": "hcq",
            "city": "合川区"
        },
        {
            "parentId": "500100",
            "cityId": "500118",
            "spell": "ycq",
            "city": "永川区"
        },
        {
            "parentId": "500100",
            "cityId": "500119",
            "spell": "ncq",
            "city": "南川区"
        },
        {
            "parentId": "500000",
            "cityId": "500200",
            "spell": "x",
            "city": "县"
        },
        {
            "parentId": "500200",
            "cityId": "500223",
            "spell": "tnx",
            "city": "潼南县"
        },
        {
            "parentId": "500200",
            "cityId": "500224",
            "spell": "tlx",
            "city": "铜梁县"
        },
        {
            "parentId": "500200",
            "cityId": "500226",
            "spell": "rcx",
            "city": "荣昌县"
        },
        {
            "parentId": "500200",
            "cityId": "500227",
            "spell": "bsx",
            "city": "璧山县"
        },
        {
            "parentId": "500200",
            "cityId": "500228",
            "spell": "lpx",
            "city": "梁平县"
        },
        {
            "parentId": "500200",
            "cityId": "500229",
            "spell": "ckx",
            "city": "城口县"
        },
        {
            "parentId": "500200",
            "cityId": "500230",
            "spell": "fdx",
            "city": "丰都县"
        },
        {
            "parentId": "500200",
            "cityId": "500231",
            "spell": "djx",
            "city": "垫江县"
        },
        {
            "parentId": "500200",
            "cityId": "500232",
            "spell": "wlx",
            "city": "武隆县"
        },
        {
            "parentId": "500200",
            "cityId": "500233",
            "spell": "zx",
            "city": "忠县"
        },
        {
            "parentId": "500200",
            "cityId": "500234",
            "spell": "kx",
            "city": "开县"
        },
        {
            "parentId": "500200",
            "cityId": "500235",
            "spell": "yyx",
            "city": "云阳县"
        },
        {
            "parentId": "500200",
            "cityId": "500236",
            "spell": "fjx",
            "city": "奉节县"
        },
        {
            "parentId": "500200",
            "cityId": "500237",
            "spell": "wsx",
            "city": "巫山县"
        },
        {
            "parentId": "500200",
            "cityId": "500238",
            "spell": "wxx",
            "city": "巫溪县"
        },
        {
            "parentId": "500200",
            "cityId": "500240",
            "spell": "sztjzzzx",
            "city": "石柱土家族自治县"
        },
        {
            "parentId": "500200",
            "cityId": "500241",
            "spell": "xstjzmzzzx",
            "city": "秀山土家族苗族自治县"
        },
        {
            "parentId": "500200",
            "cityId": "500242",
            "spell": "yytjzmzzzx",
            "city": "酉阳土家族苗族自治县"
        },
        {
            "parentId": "500200",
            "cityId": "500243",
            "spell": "psmztjzzzx",
            "city": "彭水苗族土家族自治县"
        },
        {
            "parentId": "0",
            "cityId": "510000",
            "spell": "scs",
            "city": "四川省"
        },
        {
            "parentId": "510000",
            "cityId": "510100",
            "spell": "cds",
            "city": "成都市"
        },
        {
            "parentId": "510100",
            "cityId": "510101",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "510100",
            "cityId": "510104",
            "spell": "jjq",
            "city": "锦江区"
        },
        {
            "parentId": "510100",
            "cityId": "510105",
            "spell": "qyq",
            "city": "青羊区"
        },
        {
            "parentId": "510100",
            "cityId": "510106",
            "spell": "jnq",
            "city": "金牛区"
        },
        {
            "parentId": "510100",
            "cityId": "510107",
            "spell": "whq",
            "city": "武侯区"
        },
        {
            "parentId": "510100",
            "cityId": "510108",
            "spell": "chq",
            "city": "成华区"
        },
        {
            "parentId": "510100",
            "cityId": "510112",
            "spell": "lqyq",
            "city": "龙泉驿区"
        },
        {
            "parentId": "510100",
            "cityId": "510113",
            "spell": "qbjq",
            "city": "青白江区"
        },
        {
            "parentId": "510100",
            "cityId": "510114",
            "spell": "xdq",
            "city": "新都区"
        },
        {
            "parentId": "510100",
            "cityId": "510115",
            "spell": "wjq",
            "city": "温江区"
        },
        {
            "parentId": "510100",
            "cityId": "510121",
            "spell": "jtx",
            "city": "金堂县"
        },
        {
            "parentId": "510100",
            "cityId": "510122",
            "spell": "slx",
            "city": "双流县"
        },
        {
            "parentId": "510100",
            "cityId": "510124",
            "spell": "px",
            "city": "郫县"
        },
        {
            "parentId": "510100",
            "cityId": "510129",
            "spell": "dyx",
            "city": "大邑县"
        },
        {
            "parentId": "510100",
            "cityId": "510131",
            "spell": "pjx",
            "city": "蒲江县"
        },
        {
            "parentId": "510100",
            "cityId": "510132",
            "spell": "xjx",
            "city": "新津县"
        },
        {
            "parentId": "510100",
            "cityId": "510181",
            "spell": "djys",
            "city": "都江堰市"
        },
        {
            "parentId": "510100",
            "cityId": "510182",
            "spell": "pzs",
            "city": "彭州市"
        },
        {
            "parentId": "510100",
            "cityId": "510183",
            "spell": "qls",
            "city": "邛崃市"
        },
        {
            "parentId": "510100",
            "cityId": "510184",
            "spell": "czs",
            "city": "崇州市"
        },
        {
            "parentId": "510000",
            "cityId": "510300",
            "spell": "zgs",
            "city": "自贡市"
        },
        {
            "parentId": "510300",
            "cityId": "510301",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "510300",
            "cityId": "510302",
            "spell": "zljq",
            "city": "自流井区"
        },
        {
            "parentId": "510300",
            "cityId": "510303",
            "spell": "gjq",
            "city": "贡井区"
        },
        {
            "parentId": "510300",
            "cityId": "510304",
            "spell": "daq",
            "city": "大安区"
        },
        {
            "parentId": "510300",
            "cityId": "510311",
            "spell": "ytq",
            "city": "沿滩区"
        },
        {
            "parentId": "510300",
            "cityId": "510321",
            "spell": "rx",
            "city": "荣县"
        },
        {
            "parentId": "510300",
            "cityId": "510322",
            "spell": "fsx",
            "city": "富顺县"
        },
        {
            "parentId": "510000",
            "cityId": "510400",
            "spell": "pzhs",
            "city": "攀枝花市"
        },
        {
            "parentId": "510400",
            "cityId": "510401",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "510400",
            "cityId": "510402",
            "spell": "dq",
            "city": "东区"
        },
        {
            "parentId": "510400",
            "cityId": "510403",
            "spell": "xq",
            "city": "西区"
        },
        {
            "parentId": "510400",
            "cityId": "510411",
            "spell": "rhq",
            "city": "仁和区"
        },
        {
            "parentId": "510400",
            "cityId": "510421",
            "spell": "myx",
            "city": "米易县"
        },
        {
            "parentId": "510400",
            "cityId": "510422",
            "spell": "ybx",
            "city": "盐边县"
        },
        {
            "parentId": "510000",
            "cityId": "510500",
            "spell": "lzs",
            "city": "泸州市"
        },
        {
            "parentId": "510500",
            "cityId": "510501",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "510500",
            "cityId": "510502",
            "spell": "jyq",
            "city": "江阳区"
        },
        {
            "parentId": "510500",
            "cityId": "510503",
            "spell": "nxq",
            "city": "纳溪区"
        },
        {
            "parentId": "510500",
            "cityId": "510504",
            "spell": "lmtq",
            "city": "龙马潭区"
        },
        {
            "parentId": "510500",
            "cityId": "510521",
            "spell": "lx",
            "city": "泸县"
        },
        {
            "parentId": "510500",
            "cityId": "510522",
            "spell": "hjx",
            "city": "合江县"
        },
        {
            "parentId": "510500",
            "cityId": "510524",
            "spell": "xyx",
            "city": "叙永县"
        },
        {
            "parentId": "510500",
            "cityId": "510525",
            "spell": "glx",
            "city": "古蔺县"
        },
        {
            "parentId": "510000",
            "cityId": "510600",
            "spell": "dys",
            "city": "德阳市"
        },
        {
            "parentId": "510600",
            "cityId": "510601",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "510600",
            "cityId": "510603",
            "spell": "jyq",
            "city": "旌阳区"
        },
        {
            "parentId": "510600",
            "cityId": "510623",
            "spell": "zjx",
            "city": "中江县"
        },
        {
            "parentId": "510600",
            "cityId": "510626",
            "spell": "ljx",
            "city": "罗江县"
        },
        {
            "parentId": "510600",
            "cityId": "510681",
            "spell": "ghs",
            "city": "广汉市"
        },
        {
            "parentId": "510600",
            "cityId": "510682",
            "spell": "sfs",
            "city": "什邡市"
        },
        {
            "parentId": "510600",
            "cityId": "510683",
            "spell": "mzs",
            "city": "绵竹市"
        },
        {
            "parentId": "510000",
            "cityId": "510700",
            "spell": "mys",
            "city": "绵阳市"
        },
        {
            "parentId": "510700",
            "cityId": "510701",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "510700",
            "cityId": "510703",
            "spell": "fcq",
            "city": "涪城区"
        },
        {
            "parentId": "510700",
            "cityId": "510704",
            "spell": "yxq",
            "city": "游仙区"
        },
        {
            "parentId": "510700",
            "cityId": "510722",
            "spell": "stx",
            "city": "三台县"
        },
        {
            "parentId": "510700",
            "cityId": "510723",
            "spell": "ytx",
            "city": "盐亭县"
        },
        {
            "parentId": "510700",
            "cityId": "510724",
            "spell": "ax",
            "city": "安县"
        },
        {
            "parentId": "510700",
            "cityId": "510725",
            "spell": "ztx",
            "city": "梓潼县"
        },
        {
            "parentId": "510700",
            "cityId": "510726",
            "spell": "bcqzzzx",
            "city": "北川羌族自治县"
        },
        {
            "parentId": "510700",
            "cityId": "510727",
            "spell": "pwx",
            "city": "平武县"
        },
        {
            "parentId": "510700",
            "cityId": "510781",
            "spell": "jys",
            "city": "江油市"
        },
        {
            "parentId": "510000",
            "cityId": "510800",
            "spell": "gys",
            "city": "广元市"
        },
        {
            "parentId": "510800",
            "cityId": "510801",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "510800",
            "cityId": "510802",
            "spell": "lzq",
            "city": "利州区"
        },
        {
            "parentId": "510800",
            "cityId": "510811",
            "spell": "ybq",
            "city": "元坝区"
        },
        {
            "parentId": "510800",
            "cityId": "510812",
            "spell": "ctq",
            "city": "朝天区"
        },
        {
            "parentId": "510800",
            "cityId": "510821",
            "spell": "wcx",
            "city": "旺苍县"
        },
        {
            "parentId": "510800",
            "cityId": "510822",
            "spell": "qcx",
            "city": "青川县"
        },
        {
            "parentId": "510800",
            "cityId": "510823",
            "spell": "jgx",
            "city": "剑阁县"
        },
        {
            "parentId": "510800",
            "cityId": "510824",
            "spell": "cxx",
            "city": "苍溪县"
        },
        {
            "parentId": "510000",
            "cityId": "510900",
            "spell": "sns",
            "city": "遂宁市"
        },
        {
            "parentId": "510900",
            "cityId": "510901",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "510900",
            "cityId": "510903",
            "spell": "csq",
            "city": "船山区"
        },
        {
            "parentId": "510900",
            "cityId": "510904",
            "spell": "ajq",
            "city": "安居区"
        },
        {
            "parentId": "510900",
            "cityId": "510921",
            "spell": "pxx",
            "city": "蓬溪县"
        },
        {
            "parentId": "510900",
            "cityId": "510922",
            "spell": "shx",
            "city": "射洪县"
        },
        {
            "parentId": "510900",
            "cityId": "510923",
            "spell": "dyx",
            "city": "大英县"
        },
        {
            "parentId": "510000",
            "cityId": "511000",
            "spell": "njs",
            "city": "内江市"
        },
        {
            "parentId": "511000",
            "cityId": "511001",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "511000",
            "cityId": "511002",
            "spell": "szq",
            "city": "市中区"
        },
        {
            "parentId": "511000",
            "cityId": "511011",
            "spell": "dxq",
            "city": "东兴区"
        },
        {
            "parentId": "511000",
            "cityId": "511024",
            "spell": "wyx",
            "city": "威远县"
        },
        {
            "parentId": "511000",
            "cityId": "511025",
            "spell": "zzx",
            "city": "资中县"
        },
        {
            "parentId": "511000",
            "cityId": "511028",
            "spell": "lcx",
            "city": "隆昌县"
        },
        {
            "parentId": "510000",
            "cityId": "511100",
            "spell": "lss",
            "city": "乐山市"
        },
        {
            "parentId": "511100",
            "cityId": "511101",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "511100",
            "cityId": "511102",
            "spell": "szq",
            "city": "市中区"
        },
        {
            "parentId": "511100",
            "cityId": "511111",
            "spell": "swq",
            "city": "沙湾区"
        },
        {
            "parentId": "511100",
            "cityId": "511112",
            "spell": "wtqq",
            "city": "五通桥区"
        },
        {
            "parentId": "511100",
            "cityId": "511113",
            "spell": "jkhq",
            "city": "金口河区"
        },
        {
            "parentId": "511100",
            "cityId": "511123",
            "spell": "jwx",
            "city": "犍为县"
        },
        {
            "parentId": "511100",
            "cityId": "511124",
            "spell": "jyx",
            "city": "井研县"
        },
        {
            "parentId": "511100",
            "cityId": "511126",
            "spell": "jjx",
            "city": "夹江县"
        },
        {
            "parentId": "511100",
            "cityId": "511129",
            "spell": "mcx",
            "city": "沐川县"
        },
        {
            "parentId": "511100",
            "cityId": "511132",
            "spell": "ebyzzzx",
            "city": "峨边彝族自治县"
        },
        {
            "parentId": "511100",
            "cityId": "511133",
            "spell": "mbyzzzx",
            "city": "马边彝族自治县"
        },
        {
            "parentId": "511100",
            "cityId": "511181",
            "spell": "emss",
            "city": "峨眉山市"
        },
        {
            "parentId": "510000",
            "cityId": "511300",
            "spell": "ncs",
            "city": "南充市"
        },
        {
            "parentId": "511300",
            "cityId": "511301",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "511300",
            "cityId": "511302",
            "spell": "sqq",
            "city": "顺庆区"
        },
        {
            "parentId": "511300",
            "cityId": "511303",
            "spell": "gpq",
            "city": "高坪区"
        },
        {
            "parentId": "511300",
            "cityId": "511304",
            "spell": "jlq",
            "city": "嘉陵区"
        },
        {
            "parentId": "511300",
            "cityId": "511321",
            "spell": "nbx",
            "city": "南部县"
        },
        {
            "parentId": "511300",
            "cityId": "511322",
            "spell": "ysx",
            "city": "营山县"
        },
        {
            "parentId": "511300",
            "cityId": "511323",
            "spell": "pax",
            "city": "蓬安县"
        },
        {
            "parentId": "511300",
            "cityId": "511324",
            "spell": "ylx",
            "city": "仪陇县"
        },
        {
            "parentId": "511300",
            "cityId": "511325",
            "spell": "xcx",
            "city": "西充县"
        },
        {
            "parentId": "511300",
            "cityId": "511381",
            "spell": "lzs",
            "city": "阆中市"
        },
        {
            "parentId": "510000",
            "cityId": "511400",
            "spell": "mss",
            "city": "眉山市"
        },
        {
            "parentId": "511400",
            "cityId": "511401",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "511400",
            "cityId": "511402",
            "spell": "dpq",
            "city": "东坡区"
        },
        {
            "parentId": "511400",
            "cityId": "511421",
            "spell": "rsx",
            "city": "仁寿县"
        },
        {
            "parentId": "511400",
            "cityId": "511422",
            "spell": "psx",
            "city": "彭山县"
        },
        {
            "parentId": "511400",
            "cityId": "511423",
            "spell": "hyx",
            "city": "洪雅县"
        },
        {
            "parentId": "511400",
            "cityId": "511424",
            "spell": "dlx",
            "city": "丹棱县"
        },
        {
            "parentId": "511400",
            "cityId": "511425",
            "spell": "qsx",
            "city": "青神县"
        },
        {
            "parentId": "510000",
            "cityId": "511500",
            "spell": "ybs",
            "city": "宜宾市"
        },
        {
            "parentId": "511500",
            "cityId": "511501",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "511500",
            "cityId": "511502",
            "spell": "cpq",
            "city": "翠屏区"
        },
        {
            "parentId": "511500",
            "cityId": "511503",
            "spell": "nxq",
            "city": "南溪区"
        },
        {
            "parentId": "511500",
            "cityId": "511521",
            "spell": "ybx",
            "city": "宜宾县"
        },
        {
            "parentId": "511500",
            "cityId": "511523",
            "spell": "jax",
            "city": "江安县"
        },
        {
            "parentId": "511500",
            "cityId": "511524",
            "spell": "cnx",
            "city": "长宁县"
        },
        {
            "parentId": "511500",
            "cityId": "511525",
            "spell": "gx",
            "city": "高县"
        },
        {
            "parentId": "511500",
            "cityId": "511526",
            "spell": "gx",
            "city": "珙县"
        },
        {
            "parentId": "511500",
            "cityId": "511527",
            "spell": "ylx",
            "city": "筠连县"
        },
        {
            "parentId": "511500",
            "cityId": "511528",
            "spell": "xwx",
            "city": "兴文县"
        },
        {
            "parentId": "511500",
            "cityId": "511529",
            "spell": "psx",
            "city": "屏山县"
        },
        {
            "parentId": "510000",
            "cityId": "511600",
            "spell": "gas",
            "city": "广安市"
        },
        {
            "parentId": "511600",
            "cityId": "511601",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "511600",
            "cityId": "511602",
            "spell": "gaq",
            "city": "广安区"
        },
        {
            "parentId": "511600",
            "cityId": "511603",
            "spell": "qfq",
            "city": "前锋区"
        },
        {
            "parentId": "511600",
            "cityId": "511621",
            "spell": "ycx",
            "city": "岳池县"
        },
        {
            "parentId": "511600",
            "cityId": "511622",
            "spell": "wsx",
            "city": "武胜县"
        },
        {
            "parentId": "511600",
            "cityId": "511623",
            "spell": "lsx",
            "city": "邻水县"
        },
        {
            "parentId": "511600",
            "cityId": "511681",
            "spell": "hys",
            "city": "华蓥市"
        },
        {
            "parentId": "510000",
            "cityId": "511700",
            "spell": "dzs",
            "city": "达州市"
        },
        {
            "parentId": "511700",
            "cityId": "511701",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "511700",
            "cityId": "511702",
            "spell": "tcq",
            "city": "通川区"
        },
        {
            "parentId": "511700",
            "cityId": "511703",
            "spell": "dcq",
            "city": "达川区"
        },
        {
            "parentId": "511700",
            "cityId": "511722",
            "spell": "xhx",
            "city": "宣汉县"
        },
        {
            "parentId": "511700",
            "cityId": "511723",
            "spell": "kjx",
            "city": "开江县"
        },
        {
            "parentId": "511700",
            "cityId": "511724",
            "spell": "dzx",
            "city": "大竹县"
        },
        {
            "parentId": "511700",
            "cityId": "511725",
            "spell": "qx",
            "city": "渠县"
        },
        {
            "parentId": "511700",
            "cityId": "511781",
            "spell": "wys",
            "city": "万源市"
        },
        {
            "parentId": "510000",
            "cityId": "511800",
            "spell": "yas",
            "city": "雅安市"
        },
        {
            "parentId": "511800",
            "cityId": "511801",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "511800",
            "cityId": "511802",
            "spell": "ycq",
            "city": "雨城区"
        },
        {
            "parentId": "511800",
            "cityId": "511803",
            "spell": "msq",
            "city": "名山区"
        },
        {
            "parentId": "511800",
            "cityId": "511822",
            "spell": "xjx",
            "city": "荥经县"
        },
        {
            "parentId": "511800",
            "cityId": "511823",
            "spell": "hyx",
            "city": "汉源县"
        },
        {
            "parentId": "511800",
            "cityId": "511824",
            "spell": "smx",
            "city": "石棉县"
        },
        {
            "parentId": "511800",
            "cityId": "511825",
            "spell": "tqx",
            "city": "天全县"
        },
        {
            "parentId": "511800",
            "cityId": "511826",
            "spell": "lsx",
            "city": "芦山县"
        },
        {
            "parentId": "511800",
            "cityId": "511827",
            "spell": "bxx",
            "city": "宝兴县"
        },
        {
            "parentId": "510000",
            "cityId": "511900",
            "spell": "bzs",
            "city": "巴中市"
        },
        {
            "parentId": "511900",
            "cityId": "511901",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "511900",
            "cityId": "511902",
            "spell": "bzq",
            "city": "巴州区"
        },
        {
            "parentId": "511900",
            "cityId": "511903",
            "spell": "eyq",
            "city": "恩阳区"
        },
        {
            "parentId": "511900",
            "cityId": "511921",
            "spell": "tjx",
            "city": "通江县"
        },
        {
            "parentId": "511900",
            "cityId": "511922",
            "spell": "njx",
            "city": "南江县"
        },
        {
            "parentId": "511900",
            "cityId": "511923",
            "spell": "pcx",
            "city": "平昌县"
        },
        {
            "parentId": "510000",
            "cityId": "512000",
            "spell": "zys",
            "city": "资阳市"
        },
        {
            "parentId": "512000",
            "cityId": "512001",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "512000",
            "cityId": "512002",
            "spell": "yjq",
            "city": "雁江区"
        },
        {
            "parentId": "512000",
            "cityId": "512021",
            "spell": "ayx",
            "city": "安岳县"
        },
        {
            "parentId": "512000",
            "cityId": "512022",
            "spell": "lzx",
            "city": "乐至县"
        },
        {
            "parentId": "512000",
            "cityId": "512081",
            "spell": "jys",
            "city": "简阳市"
        },
        {
            "parentId": "510000",
            "cityId": "513200",
            "spell": "abczqzzzz",
            "city": "阿坝藏族羌族自治州"
        },
        {
            "parentId": "513200",
            "cityId": "513221",
            "spell": "wcx",
            "city": "汶川县"
        },
        {
            "parentId": "513200",
            "cityId": "513222",
            "spell": "lx",
            "city": "理县"
        },
        {
            "parentId": "513200",
            "cityId": "513223",
            "spell": "mx",
            "city": "茂县"
        },
        {
            "parentId": "513200",
            "cityId": "513224",
            "spell": "spx",
            "city": "松潘县"
        },
        {
            "parentId": "513200",
            "cityId": "513225",
            "spell": "jzgx",
            "city": "九寨沟县"
        },
        {
            "parentId": "513200",
            "cityId": "513226",
            "spell": "jcx",
            "city": "金川县"
        },
        {
            "parentId": "513200",
            "cityId": "513227",
            "spell": "xjx",
            "city": "小金县"
        },
        {
            "parentId": "513200",
            "cityId": "513228",
            "spell": "hsx",
            "city": "黑水县"
        },
        {
            "parentId": "513200",
            "cityId": "513229",
            "spell": "mekx",
            "city": "马尔康县"
        },
        {
            "parentId": "513200",
            "cityId": "513230",
            "spell": "rtx",
            "city": "壤塘县"
        },
        {
            "parentId": "513200",
            "cityId": "513231",
            "spell": "abx",
            "city": "阿坝县"
        },
        {
            "parentId": "513200",
            "cityId": "513232",
            "spell": "regx",
            "city": "若尔盖县"
        },
        {
            "parentId": "513200",
            "cityId": "513233",
            "spell": "hyx",
            "city": "红原县"
        },
        {
            "parentId": "510000",
            "cityId": "513300",
            "spell": "gzczzzz",
            "city": "甘孜藏族自治州"
        },
        {
            "parentId": "513300",
            "cityId": "513321",
            "spell": "kdx",
            "city": "康定县"
        },
        {
            "parentId": "513300",
            "cityId": "513322",
            "spell": "ldx",
            "city": "泸定县"
        },
        {
            "parentId": "513300",
            "cityId": "513323",
            "spell": "dbx",
            "city": "丹巴县"
        },
        {
            "parentId": "513300",
            "cityId": "513324",
            "spell": "jlx",
            "city": "九龙县"
        },
        {
            "parentId": "513300",
            "cityId": "513325",
            "spell": "yjx",
            "city": "雅江县"
        },
        {
            "parentId": "513300",
            "cityId": "513326",
            "spell": "dfx",
            "city": "道孚县"
        },
        {
            "parentId": "513300",
            "cityId": "513327",
            "spell": "lhx",
            "city": "炉霍县"
        },
        {
            "parentId": "513300",
            "cityId": "513328",
            "spell": "gzx",
            "city": "甘孜县"
        },
        {
            "parentId": "513300",
            "cityId": "513329",
            "spell": "xlx",
            "city": "新龙县"
        },
        {
            "parentId": "513300",
            "cityId": "513330",
            "spell": "dgx",
            "city": "德格县"
        },
        {
            "parentId": "513300",
            "cityId": "513331",
            "spell": "byx",
            "city": "白玉县"
        },
        {
            "parentId": "513300",
            "cityId": "513332",
            "spell": "sqx",
            "city": "石渠县"
        },
        {
            "parentId": "513300",
            "cityId": "513333",
            "spell": "sdx",
            "city": "色达县"
        },
        {
            "parentId": "513300",
            "cityId": "513334",
            "spell": "ltx",
            "city": "理塘县"
        },
        {
            "parentId": "513300",
            "cityId": "513335",
            "spell": "btx",
            "city": "巴塘县"
        },
        {
            "parentId": "513300",
            "cityId": "513336",
            "spell": "xcx",
            "city": "乡城县"
        },
        {
            "parentId": "513300",
            "cityId": "513337",
            "spell": "dcx",
            "city": "稻城县"
        },
        {
            "parentId": "513300",
            "cityId": "513338",
            "spell": "drx",
            "city": "得荣县"
        },
        {
            "parentId": "510000",
            "cityId": "513400",
            "spell": "lsyzzzz",
            "city": "凉山彝族自治州"
        },
        {
            "parentId": "513400",
            "cityId": "513401",
            "spell": "xcs",
            "city": "西昌市"
        },
        {
            "parentId": "513400",
            "cityId": "513422",
            "spell": "mlczzzx",
            "city": "木里藏族自治县"
        },
        {
            "parentId": "513400",
            "cityId": "513423",
            "spell": "yyx",
            "city": "盐源县"
        },
        {
            "parentId": "513400",
            "cityId": "513424",
            "spell": "dcx",
            "city": "德昌县"
        },
        {
            "parentId": "513400",
            "cityId": "513425",
            "spell": "hlx",
            "city": "会理县"
        },
        {
            "parentId": "513400",
            "cityId": "513426",
            "spell": "hdx",
            "city": "会东县"
        },
        {
            "parentId": "513400",
            "cityId": "513427",
            "spell": "nnx",
            "city": "宁南县"
        },
        {
            "parentId": "513400",
            "cityId": "513428",
            "spell": "pgx",
            "city": "普格县"
        },
        {
            "parentId": "513400",
            "cityId": "513429",
            "spell": "btx",
            "city": "布拖县"
        },
        {
            "parentId": "513400",
            "cityId": "513430",
            "spell": "jyx",
            "city": "金阳县"
        },
        {
            "parentId": "513400",
            "cityId": "513431",
            "spell": "zjx",
            "city": "昭觉县"
        },
        {
            "parentId": "513400",
            "cityId": "513432",
            "spell": "xdx",
            "city": "喜德县"
        },
        {
            "parentId": "513400",
            "cityId": "513433",
            "spell": "mnx",
            "city": "冕宁县"
        },
        {
            "parentId": "513400",
            "cityId": "513434",
            "spell": "yxx",
            "city": "越西县"
        },
        {
            "parentId": "513400",
            "cityId": "513435",
            "spell": "glx",
            "city": "甘洛县"
        },
        {
            "parentId": "513400",
            "cityId": "513436",
            "spell": "mgx",
            "city": "美姑县"
        },
        {
            "parentId": "513400",
            "cityId": "513437",
            "spell": "lbx",
            "city": "雷波县"
        },
        {
            "parentId": "0",
            "cityId": "520000",
            "spell": "gzs",
            "city": "贵州省"
        },
        {
            "parentId": "520000",
            "cityId": "520100",
            "spell": "gys",
            "city": "贵阳市"
        },
        {
            "parentId": "520100",
            "cityId": "520101",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "520100",
            "cityId": "520102",
            "spell": "nmq",
            "city": "南明区"
        },
        {
            "parentId": "520100",
            "cityId": "520103",
            "spell": "yyq",
            "city": "云岩区"
        },
        {
            "parentId": "520100",
            "cityId": "520111",
            "spell": "hxq",
            "city": "花溪区"
        },
        {
            "parentId": "520100",
            "cityId": "520112",
            "spell": "wdq",
            "city": "乌当区"
        },
        {
            "parentId": "520100",
            "cityId": "520113",
            "spell": "byq",
            "city": "白云区"
        },
        {
            "parentId": "520100",
            "cityId": "520115",
            "spell": "gshq",
            "city": "观山湖区"
        },
        {
            "parentId": "520100",
            "cityId": "520121",
            "spell": "kyx",
            "city": "开阳县"
        },
        {
            "parentId": "520100",
            "cityId": "520122",
            "spell": "xfx",
            "city": "息烽县"
        },
        {
            "parentId": "520100",
            "cityId": "520123",
            "spell": "xwx",
            "city": "修文县"
        },
        {
            "parentId": "520100",
            "cityId": "520181",
            "spell": "qzs",
            "city": "清镇市"
        },
        {
            "parentId": "520000",
            "cityId": "520200",
            "spell": "lpss",
            "city": "六盘水市"
        },
        {
            "parentId": "520200",
            "cityId": "520201",
            "spell": "zsq",
            "city": "钟山区"
        },
        {
            "parentId": "520200",
            "cityId": "520203",
            "spell": "lztq",
            "city": "六枝特区"
        },
        {
            "parentId": "520200",
            "cityId": "520221",
            "spell": "scx",
            "city": "水城县"
        },
        {
            "parentId": "520200",
            "cityId": "520222",
            "spell": "px",
            "city": "盘县"
        },
        {
            "parentId": "520000",
            "cityId": "520300",
            "spell": "zys",
            "city": "遵义市"
        },
        {
            "parentId": "520300",
            "cityId": "520301",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "520300",
            "cityId": "520302",
            "spell": "hhgq",
            "city": "红花岗区"
        },
        {
            "parentId": "520300",
            "cityId": "520303",
            "spell": "hcq",
            "city": "汇川区"
        },
        {
            "parentId": "520300",
            "cityId": "520321",
            "spell": "zyx",
            "city": "遵义县"
        },
        {
            "parentId": "520300",
            "cityId": "520322",
            "spell": "tzx",
            "city": "桐梓县"
        },
        {
            "parentId": "520300",
            "cityId": "520323",
            "spell": "syx",
            "city": "绥阳县"
        },
        {
            "parentId": "520300",
            "cityId": "520324",
            "spell": "zax",
            "city": "正安县"
        },
        {
            "parentId": "520300",
            "cityId": "520325",
            "spell": "dzylzmzzzx",
            "city": "道真仡佬族苗族自治县"
        },
        {
            "parentId": "520300",
            "cityId": "520326",
            "spell": "wcylzmzzzx",
            "city": "务川仡佬族苗族自治县"
        },
        {
            "parentId": "520300",
            "cityId": "520327",
            "spell": "fgx",
            "city": "凤冈县"
        },
        {
            "parentId": "520300",
            "cityId": "520328",
            "spell": "mtx",
            "city": "湄潭县"
        },
        {
            "parentId": "520300",
            "cityId": "520329",
            "spell": "yqx",
            "city": "余庆县"
        },
        {
            "parentId": "520300",
            "cityId": "520330",
            "spell": "xsx",
            "city": "习水县"
        },
        {
            "parentId": "520300",
            "cityId": "520381",
            "spell": "css",
            "city": "赤水市"
        },
        {
            "parentId": "520300",
            "cityId": "520382",
            "spell": "rhs",
            "city": "仁怀市"
        },
        {
            "parentId": "520000",
            "cityId": "520400",
            "spell": "ass",
            "city": "安顺市"
        },
        {
            "parentId": "520400",
            "cityId": "520401",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "520400",
            "cityId": "520402",
            "spell": "xxq",
            "city": "西秀区"
        },
        {
            "parentId": "520400",
            "cityId": "520421",
            "spell": "pbx",
            "city": "平坝县"
        },
        {
            "parentId": "520400",
            "cityId": "520422",
            "spell": "pdx",
            "city": "普定县"
        },
        {
            "parentId": "520400",
            "cityId": "520423",
            "spell": "znbyzmzzzx",
            "city": "镇宁布依族苗族自治县"
        },
        {
            "parentId": "520400",
            "cityId": "520424",
            "spell": "glbyzmzzzx",
            "city": "关岭布依族苗族自治县"
        },
        {
            "parentId": "520400",
            "cityId": "520425",
            "spell": "zymzbyzzzx",
            "city": "紫云苗族布依族自治县"
        },
        {
            "parentId": "520000",
            "cityId": "520500",
            "spell": "bjs",
            "city": "毕节市"
        },
        {
            "parentId": "520500",
            "cityId": "520501",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "520500",
            "cityId": "520502",
            "spell": "qxgq",
            "city": "七星关区"
        },
        {
            "parentId": "520500",
            "cityId": "520521",
            "spell": "dfx",
            "city": "大方县"
        },
        {
            "parentId": "520500",
            "cityId": "520522",
            "spell": "qxx",
            "city": "黔西县"
        },
        {
            "parentId": "520500",
            "cityId": "520523",
            "spell": "jsx",
            "city": "金沙县"
        },
        {
            "parentId": "520500",
            "cityId": "520524",
            "spell": "zjx",
            "city": "织金县"
        },
        {
            "parentId": "520500",
            "cityId": "520525",
            "spell": "nyx",
            "city": "纳雍县"
        },
        {
            "parentId": "520500",
            "cityId": "520526",
            "spell": "wnyzhzmzzzx",
            "city": "威宁彝族回族苗族自治县"
        },
        {
            "parentId": "520500",
            "cityId": "520527",
            "spell": "hzx",
            "city": "赫章县"
        },
        {
            "parentId": "520000",
            "cityId": "520600",
            "spell": "trs",
            "city": "铜仁市"
        },
        {
            "parentId": "520600",
            "cityId": "520601",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "520600",
            "cityId": "520602",
            "spell": "bjq",
            "city": "碧江区"
        },
        {
            "parentId": "520600",
            "cityId": "520603",
            "spell": "wsq",
            "city": "万山区"
        },
        {
            "parentId": "520600",
            "cityId": "520621",
            "spell": "jkx",
            "city": "江口县"
        },
        {
            "parentId": "520600",
            "cityId": "520622",
            "spell": "ypdzzzx",
            "city": "玉屏侗族自治县"
        },
        {
            "parentId": "520600",
            "cityId": "520623",
            "spell": "sqx",
            "city": "石阡县"
        },
        {
            "parentId": "520600",
            "cityId": "520624",
            "spell": "snx",
            "city": "思南县"
        },
        {
            "parentId": "520600",
            "cityId": "520625",
            "spell": "yjtjzmzzzx",
            "city": "印江土家族苗族自治县"
        },
        {
            "parentId": "520600",
            "cityId": "520626",
            "spell": "djx",
            "city": "德江县"
        },
        {
            "parentId": "520600",
            "cityId": "520627",
            "spell": "yhtjzzzx",
            "city": "沿河土家族自治县"
        },
        {
            "parentId": "520600",
            "cityId": "520628",
            "spell": "stmzzzx",
            "city": "松桃苗族自治县"
        },
        {
            "parentId": "520000",
            "cityId": "522300",
            "spell": "qxnbyzmzzzz",
            "city": "黔西南布依族苗族自治州"
        },
        {
            "parentId": "522300",
            "cityId": "522301",
            "spell": "xys",
            "city": "兴义市"
        },
        {
            "parentId": "522300",
            "cityId": "522322",
            "spell": "xrx",
            "city": "兴仁县"
        },
        {
            "parentId": "522300",
            "cityId": "522323",
            "spell": "pax",
            "city": "普安县"
        },
        {
            "parentId": "522300",
            "cityId": "522324",
            "spell": "qlx",
            "city": "晴隆县"
        },
        {
            "parentId": "522300",
            "cityId": "522325",
            "spell": "zfx",
            "city": "贞丰县"
        },
        {
            "parentId": "522300",
            "cityId": "522326",
            "spell": "wmx",
            "city": "望谟县"
        },
        {
            "parentId": "522300",
            "cityId": "522327",
            "spell": "chx",
            "city": "册亨县"
        },
        {
            "parentId": "522300",
            "cityId": "522328",
            "spell": "alx",
            "city": "安龙县"
        },
        {
            "parentId": "520000",
            "cityId": "522600",
            "spell": "qdnmzdzzzz",
            "city": "黔东南苗族侗族自治州"
        },
        {
            "parentId": "522600",
            "cityId": "522601",
            "spell": "kls",
            "city": "凯里市"
        },
        {
            "parentId": "522600",
            "cityId": "522622",
            "spell": "hpx",
            "city": "黄平县"
        },
        {
            "parentId": "522600",
            "cityId": "522623",
            "spell": "sbx",
            "city": "施秉县"
        },
        {
            "parentId": "522600",
            "cityId": "522624",
            "spell": "ssx",
            "city": "三穗县"
        },
        {
            "parentId": "522600",
            "cityId": "522625",
            "spell": "zyx",
            "city": "镇远县"
        },
        {
            "parentId": "522600",
            "cityId": "522626",
            "spell": "cgx",
            "city": "岑巩县"
        },
        {
            "parentId": "522600",
            "cityId": "522627",
            "spell": "tzx",
            "city": "天柱县"
        },
        {
            "parentId": "522600",
            "cityId": "522628",
            "spell": "jpx",
            "city": "锦屏县"
        },
        {
            "parentId": "522600",
            "cityId": "522629",
            "spell": "jhx",
            "city": "剑河县"
        },
        {
            "parentId": "522600",
            "cityId": "522630",
            "spell": "tjx",
            "city": "台江县"
        },
        {
            "parentId": "522600",
            "cityId": "522631",
            "spell": "lpx",
            "city": "黎平县"
        },
        {
            "parentId": "522600",
            "cityId": "522632",
            "spell": "rjx",
            "city": "榕江县"
        },
        {
            "parentId": "522600",
            "cityId": "522633",
            "spell": "cjx",
            "city": "从江县"
        },
        {
            "parentId": "522600",
            "cityId": "522634",
            "spell": "lsx",
            "city": "雷山县"
        },
        {
            "parentId": "522600",
            "cityId": "522635",
            "spell": "mjx",
            "city": "麻江县"
        },
        {
            "parentId": "522600",
            "cityId": "522636",
            "spell": "dzx",
            "city": "丹寨县"
        },
        {
            "parentId": "520000",
            "cityId": "522700",
            "spell": "qnbyzmzzzz",
            "city": "黔南布依族苗族自治州"
        },
        {
            "parentId": "522700",
            "cityId": "522701",
            "spell": "dys",
            "city": "都匀市"
        },
        {
            "parentId": "522700",
            "cityId": "522702",
            "spell": "fqs",
            "city": "福泉市"
        },
        {
            "parentId": "522700",
            "cityId": "522722",
            "spell": "lbx",
            "city": "荔波县"
        },
        {
            "parentId": "522700",
            "cityId": "522723",
            "spell": "gdx",
            "city": "贵定县"
        },
        {
            "parentId": "522700",
            "cityId": "522725",
            "spell": "wax",
            "city": "瓮安县"
        },
        {
            "parentId": "522700",
            "cityId": "522726",
            "spell": "dsx",
            "city": "独山县"
        },
        {
            "parentId": "522700",
            "cityId": "522727",
            "spell": "ptx",
            "city": "平塘县"
        },
        {
            "parentId": "522700",
            "cityId": "522728",
            "spell": "ldx",
            "city": "罗甸县"
        },
        {
            "parentId": "522700",
            "cityId": "522729",
            "spell": "csx",
            "city": "长顺县"
        },
        {
            "parentId": "522700",
            "cityId": "522730",
            "spell": "llx",
            "city": "龙里县"
        },
        {
            "parentId": "522700",
            "cityId": "522731",
            "spell": "hsx",
            "city": "惠水县"
        },
        {
            "parentId": "522700",
            "cityId": "522732",
            "spell": "sdszzzx",
            "city": "三都水族自治县"
        },
        {
            "parentId": "0",
            "cityId": "530000",
            "spell": "yns",
            "city": "云南省"
        },
        {
            "parentId": "530000",
            "cityId": "530100",
            "spell": "kms",
            "city": "昆明市"
        },
        {
            "parentId": "530100",
            "cityId": "530101",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "530100",
            "cityId": "530102",
            "spell": "whq",
            "city": "五华区"
        },
        {
            "parentId": "530100",
            "cityId": "530103",
            "spell": "plq",
            "city": "盘龙区"
        },
        {
            "parentId": "530100",
            "cityId": "530111",
            "spell": "gdq",
            "city": "官渡区"
        },
        {
            "parentId": "530100",
            "cityId": "530112",
            "spell": "xsq",
            "city": "西山区"
        },
        {
            "parentId": "530100",
            "cityId": "530113",
            "spell": "dcq",
            "city": "东川区"
        },
        {
            "parentId": "530100",
            "cityId": "530114",
            "spell": "cgq",
            "city": "呈贡区"
        },
        {
            "parentId": "530100",
            "cityId": "530122",
            "spell": "jnx",
            "city": "晋宁县"
        },
        {
            "parentId": "530100",
            "cityId": "530124",
            "spell": "fmx",
            "city": "富民县"
        },
        {
            "parentId": "530100",
            "cityId": "530125",
            "spell": "ylx",
            "city": "宜良县"
        },
        {
            "parentId": "530100",
            "cityId": "530126",
            "spell": "slyzzzx",
            "city": "石林彝族自治县"
        },
        {
            "parentId": "530100",
            "cityId": "530127",
            "spell": "smx",
            "city": "嵩明县"
        },
        {
            "parentId": "530100",
            "cityId": "530128",
            "spell": "lqyzmzzzx",
            "city": "禄劝彝族苗族自治县"
        },
        {
            "parentId": "530100",
            "cityId": "530129",
            "spell": "xdhzyzzzx",
            "city": "寻甸回族彝族自治县"
        },
        {
            "parentId": "530100",
            "cityId": "530181",
            "spell": "ans",
            "city": "安宁市"
        },
        {
            "parentId": "530000",
            "cityId": "530300",
            "spell": "qjs",
            "city": "曲靖市"
        },
        {
            "parentId": "530300",
            "cityId": "530301",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "530300",
            "cityId": "530302",
            "spell": "qlq",
            "city": "麒麟区"
        },
        {
            "parentId": "530300",
            "cityId": "530321",
            "spell": "mlx",
            "city": "马龙县"
        },
        {
            "parentId": "530300",
            "cityId": "530322",
            "spell": "llx",
            "city": "陆良县"
        },
        {
            "parentId": "530300",
            "cityId": "530323",
            "spell": "szx",
            "city": "师宗县"
        },
        {
            "parentId": "530300",
            "cityId": "530324",
            "spell": "lpx",
            "city": "罗平县"
        },
        {
            "parentId": "530300",
            "cityId": "530325",
            "spell": "fyx",
            "city": "富源县"
        },
        {
            "parentId": "530300",
            "cityId": "530326",
            "spell": "hzx",
            "city": "会泽县"
        },
        {
            "parentId": "530300",
            "cityId": "530328",
            "spell": "zyx",
            "city": "沾益县"
        },
        {
            "parentId": "530300",
            "cityId": "530381",
            "spell": "xws",
            "city": "宣威市"
        },
        {
            "parentId": "530000",
            "cityId": "530400",
            "spell": "yxs",
            "city": "玉溪市"
        },
        {
            "parentId": "530400",
            "cityId": "530401",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "530400",
            "cityId": "530402",
            "spell": "htq",
            "city": "红塔区"
        },
        {
            "parentId": "530400",
            "cityId": "530421",
            "spell": "jcx",
            "city": "江川县"
        },
        {
            "parentId": "530400",
            "cityId": "530422",
            "spell": "cjx",
            "city": "澄江县"
        },
        {
            "parentId": "530400",
            "cityId": "530423",
            "spell": "thx",
            "city": "通海县"
        },
        {
            "parentId": "530400",
            "cityId": "530424",
            "spell": "hnx",
            "city": "华宁县"
        },
        {
            "parentId": "530400",
            "cityId": "530425",
            "spell": "ymx",
            "city": "易门县"
        },
        {
            "parentId": "530400",
            "cityId": "530426",
            "spell": "esyzzzx",
            "city": "峨山彝族自治县"
        },
        {
            "parentId": "530400",
            "cityId": "530427",
            "spell": "xpyzdzzzx",
            "city": "新平彝族傣族自治县"
        },
        {
            "parentId": "530400",
            "cityId": "530428",
            "spell": "yjhnzyzdzzzx",
            "city": "元江哈尼族彝族傣族自治县"
        },
        {
            "parentId": "530000",
            "cityId": "530500",
            "spell": "bss",
            "city": "保山市"
        },
        {
            "parentId": "530500",
            "cityId": "530501",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "530500",
            "cityId": "530502",
            "spell": "lyq",
            "city": "隆阳区"
        },
        {
            "parentId": "530500",
            "cityId": "530521",
            "spell": "sdx",
            "city": "施甸县"
        },
        {
            "parentId": "530500",
            "cityId": "530522",
            "spell": "tcx",
            "city": "腾冲县"
        },
        {
            "parentId": "530500",
            "cityId": "530523",
            "spell": "llx",
            "city": "龙陵县"
        },
        {
            "parentId": "530500",
            "cityId": "530524",
            "spell": "cnx",
            "city": "昌宁县"
        },
        {
            "parentId": "530000",
            "cityId": "530600",
            "spell": "zts",
            "city": "昭通市"
        },
        {
            "parentId": "530600",
            "cityId": "530601",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "530600",
            "cityId": "530602",
            "spell": "zyq",
            "city": "昭阳区"
        },
        {
            "parentId": "530600",
            "cityId": "530621",
            "spell": "ldx",
            "city": "鲁甸县"
        },
        {
            "parentId": "530600",
            "cityId": "530622",
            "spell": "qjx",
            "city": "巧家县"
        },
        {
            "parentId": "530600",
            "cityId": "530623",
            "spell": "yjx",
            "city": "盐津县"
        },
        {
            "parentId": "530600",
            "cityId": "530624",
            "spell": "dgx",
            "city": "大关县"
        },
        {
            "parentId": "530600",
            "cityId": "530625",
            "spell": "ysx",
            "city": "永善县"
        },
        {
            "parentId": "530600",
            "cityId": "530626",
            "spell": "sjx",
            "city": "绥江县"
        },
        {
            "parentId": "530600",
            "cityId": "530627",
            "spell": "zxx",
            "city": "镇雄县"
        },
        {
            "parentId": "530600",
            "cityId": "530628",
            "spell": "ylx",
            "city": "彝良县"
        },
        {
            "parentId": "530600",
            "cityId": "530629",
            "spell": "wxx",
            "city": "威信县"
        },
        {
            "parentId": "530600",
            "cityId": "530630",
            "spell": "sfx",
            "city": "水富县"
        },
        {
            "parentId": "530000",
            "cityId": "530700",
            "spell": "ljs",
            "city": "丽江市"
        },
        {
            "parentId": "530700",
            "cityId": "530701",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "530700",
            "cityId": "530702",
            "spell": "gcq",
            "city": "古城区"
        },
        {
            "parentId": "530700",
            "cityId": "530721",
            "spell": "ylnxzzzx",
            "city": "玉龙纳西族自治县"
        },
        {
            "parentId": "530700",
            "cityId": "530722",
            "spell": "ysx",
            "city": "永胜县"
        },
        {
            "parentId": "530700",
            "cityId": "530723",
            "spell": "hpx",
            "city": "华坪县"
        },
        {
            "parentId": "530700",
            "cityId": "530724",
            "spell": "nlyzzzx",
            "city": "宁蒗彝族自治县"
        },
        {
            "parentId": "530000",
            "cityId": "530800",
            "spell": "pes",
            "city": "普洱市"
        },
        {
            "parentId": "530800",
            "cityId": "530801",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "530800",
            "cityId": "530802",
            "spell": "smq",
            "city": "思茅区"
        },
        {
            "parentId": "530800",
            "cityId": "530821",
            "spell": "nehnzyzzzx",
            "city": "宁洱哈尼族彝族自治县"
        },
        {
            "parentId": "530800",
            "cityId": "530822",
            "spell": "mjhnzzzx",
            "city": "墨江哈尼族自治县"
        },
        {
            "parentId": "530800",
            "cityId": "530823",
            "spell": "jdyzzzx",
            "city": "景东彝族自治县"
        },
        {
            "parentId": "530800",
            "cityId": "530824",
            "spell": "jgdzyzzzx",
            "city": "景谷傣族彝族自治县"
        },
        {
            "parentId": "530800",
            "cityId": "530825",
            "spell": "zyyzhnzlhzzzx",
            "city": "镇沅彝族哈尼族拉祜族自治县"
        },
        {
            "parentId": "530800",
            "cityId": "530826",
            "spell": "jchnzyzzzx",
            "city": "江城哈尼族彝族自治县"
        },
        {
            "parentId": "530800",
            "cityId": "530827",
            "spell": "mldzlhzwzzzx",
            "city": "孟连傣族拉祜族佤族自治县"
        },
        {
            "parentId": "530800",
            "cityId": "530828",
            "spell": "lclhzzzx",
            "city": "澜沧拉祜族自治县"
        },
        {
            "parentId": "530800",
            "cityId": "530829",
            "spell": "xmwzzzx",
            "city": "西盟佤族自治县"
        },
        {
            "parentId": "530000",
            "cityId": "530900",
            "spell": "lcs",
            "city": "临沧市"
        },
        {
            "parentId": "530900",
            "cityId": "530901",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "530900",
            "cityId": "530902",
            "spell": "lxq",
            "city": "临翔区"
        },
        {
            "parentId": "530900",
            "cityId": "530921",
            "spell": "fqx",
            "city": "凤庆县"
        },
        {
            "parentId": "530900",
            "cityId": "530922",
            "spell": "yx",
            "city": "云县"
        },
        {
            "parentId": "530900",
            "cityId": "530923",
            "spell": "ydx",
            "city": "永德县"
        },
        {
            "parentId": "530900",
            "cityId": "530924",
            "spell": "zkx",
            "city": "镇康县"
        },
        {
            "parentId": "530900",
            "cityId": "530925",
            "spell": "sjlhzwzblzdzzzx",
            "city": "双江拉祜族佤族布朗族傣族自治县"
        },
        {
            "parentId": "530900",
            "cityId": "530926",
            "spell": "gmdzwzzzx",
            "city": "耿马傣族佤族自治县"
        },
        {
            "parentId": "530900",
            "cityId": "530927",
            "spell": "cywzzzx",
            "city": "沧源佤族自治县"
        },
        {
            "parentId": "530000",
            "cityId": "532300",
            "spell": "cxyzzzz",
            "city": "楚雄彝族自治州"
        },
        {
            "parentId": "532300",
            "cityId": "532301",
            "spell": "cxs",
            "city": "楚雄市"
        },
        {
            "parentId": "532300",
            "cityId": "532322",
            "spell": "sbx",
            "city": "双柏县"
        },
        {
            "parentId": "532300",
            "cityId": "532323",
            "spell": "mdx",
            "city": "牟定县"
        },
        {
            "parentId": "532300",
            "cityId": "532324",
            "spell": "nhx",
            "city": "南华县"
        },
        {
            "parentId": "532300",
            "cityId": "532325",
            "spell": "yax",
            "city": "姚安县"
        },
        {
            "parentId": "532300",
            "cityId": "532326",
            "spell": "dyx",
            "city": "大姚县"
        },
        {
            "parentId": "532300",
            "cityId": "532327",
            "spell": "yrx",
            "city": "永仁县"
        },
        {
            "parentId": "532300",
            "cityId": "532328",
            "spell": "ymx",
            "city": "元谋县"
        },
        {
            "parentId": "532300",
            "cityId": "532329",
            "spell": "wdx",
            "city": "武定县"
        },
        {
            "parentId": "532300",
            "cityId": "532331",
            "spell": "lfx",
            "city": "禄丰县"
        },
        {
            "parentId": "530000",
            "cityId": "532500",
            "spell": "hhhnzyzzzz",
            "city": "红河哈尼族彝族自治州"
        },
        {
            "parentId": "532500",
            "cityId": "532501",
            "spell": "gjs",
            "city": "个旧市"
        },
        {
            "parentId": "532500",
            "cityId": "532502",
            "spell": "kys",
            "city": "开远市"
        },
        {
            "parentId": "532500",
            "cityId": "532503",
            "spell": "mzs",
            "city": "蒙自市"
        },
        {
            "parentId": "532500",
            "cityId": "532504",
            "spell": "mls",
            "city": "弥勒市"
        },
        {
            "parentId": "532500",
            "cityId": "532523",
            "spell": "pbmzzzx",
            "city": "屏边苗族自治县"
        },
        {
            "parentId": "532500",
            "cityId": "532524",
            "spell": "jsx",
            "city": "建水县"
        },
        {
            "parentId": "532500",
            "cityId": "532525",
            "spell": "spx",
            "city": "石屏县"
        },
        {
            "parentId": "532500",
            "cityId": "532527",
            "spell": "lxx",
            "city": "泸西县"
        },
        {
            "parentId": "532500",
            "cityId": "532528",
            "spell": "yyx",
            "city": "元阳县"
        },
        {
            "parentId": "532500",
            "cityId": "532529",
            "spell": "hhx",
            "city": "红河县"
        },
        {
            "parentId": "532500",
            "cityId": "532530",
            "spell": "jpmzyzdzzzx",
            "city": "金平苗族瑶族傣族自治县"
        },
        {
            "parentId": "532500",
            "cityId": "532531",
            "spell": "lcx",
            "city": "绿春县"
        },
        {
            "parentId": "532500",
            "cityId": "532532",
            "spell": "hkyzzzx",
            "city": "河口瑶族自治县"
        },
        {
            "parentId": "530000",
            "cityId": "532600",
            "spell": "wszzmzzzz",
            "city": "文山壮族苗族自治州"
        },
        {
            "parentId": "532600",
            "cityId": "532601",
            "spell": "wss",
            "city": "文山市"
        },
        {
            "parentId": "532600",
            "cityId": "532622",
            "spell": "ysx",
            "city": "砚山县"
        },
        {
            "parentId": "532600",
            "cityId": "532623",
            "spell": "xcx",
            "city": "西畴县"
        },
        {
            "parentId": "532600",
            "cityId": "532624",
            "spell": "mlpx",
            "city": "麻栗坡县"
        },
        {
            "parentId": "532600",
            "cityId": "532625",
            "spell": "mgx",
            "city": "马关县"
        },
        {
            "parentId": "532600",
            "cityId": "532626",
            "spell": "qbx",
            "city": "丘北县"
        },
        {
            "parentId": "532600",
            "cityId": "532627",
            "spell": "gnx",
            "city": "广南县"
        },
        {
            "parentId": "532600",
            "cityId": "532628",
            "spell": "fnx",
            "city": "富宁县"
        },
        {
            "parentId": "530000",
            "cityId": "532800",
            "spell": "xsbndzzzz",
            "city": "西双版纳傣族自治州"
        },
        {
            "parentId": "532800",
            "cityId": "532801",
            "spell": "jhs",
            "city": "景洪市"
        },
        {
            "parentId": "532800",
            "cityId": "532822",
            "spell": "mhx",
            "city": "勐海县"
        },
        {
            "parentId": "532800",
            "cityId": "532823",
            "spell": "mlx",
            "city": "勐腊县"
        },
        {
            "parentId": "530000",
            "cityId": "532900",
            "spell": "dlbzzzz",
            "city": "大理白族自治州"
        },
        {
            "parentId": "532900",
            "cityId": "532901",
            "spell": "dls",
            "city": "大理市"
        },
        {
            "parentId": "532900",
            "cityId": "532922",
            "spell": "ybyzzzx",
            "city": "漾濞彝族自治县"
        },
        {
            "parentId": "532900",
            "cityId": "532923",
            "spell": "xyx",
            "city": "祥云县"
        },
        {
            "parentId": "532900",
            "cityId": "532924",
            "spell": "bcx",
            "city": "宾川县"
        },
        {
            "parentId": "532900",
            "cityId": "532925",
            "spell": "mdx",
            "city": "弥渡县"
        },
        {
            "parentId": "532900",
            "cityId": "532926",
            "spell": "njyzzzx",
            "city": "南涧彝族自治县"
        },
        {
            "parentId": "532900",
            "cityId": "532927",
            "spell": "wsyzhzzzx",
            "city": "巍山彝族回族自治县"
        },
        {
            "parentId": "532900",
            "cityId": "532928",
            "spell": "ypx",
            "city": "永平县"
        },
        {
            "parentId": "532900",
            "cityId": "532929",
            "spell": "ylx",
            "city": "云龙县"
        },
        {
            "parentId": "532900",
            "cityId": "532930",
            "spell": "eyx",
            "city": "洱源县"
        },
        {
            "parentId": "532900",
            "cityId": "532931",
            "spell": "jcx",
            "city": "剑川县"
        },
        {
            "parentId": "532900",
            "cityId": "532932",
            "spell": "hqx",
            "city": "鹤庆县"
        },
        {
            "parentId": "530000",
            "cityId": "533100",
            "spell": "dhdzjpzzzz",
            "city": "德宏傣族景颇族自治州"
        },
        {
            "parentId": "533100",
            "cityId": "533102",
            "spell": "rls",
            "city": "瑞丽市"
        },
        {
            "parentId": "533100",
            "cityId": "533103",
            "spell": "ms",
            "city": "芒市"
        },
        {
            "parentId": "533100",
            "cityId": "533122",
            "spell": "lhx",
            "city": "梁河县"
        },
        {
            "parentId": "533100",
            "cityId": "533123",
            "spell": "yjx",
            "city": "盈江县"
        },
        {
            "parentId": "533100",
            "cityId": "533124",
            "spell": "lcx",
            "city": "陇川县"
        },
        {
            "parentId": "530000",
            "cityId": "533300",
            "spell": "njlszzzz",
            "city": "怒江傈僳族自治州"
        },
        {
            "parentId": "533300",
            "cityId": "533321",
            "spell": "lsx",
            "city": "泸水县"
        },
        {
            "parentId": "533300",
            "cityId": "533323",
            "spell": "fgx",
            "city": "福贡县"
        },
        {
            "parentId": "533300",
            "cityId": "533324",
            "spell": "gsdlznzzzx",
            "city": "贡山独龙族怒族自治县"
        },
        {
            "parentId": "533300",
            "cityId": "533325",
            "spell": "lpbzpmzzzx",
            "city": "兰坪白族普米族自治县"
        },
        {
            "parentId": "530000",
            "cityId": "533400",
            "spell": "dqczzzz",
            "city": "迪庆藏族自治州"
        },
        {
            "parentId": "533400",
            "cityId": "533421",
            "spell": "xgllx",
            "city": "香格里拉县"
        },
        {
            "parentId": "533400",
            "cityId": "533422",
            "spell": "dqx",
            "city": "德钦县"
        },
        {
            "parentId": "533400",
            "cityId": "533423",
            "spell": "wxlszzzx",
            "city": "维西傈僳族自治县"
        },
        {
            "parentId": "0",
            "cityId": "540000",
            "spell": "xczzq",
            "city": "西藏自治区"
        },
        {
            "parentId": "540000",
            "cityId": "540100",
            "spell": "lss",
            "city": "拉萨市"
        },
        {
            "parentId": "540100",
            "cityId": "540101",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "540100",
            "cityId": "540102",
            "spell": "cgq",
            "city": "城关区"
        },
        {
            "parentId": "540100",
            "cityId": "540121",
            "spell": "lzx",
            "city": "林周县"
        },
        {
            "parentId": "540100",
            "cityId": "540122",
            "spell": "dxx",
            "city": "当雄县"
        },
        {
            "parentId": "540100",
            "cityId": "540123",
            "spell": "nmx",
            "city": "尼木县"
        },
        {
            "parentId": "540100",
            "cityId": "540124",
            "spell": "qsx",
            "city": "曲水县"
        },
        {
            "parentId": "540100",
            "cityId": "540125",
            "spell": "dldqx",
            "city": "堆龙德庆县"
        },
        {
            "parentId": "540100",
            "cityId": "540126",
            "spell": "dzx",
            "city": "达孜县"
        },
        {
            "parentId": "540100",
            "cityId": "540127",
            "spell": "mzgkx",
            "city": "墨竹工卡县"
        },
        {
            "parentId": "540000",
            "cityId": "542100",
            "spell": "cddq",
            "city": "昌都地区"
        },
        {
            "parentId": "542100",
            "cityId": "542121",
            "spell": "cdx",
            "city": "昌都县"
        },
        {
            "parentId": "542100",
            "cityId": "542122",
            "spell": "jdx",
            "city": "江达县"
        },
        {
            "parentId": "542100",
            "cityId": "542123",
            "spell": "gjx",
            "city": "贡觉县"
        },
        {
            "parentId": "542100",
            "cityId": "542124",
            "spell": "lwqx",
            "city": "类乌齐县"
        },
        {
            "parentId": "542100",
            "cityId": "542125",
            "spell": "dqx",
            "city": "丁青县"
        },
        {
            "parentId": "542100",
            "cityId": "542126",
            "spell": "cyx",
            "city": "察雅县"
        },
        {
            "parentId": "542100",
            "cityId": "542127",
            "spell": "bsx",
            "city": "八宿县"
        },
        {
            "parentId": "542100",
            "cityId": "542128",
            "spell": "zgx",
            "city": "左贡县"
        },
        {
            "parentId": "542100",
            "cityId": "542129",
            "spell": "mkx",
            "city": "芒康县"
        },
        {
            "parentId": "542100",
            "cityId": "542132",
            "spell": "llx",
            "city": "洛隆县"
        },
        {
            "parentId": "542100",
            "cityId": "542133",
            "spell": "bbx",
            "city": "边坝县"
        },
        {
            "parentId": "540000",
            "cityId": "542200",
            "spell": "sndq",
            "city": "山南地区"
        },
        {
            "parentId": "542200",
            "cityId": "542221",
            "spell": "ndx",
            "city": "乃东县"
        },
        {
            "parentId": "542200",
            "cityId": "542222",
            "spell": "znx",
            "city": "扎囊县"
        },
        {
            "parentId": "542200",
            "cityId": "542223",
            "spell": "ggx",
            "city": "贡嘎县"
        },
        {
            "parentId": "542200",
            "cityId": "542224",
            "spell": "srx",
            "city": "桑日县"
        },
        {
            "parentId": "542200",
            "cityId": "542225",
            "spell": "qjx",
            "city": "琼结县"
        },
        {
            "parentId": "542200",
            "cityId": "542226",
            "spell": "qsx",
            "city": "曲松县"
        },
        {
            "parentId": "542200",
            "cityId": "542227",
            "spell": "cmx",
            "city": "措美县"
        },
        {
            "parentId": "542200",
            "cityId": "542228",
            "spell": "lzx",
            "city": "洛扎县"
        },
        {
            "parentId": "542200",
            "cityId": "542229",
            "spell": "jcx",
            "city": "加查县"
        },
        {
            "parentId": "542200",
            "cityId": "542231",
            "spell": "lzx",
            "city": "隆子县"
        },
        {
            "parentId": "542200",
            "cityId": "542232",
            "spell": "cnx",
            "city": "错那县"
        },
        {
            "parentId": "542200",
            "cityId": "542233",
            "spell": "lqzx",
            "city": "浪卡子县"
        },
        {
            "parentId": "540000",
            "cityId": "542300",
            "spell": "rkzdq",
            "city": "日喀则地区"
        },
        {
            "parentId": "542300",
            "cityId": "542301",
            "spell": "rkzs",
            "city": "日喀则市"
        },
        {
            "parentId": "542300",
            "cityId": "542322",
            "spell": "nmlx",
            "city": "南木林县"
        },
        {
            "parentId": "542300",
            "cityId": "542323",
            "spell": "jzx",
            "city": "江孜县"
        },
        {
            "parentId": "542300",
            "cityId": "542324",
            "spell": "drx",
            "city": "定日县"
        },
        {
            "parentId": "542300",
            "cityId": "542325",
            "spell": "sjx",
            "city": "萨迦县"
        },
        {
            "parentId": "542300",
            "cityId": "542326",
            "spell": "lzx",
            "city": "拉孜县"
        },
        {
            "parentId": "542300",
            "cityId": "542327",
            "spell": "arx",
            "city": "昂仁县"
        },
        {
            "parentId": "542300",
            "cityId": "542328",
            "spell": "xtmx",
            "city": "谢通门县"
        },
        {
            "parentId": "542300",
            "cityId": "542329",
            "spell": "blx",
            "city": "白朗县"
        },
        {
            "parentId": "542300",
            "cityId": "542330",
            "spell": "rbx",
            "city": "仁布县"
        },
        {
            "parentId": "542300",
            "cityId": "542331",
            "spell": "kmx",
            "city": "康马县"
        },
        {
            "parentId": "542300",
            "cityId": "542332",
            "spell": "djx",
            "city": "定结县"
        },
        {
            "parentId": "542300",
            "cityId": "542333",
            "spell": "zbx",
            "city": "仲巴县"
        },
        {
            "parentId": "542300",
            "cityId": "542334",
            "spell": "ydx",
            "city": "亚东县"
        },
        {
            "parentId": "542300",
            "cityId": "542335",
            "spell": "jlx",
            "city": "吉隆县"
        },
        {
            "parentId": "542300",
            "cityId": "542336",
            "spell": "nlmx",
            "city": "聂拉木县"
        },
        {
            "parentId": "542300",
            "cityId": "542337",
            "spell": "sgx",
            "city": "萨嘎县"
        },
        {
            "parentId": "542300",
            "cityId": "542338",
            "spell": "gbx",
            "city": "岗巴县"
        },
        {
            "parentId": "540000",
            "cityId": "542400",
            "spell": "nqdq",
            "city": "那曲地区"
        },
        {
            "parentId": "542400",
            "cityId": "542421",
            "spell": "nqx",
            "city": "那曲县"
        },
        {
            "parentId": "542400",
            "cityId": "542422",
            "spell": "jlx",
            "city": "嘉黎县"
        },
        {
            "parentId": "542400",
            "cityId": "542423",
            "spell": "brx",
            "city": "比如县"
        },
        {
            "parentId": "542400",
            "cityId": "542424",
            "spell": "nrx",
            "city": "聂荣县"
        },
        {
            "parentId": "542400",
            "cityId": "542425",
            "spell": "adx",
            "city": "安多县"
        },
        {
            "parentId": "542400",
            "cityId": "542426",
            "spell": "szx",
            "city": "申扎县"
        },
        {
            "parentId": "542400",
            "cityId": "542427",
            "spell": "sx",
            "city": "索县"
        },
        {
            "parentId": "542400",
            "cityId": "542428",
            "spell": "bgx",
            "city": "班戈县"
        },
        {
            "parentId": "542400",
            "cityId": "542429",
            "spell": "bqx",
            "city": "巴青县"
        },
        {
            "parentId": "542400",
            "cityId": "542430",
            "spell": "nmx",
            "city": "尼玛县"
        },
        {
            "parentId": "542400",
            "cityId": "542431",
            "spell": "shx",
            "city": "双湖县"
        },
        {
            "parentId": "540000",
            "cityId": "542500",
            "spell": "aldq",
            "city": "阿里地区"
        },
        {
            "parentId": "542500",
            "cityId": "542521",
            "spell": "plx",
            "city": "普兰县"
        },
        {
            "parentId": "542500",
            "cityId": "542522",
            "spell": "zdx",
            "city": "札达县"
        },
        {
            "parentId": "542500",
            "cityId": "542523",
            "spell": "gex",
            "city": "噶尔县"
        },
        {
            "parentId": "542500",
            "cityId": "542524",
            "spell": "rtx",
            "city": "日土县"
        },
        {
            "parentId": "542500",
            "cityId": "542525",
            "spell": "gjx",
            "city": "革吉县"
        },
        {
            "parentId": "542500",
            "cityId": "542526",
            "spell": "gzx",
            "city": "改则县"
        },
        {
            "parentId": "542500",
            "cityId": "542527",
            "spell": "cqx",
            "city": "措勤县"
        },
        {
            "parentId": "540000",
            "cityId": "542600",
            "spell": "lzdq",
            "city": "林芝地区"
        },
        {
            "parentId": "542600",
            "cityId": "542621",
            "spell": "lzx",
            "city": "林芝县"
        },
        {
            "parentId": "542600",
            "cityId": "542622",
            "spell": "gbjdx",
            "city": "工布江达县"
        },
        {
            "parentId": "542600",
            "cityId": "542623",
            "spell": "mlx",
            "city": "米林县"
        },
        {
            "parentId": "542600",
            "cityId": "542624",
            "spell": "mtx",
            "city": "墨脱县"
        },
        {
            "parentId": "542600",
            "cityId": "542625",
            "spell": "bmx",
            "city": "波密县"
        },
        {
            "parentId": "542600",
            "cityId": "542626",
            "spell": "cyx",
            "city": "察隅县"
        },
        {
            "parentId": "542600",
            "cityId": "542627",
            "spell": "lx",
            "city": "朗县"
        },
        {
            "parentId": "0",
            "cityId": "610000",
            "spell": "sxs",
            "city": "陕西省"
        },
        {
            "parentId": "610000",
            "cityId": "610100",
            "spell": "xas",
            "city": "西安市"
        },
        {
            "parentId": "610100",
            "cityId": "610101",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "610100",
            "cityId": "610102",
            "spell": "xcq",
            "city": "新城区"
        },
        {
            "parentId": "610100",
            "cityId": "610103",
            "spell": "blq",
            "city": "碑林区"
        },
        {
            "parentId": "610100",
            "cityId": "610104",
            "spell": "lhq",
            "city": "莲湖区"
        },
        {
            "parentId": "610100",
            "cityId": "610111",
            "spell": "bqq",
            "city": "灞桥区"
        },
        {
            "parentId": "610100",
            "cityId": "610112",
            "spell": "wyq",
            "city": "未央区"
        },
        {
            "parentId": "610100",
            "cityId": "610113",
            "spell": "ytq",
            "city": "雁塔区"
        },
        {
            "parentId": "610100",
            "cityId": "610114",
            "spell": "ylq",
            "city": "阎良区"
        },
        {
            "parentId": "610100",
            "cityId": "610115",
            "spell": "ltq",
            "city": "临潼区"
        },
        {
            "parentId": "610100",
            "cityId": "610116",
            "spell": "caq",
            "city": "长安区"
        },
        {
            "parentId": "610100",
            "cityId": "610122",
            "spell": "ltx",
            "city": "蓝田县"
        },
        {
            "parentId": "610100",
            "cityId": "610124",
            "spell": "zzx",
            "city": "周至县"
        },
        {
            "parentId": "610100",
            "cityId": "610125",
            "spell": "hx",
            "city": "户县"
        },
        {
            "parentId": "610100",
            "cityId": "610126",
            "spell": "glx",
            "city": "高陵县"
        },
        {
            "parentId": "610000",
            "cityId": "610200",
            "spell": "tcs",
            "city": "铜川市"
        },
        {
            "parentId": "610200",
            "cityId": "610201",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "610200",
            "cityId": "610202",
            "spell": "wyq",
            "city": "王益区"
        },
        {
            "parentId": "610200",
            "cityId": "610203",
            "spell": "ytq",
            "city": "印台区"
        },
        {
            "parentId": "610200",
            "cityId": "610204",
            "spell": "yzq",
            "city": "耀州区"
        },
        {
            "parentId": "610200",
            "cityId": "610222",
            "spell": "yjx",
            "city": "宜君县"
        },
        {
            "parentId": "610000",
            "cityId": "610300",
            "spell": "bjs",
            "city": "宝鸡市"
        },
        {
            "parentId": "610300",
            "cityId": "610301",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "610300",
            "cityId": "610302",
            "spell": "wbq",
            "city": "渭滨区"
        },
        {
            "parentId": "610300",
            "cityId": "610303",
            "spell": "jtq",
            "city": "金台区"
        },
        {
            "parentId": "610300",
            "cityId": "610304",
            "spell": "ccq",
            "city": "陈仓区"
        },
        {
            "parentId": "610300",
            "cityId": "610322",
            "spell": "fxx",
            "city": "凤翔县"
        },
        {
            "parentId": "610300",
            "cityId": "610323",
            "spell": "qsx",
            "city": "岐山县"
        },
        {
            "parentId": "610300",
            "cityId": "610324",
            "spell": "ffx",
            "city": "扶风县"
        },
        {
            "parentId": "610300",
            "cityId": "610326",
            "spell": "mx",
            "city": "眉县"
        },
        {
            "parentId": "610300",
            "cityId": "610327",
            "spell": "lx",
            "city": "陇县"
        },
        {
            "parentId": "610300",
            "cityId": "610328",
            "spell": "qyx",
            "city": "千阳县"
        },
        {
            "parentId": "610300",
            "cityId": "610329",
            "spell": "lyx",
            "city": "麟游县"
        },
        {
            "parentId": "610300",
            "cityId": "610330",
            "spell": "fx",
            "city": "凤县"
        },
        {
            "parentId": "610300",
            "cityId": "610331",
            "spell": "tbx",
            "city": "太白县"
        },
        {
            "parentId": "610000",
            "cityId": "610400",
            "spell": "xys",
            "city": "咸阳市"
        },
        {
            "parentId": "610400",
            "cityId": "610401",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "610400",
            "cityId": "610402",
            "spell": "qdq",
            "city": "秦都区"
        },
        {
            "parentId": "610400",
            "cityId": "610403",
            "spell": "ylq",
            "city": "杨陵区"
        },
        {
            "parentId": "610400",
            "cityId": "610404",
            "spell": "wcq",
            "city": "渭城区"
        },
        {
            "parentId": "610400",
            "cityId": "610422",
            "spell": "syx",
            "city": "三原县"
        },
        {
            "parentId": "610400",
            "cityId": "610423",
            "spell": "jyx",
            "city": "泾阳县"
        },
        {
            "parentId": "610400",
            "cityId": "610424",
            "spell": "gx",
            "city": "乾县"
        },
        {
            "parentId": "610400",
            "cityId": "610425",
            "spell": "lqx",
            "city": "礼泉县"
        },
        {
            "parentId": "610400",
            "cityId": "610426",
            "spell": "ysx",
            "city": "永寿县"
        },
        {
            "parentId": "610400",
            "cityId": "610427",
            "spell": "bx",
            "city": "彬县"
        },
        {
            "parentId": "610400",
            "cityId": "610428",
            "spell": "cwx",
            "city": "长武县"
        },
        {
            "parentId": "610400",
            "cityId": "610429",
            "spell": "xyx",
            "city": "旬邑县"
        },
        {
            "parentId": "610400",
            "cityId": "610430",
            "spell": "chx",
            "city": "淳化县"
        },
        {
            "parentId": "610400",
            "cityId": "610431",
            "spell": "wgx",
            "city": "武功县"
        },
        {
            "parentId": "610400",
            "cityId": "610481",
            "spell": "xps",
            "city": "兴平市"
        },
        {
            "parentId": "610000",
            "cityId": "610500",
            "spell": "wns",
            "city": "渭南市"
        },
        {
            "parentId": "610500",
            "cityId": "610501",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "610500",
            "cityId": "610502",
            "spell": "lwq",
            "city": "临渭区"
        },
        {
            "parentId": "610500",
            "cityId": "610521",
            "spell": "hx",
            "city": "华县"
        },
        {
            "parentId": "610500",
            "cityId": "610522",
            "spell": "tgx",
            "city": "潼关县"
        },
        {
            "parentId": "610500",
            "cityId": "610523",
            "spell": "dlx",
            "city": "大荔县"
        },
        {
            "parentId": "610500",
            "cityId": "610524",
            "spell": "hyx",
            "city": "合阳县"
        },
        {
            "parentId": "610500",
            "cityId": "610525",
            "spell": "ccx",
            "city": "澄城县"
        },
        {
            "parentId": "610500",
            "cityId": "610526",
            "spell": "pcx",
            "city": "蒲城县"
        },
        {
            "parentId": "610500",
            "cityId": "610527",
            "spell": "bsx",
            "city": "白水县"
        },
        {
            "parentId": "610500",
            "cityId": "610528",
            "spell": "fpx",
            "city": "富平县"
        },
        {
            "parentId": "610500",
            "cityId": "610581",
            "spell": "hcs",
            "city": "韩城市"
        },
        {
            "parentId": "610500",
            "cityId": "610582",
            "spell": "hys",
            "city": "华阴市"
        },
        {
            "parentId": "610000",
            "cityId": "610600",
            "spell": "yas",
            "city": "延安市"
        },
        {
            "parentId": "610600",
            "cityId": "610601",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "610600",
            "cityId": "610602",
            "spell": "btq",
            "city": "宝塔区"
        },
        {
            "parentId": "610600",
            "cityId": "610621",
            "spell": "ycx",
            "city": "延长县"
        },
        {
            "parentId": "610600",
            "cityId": "610622",
            "spell": "ycx",
            "city": "延川县"
        },
        {
            "parentId": "610600",
            "cityId": "610623",
            "spell": "zcx",
            "city": "子长县"
        },
        {
            "parentId": "610600",
            "cityId": "610624",
            "spell": "asx",
            "city": "安塞县"
        },
        {
            "parentId": "610600",
            "cityId": "610625",
            "spell": "zdx",
            "city": "志丹县"
        },
        {
            "parentId": "610600",
            "cityId": "610626",
            "spell": "wqx",
            "city": "吴起县"
        },
        {
            "parentId": "610600",
            "cityId": "610627",
            "spell": "gqx",
            "city": "甘泉县"
        },
        {
            "parentId": "610600",
            "cityId": "610628",
            "spell": "fx",
            "city": "富县"
        },
        {
            "parentId": "610600",
            "cityId": "610629",
            "spell": "lcx",
            "city": "洛川县"
        },
        {
            "parentId": "610600",
            "cityId": "610630",
            "spell": "ycx",
            "city": "宜川县"
        },
        {
            "parentId": "610600",
            "cityId": "610631",
            "spell": "hlx",
            "city": "黄龙县"
        },
        {
            "parentId": "610600",
            "cityId": "610632",
            "spell": "hlx",
            "city": "黄陵县"
        },
        {
            "parentId": "610000",
            "cityId": "610700",
            "spell": "hzs",
            "city": "汉中市"
        },
        {
            "parentId": "610700",
            "cityId": "610701",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "610700",
            "cityId": "610702",
            "spell": "htq",
            "city": "汉台区"
        },
        {
            "parentId": "610700",
            "cityId": "610721",
            "spell": "nzx",
            "city": "南郑县"
        },
        {
            "parentId": "610700",
            "cityId": "610722",
            "spell": "cgx",
            "city": "城固县"
        },
        {
            "parentId": "610700",
            "cityId": "610723",
            "spell": "yx",
            "city": "洋县"
        },
        {
            "parentId": "610700",
            "cityId": "610724",
            "spell": "xxx",
            "city": "西乡县"
        },
        {
            "parentId": "610700",
            "cityId": "610725",
            "spell": "mx",
            "city": "勉县"
        },
        {
            "parentId": "610700",
            "cityId": "610726",
            "spell": "nqx",
            "city": "宁强县"
        },
        {
            "parentId": "610700",
            "cityId": "610727",
            "spell": "lyx",
            "city": "略阳县"
        },
        {
            "parentId": "610700",
            "cityId": "610728",
            "spell": "zbx",
            "city": "镇巴县"
        },
        {
            "parentId": "610700",
            "cityId": "610729",
            "spell": "lbx",
            "city": "留坝县"
        },
        {
            "parentId": "610700",
            "cityId": "610730",
            "spell": "fpx",
            "city": "佛坪县"
        },
        {
            "parentId": "610000",
            "cityId": "610800",
            "spell": "yls",
            "city": "榆林市"
        },
        {
            "parentId": "610800",
            "cityId": "610801",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "610800",
            "cityId": "610802",
            "spell": "yyq",
            "city": "榆阳区"
        },
        {
            "parentId": "610800",
            "cityId": "610821",
            "spell": "smx",
            "city": "神木县"
        },
        {
            "parentId": "610800",
            "cityId": "610822",
            "spell": "fgx",
            "city": "府谷县"
        },
        {
            "parentId": "610800",
            "cityId": "610823",
            "spell": "hsx",
            "city": "横山县"
        },
        {
            "parentId": "610800",
            "cityId": "610824",
            "spell": "jbx",
            "city": "靖边县"
        },
        {
            "parentId": "610800",
            "cityId": "610825",
            "spell": "dbx",
            "city": "定边县"
        },
        {
            "parentId": "610800",
            "cityId": "610826",
            "spell": "sdx",
            "city": "绥德县"
        },
        {
            "parentId": "610800",
            "cityId": "610827",
            "spell": "mzx",
            "city": "米脂县"
        },
        {
            "parentId": "610800",
            "cityId": "610828",
            "spell": "jx",
            "city": "佳县"
        },
        {
            "parentId": "610800",
            "cityId": "610829",
            "spell": "wbx",
            "city": "吴堡县"
        },
        {
            "parentId": "610800",
            "cityId": "610830",
            "spell": "qjx",
            "city": "清涧县"
        },
        {
            "parentId": "610800",
            "cityId": "610831",
            "spell": "zzx",
            "city": "子洲县"
        },
        {
            "parentId": "610000",
            "cityId": "610900",
            "spell": "aks",
            "city": "安康市"
        },
        {
            "parentId": "610900",
            "cityId": "610901",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "610900",
            "cityId": "610902",
            "spell": "hbq",
            "city": "汉滨区"
        },
        {
            "parentId": "610900",
            "cityId": "610921",
            "spell": "hyx",
            "city": "汉阴县"
        },
        {
            "parentId": "610900",
            "cityId": "610922",
            "spell": "sqx",
            "city": "石泉县"
        },
        {
            "parentId": "610900",
            "cityId": "610923",
            "spell": "nsx",
            "city": "宁陕县"
        },
        {
            "parentId": "610900",
            "cityId": "610924",
            "spell": "zyx",
            "city": "紫阳县"
        },
        {
            "parentId": "610900",
            "cityId": "610925",
            "spell": "lgx",
            "city": "岚皋县"
        },
        {
            "parentId": "610900",
            "cityId": "610926",
            "spell": "plx",
            "city": "平利县"
        },
        {
            "parentId": "610900",
            "cityId": "610927",
            "spell": "zpx",
            "city": "镇坪县"
        },
        {
            "parentId": "610900",
            "cityId": "610928",
            "spell": "xyx",
            "city": "旬阳县"
        },
        {
            "parentId": "610900",
            "cityId": "610929",
            "spell": "bhx",
            "city": "白河县"
        },
        {
            "parentId": "610000",
            "cityId": "611000",
            "spell": "sls",
            "city": "商洛市"
        },
        {
            "parentId": "611000",
            "cityId": "611001",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "611000",
            "cityId": "611002",
            "spell": "szq",
            "city": "商州区"
        },
        {
            "parentId": "611000",
            "cityId": "611021",
            "spell": "lnx",
            "city": "洛南县"
        },
        {
            "parentId": "611000",
            "cityId": "611022",
            "spell": "dfx",
            "city": "丹凤县"
        },
        {
            "parentId": "611000",
            "cityId": "611023",
            "spell": "snx",
            "city": "商南县"
        },
        {
            "parentId": "611000",
            "cityId": "611024",
            "spell": "syx",
            "city": "山阳县"
        },
        {
            "parentId": "611000",
            "cityId": "611025",
            "spell": "zax",
            "city": "镇安县"
        },
        {
            "parentId": "611000",
            "cityId": "611026",
            "spell": "zsx",
            "city": "柞水县"
        },
        {
            "parentId": "0",
            "cityId": "620000",
            "spell": "gss",
            "city": "甘肃省"
        },
        {
            "parentId": "620000",
            "cityId": "620100",
            "spell": "lzs",
            "city": "兰州市"
        },
        {
            "parentId": "620100",
            "cityId": "620101",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "620100",
            "cityId": "620102",
            "spell": "cgq",
            "city": "城关区"
        },
        {
            "parentId": "620100",
            "cityId": "620103",
            "spell": "qlhq",
            "city": "七里河区"
        },
        {
            "parentId": "620100",
            "cityId": "620104",
            "spell": "xgq",
            "city": "西固区"
        },
        {
            "parentId": "620100",
            "cityId": "620105",
            "spell": "anq",
            "city": "安宁区"
        },
        {
            "parentId": "620100",
            "cityId": "620111",
            "spell": "hgq",
            "city": "红古区"
        },
        {
            "parentId": "620100",
            "cityId": "620121",
            "spell": "ydx",
            "city": "永登县"
        },
        {
            "parentId": "620100",
            "cityId": "620122",
            "spell": "glx",
            "city": "皋兰县"
        },
        {
            "parentId": "620100",
            "cityId": "620123",
            "spell": "yzx",
            "city": "榆中县"
        },
        {
            "parentId": "620000",
            "cityId": "620200",
            "spell": "jygs",
            "city": "嘉峪关市"
        },
        {
            "parentId": "620200",
            "cityId": "620201",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "620000",
            "cityId": "620300",
            "spell": "jcs",
            "city": "金昌市"
        },
        {
            "parentId": "620300",
            "cityId": "620301",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "620300",
            "cityId": "620302",
            "spell": "jcq",
            "city": "金川区"
        },
        {
            "parentId": "620300",
            "cityId": "620321",
            "spell": "ycx",
            "city": "永昌县"
        },
        {
            "parentId": "620000",
            "cityId": "620400",
            "spell": "bys",
            "city": "白银市"
        },
        {
            "parentId": "620400",
            "cityId": "620401",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "620400",
            "cityId": "620402",
            "spell": "byq",
            "city": "白银区"
        },
        {
            "parentId": "620400",
            "cityId": "620403",
            "spell": "pcq",
            "city": "平川区"
        },
        {
            "parentId": "620400",
            "cityId": "620421",
            "spell": "jyx",
            "city": "靖远县"
        },
        {
            "parentId": "620400",
            "cityId": "620422",
            "spell": "hnx",
            "city": "会宁县"
        },
        {
            "parentId": "620400",
            "cityId": "620423",
            "spell": "jtx",
            "city": "景泰县"
        },
        {
            "parentId": "620000",
            "cityId": "620500",
            "spell": "tss",
            "city": "天水市"
        },
        {
            "parentId": "620500",
            "cityId": "620501",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "620500",
            "cityId": "620502",
            "spell": "qzq",
            "city": "秦州区"
        },
        {
            "parentId": "620500",
            "cityId": "620503",
            "spell": "mjq",
            "city": "麦积区"
        },
        {
            "parentId": "620500",
            "cityId": "620521",
            "spell": "qsx",
            "city": "清水县"
        },
        {
            "parentId": "620500",
            "cityId": "620522",
            "spell": "qax",
            "city": "秦安县"
        },
        {
            "parentId": "620500",
            "cityId": "620523",
            "spell": "ggx",
            "city": "甘谷县"
        },
        {
            "parentId": "620500",
            "cityId": "620524",
            "spell": "wsx",
            "city": "武山县"
        },
        {
            "parentId": "620500",
            "cityId": "620525",
            "spell": "zjchzzzx",
            "city": "张家川回族自治县"
        },
        {
            "parentId": "620000",
            "cityId": "620600",
            "spell": "wws",
            "city": "武威市"
        },
        {
            "parentId": "620600",
            "cityId": "620601",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "620600",
            "cityId": "620602",
            "spell": "lzq",
            "city": "凉州区"
        },
        {
            "parentId": "620600",
            "cityId": "620621",
            "spell": "mqx",
            "city": "民勤县"
        },
        {
            "parentId": "620600",
            "cityId": "620622",
            "spell": "glx",
            "city": "古浪县"
        },
        {
            "parentId": "620600",
            "cityId": "620623",
            "spell": "tzczzzx",
            "city": "天祝藏族自治县"
        },
        {
            "parentId": "620000",
            "cityId": "620700",
            "spell": "zys",
            "city": "张掖市"
        },
        {
            "parentId": "620700",
            "cityId": "620701",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "620700",
            "cityId": "620702",
            "spell": "gzq",
            "city": "甘州区"
        },
        {
            "parentId": "620700",
            "cityId": "620721",
            "spell": "snygzzzx",
            "city": "肃南裕固族自治县"
        },
        {
            "parentId": "620700",
            "cityId": "620722",
            "spell": "mlx",
            "city": "民乐县"
        },
        {
            "parentId": "620700",
            "cityId": "620723",
            "spell": "lzx",
            "city": "临泽县"
        },
        {
            "parentId": "620700",
            "cityId": "620724",
            "spell": "gtx",
            "city": "高台县"
        },
        {
            "parentId": "620700",
            "cityId": "620725",
            "spell": "sdx",
            "city": "山丹县"
        },
        {
            "parentId": "620000",
            "cityId": "620800",
            "spell": "pls",
            "city": "平凉市"
        },
        {
            "parentId": "620800",
            "cityId": "620801",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "620800",
            "cityId": "620802",
            "spell": "ktq",
            "city": "崆峒区"
        },
        {
            "parentId": "620800",
            "cityId": "620821",
            "spell": "jcx",
            "city": "泾川县"
        },
        {
            "parentId": "620800",
            "cityId": "620822",
            "spell": "ltx",
            "city": "灵台县"
        },
        {
            "parentId": "620800",
            "cityId": "620823",
            "spell": "cxx",
            "city": "崇信县"
        },
        {
            "parentId": "620800",
            "cityId": "620824",
            "spell": "htx",
            "city": "华亭县"
        },
        {
            "parentId": "620800",
            "cityId": "620825",
            "spell": "zlx",
            "city": "庄浪县"
        },
        {
            "parentId": "620800",
            "cityId": "620826",
            "spell": "jnx",
            "city": "静宁县"
        },
        {
            "parentId": "620000",
            "cityId": "620900",
            "spell": "jqs",
            "city": "酒泉市"
        },
        {
            "parentId": "620900",
            "cityId": "620901",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "620900",
            "cityId": "620902",
            "spell": "szq",
            "city": "肃州区"
        },
        {
            "parentId": "620900",
            "cityId": "620921",
            "spell": "jtx",
            "city": "金塔县"
        },
        {
            "parentId": "620900",
            "cityId": "620922",
            "spell": "gzx",
            "city": "瓜州县"
        },
        {
            "parentId": "620900",
            "cityId": "620923",
            "spell": "sbmgzzzx",
            "city": "肃北蒙古族自治县"
        },
        {
            "parentId": "620900",
            "cityId": "620924",
            "spell": "akshskzzzx",
            "city": "阿克塞哈萨克族自治县"
        },
        {
            "parentId": "620900",
            "cityId": "620981",
            "spell": "yms",
            "city": "玉门市"
        },
        {
            "parentId": "620900",
            "cityId": "620982",
            "spell": "dhs",
            "city": "敦煌市"
        },
        {
            "parentId": "620000",
            "cityId": "621000",
            "spell": "qys",
            "city": "庆阳市"
        },
        {
            "parentId": "621000",
            "cityId": "621001",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "621000",
            "cityId": "621002",
            "spell": "xfq",
            "city": "西峰区"
        },
        {
            "parentId": "621000",
            "cityId": "621021",
            "spell": "qcx",
            "city": "庆城县"
        },
        {
            "parentId": "621000",
            "cityId": "621022",
            "spell": "hx",
            "city": "环县"
        },
        {
            "parentId": "621000",
            "cityId": "621023",
            "spell": "hcx",
            "city": "华池县"
        },
        {
            "parentId": "621000",
            "cityId": "621024",
            "spell": "hsx",
            "city": "合水县"
        },
        {
            "parentId": "621000",
            "cityId": "621025",
            "spell": "znx",
            "city": "正宁县"
        },
        {
            "parentId": "621000",
            "cityId": "621026",
            "spell": "nx",
            "city": "宁县"
        },
        {
            "parentId": "621000",
            "cityId": "621027",
            "spell": "zyx",
            "city": "镇原县"
        },
        {
            "parentId": "620000",
            "cityId": "621100",
            "spell": "dxs",
            "city": "定西市"
        },
        {
            "parentId": "621100",
            "cityId": "621101",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "621100",
            "cityId": "621102",
            "spell": "adq",
            "city": "安定区"
        },
        {
            "parentId": "621100",
            "cityId": "621121",
            "spell": "twx",
            "city": "通渭县"
        },
        {
            "parentId": "621100",
            "cityId": "621122",
            "spell": "lxx",
            "city": "陇西县"
        },
        {
            "parentId": "621100",
            "cityId": "621123",
            "spell": "wyx",
            "city": "渭源县"
        },
        {
            "parentId": "621100",
            "cityId": "621124",
            "spell": "ltx",
            "city": "临洮县"
        },
        {
            "parentId": "621100",
            "cityId": "621125",
            "spell": "zx",
            "city": "漳县"
        },
        {
            "parentId": "621100",
            "cityId": "621126",
            "spell": "mx",
            "city": "岷县"
        },
        {
            "parentId": "620000",
            "cityId": "621200",
            "spell": "lns",
            "city": "陇南市"
        },
        {
            "parentId": "621200",
            "cityId": "621201",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "621200",
            "cityId": "621202",
            "spell": "wdq",
            "city": "武都区"
        },
        {
            "parentId": "621200",
            "cityId": "621221",
            "spell": "cx",
            "city": "成县"
        },
        {
            "parentId": "621200",
            "cityId": "621222",
            "spell": "wx",
            "city": "文县"
        },
        {
            "parentId": "621200",
            "cityId": "621223",
            "spell": "dcx",
            "city": "宕昌县"
        },
        {
            "parentId": "621200",
            "cityId": "621224",
            "spell": "kx",
            "city": "康县"
        },
        {
            "parentId": "621200",
            "cityId": "621225",
            "spell": "xhx",
            "city": "西和县"
        },
        {
            "parentId": "621200",
            "cityId": "621226",
            "spell": "lx",
            "city": "礼县"
        },
        {
            "parentId": "621200",
            "cityId": "621227",
            "spell": "hx",
            "city": "徽县"
        },
        {
            "parentId": "621200",
            "cityId": "621228",
            "spell": "ldx",
            "city": "两当县"
        },
        {
            "parentId": "620000",
            "cityId": "622900",
            "spell": "lxhzzzz",
            "city": "临夏回族自治州"
        },
        {
            "parentId": "622900",
            "cityId": "622901",
            "spell": "lxs",
            "city": "临夏市"
        },
        {
            "parentId": "622900",
            "cityId": "622921",
            "spell": "lxx",
            "city": "临夏县"
        },
        {
            "parentId": "622900",
            "cityId": "622922",
            "spell": "klx",
            "city": "康乐县"
        },
        {
            "parentId": "622900",
            "cityId": "622923",
            "spell": "yjx",
            "city": "永靖县"
        },
        {
            "parentId": "622900",
            "cityId": "622924",
            "spell": "ghx",
            "city": "广河县"
        },
        {
            "parentId": "622900",
            "cityId": "622925",
            "spell": "hzx",
            "city": "和政县"
        },
        {
            "parentId": "622900",
            "cityId": "622926",
            "spell": "dxzzzx",
            "city": "东乡族自治县"
        },
        {
            "parentId": "622900",
            "cityId": "622927",
            "spell": "jssbazdxzslzzzx",
            "city": "积石山保安族东乡族撒拉族自治县"
        },
        {
            "parentId": "620000",
            "cityId": "623000",
            "spell": "gnczzzz",
            "city": "甘南藏族自治州"
        },
        {
            "parentId": "623000",
            "cityId": "623001",
            "spell": "hzs",
            "city": "合作市"
        },
        {
            "parentId": "623000",
            "cityId": "623021",
            "spell": "ltx",
            "city": "临潭县"
        },
        {
            "parentId": "623000",
            "cityId": "623022",
            "spell": "znx",
            "city": "卓尼县"
        },
        {
            "parentId": "623000",
            "cityId": "623023",
            "spell": "zqx",
            "city": "舟曲县"
        },
        {
            "parentId": "623000",
            "cityId": "623024",
            "spell": "dbx",
            "city": "迭部县"
        },
        {
            "parentId": "623000",
            "cityId": "623025",
            "spell": "mqx",
            "city": "玛曲县"
        },
        {
            "parentId": "623000",
            "cityId": "623026",
            "spell": "lqx",
            "city": "碌曲县"
        },
        {
            "parentId": "623000",
            "cityId": "623027",
            "spell": "xhx",
            "city": "夏河县"
        },
        {
            "parentId": "0",
            "cityId": "630000",
            "spell": "qhs",
            "city": "青海省"
        },
        {
            "parentId": "630000",
            "cityId": "630100",
            "spell": "xns",
            "city": "西宁市"
        },
        {
            "parentId": "630100",
            "cityId": "630101",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "630100",
            "cityId": "630102",
            "spell": "cdq",
            "city": "城东区"
        },
        {
            "parentId": "630100",
            "cityId": "630103",
            "spell": "czq",
            "city": "城中区"
        },
        {
            "parentId": "630100",
            "cityId": "630104",
            "spell": "cxq",
            "city": "城西区"
        },
        {
            "parentId": "630100",
            "cityId": "630105",
            "spell": "cbq",
            "city": "城北区"
        },
        {
            "parentId": "630100",
            "cityId": "630121",
            "spell": "dthztzzzx",
            "city": "大通回族土族自治县"
        },
        {
            "parentId": "630100",
            "cityId": "630122",
            "spell": "hzx",
            "city": "湟中县"
        },
        {
            "parentId": "630100",
            "cityId": "630123",
            "spell": "hyx",
            "city": "湟源县"
        },
        {
            "parentId": "630000",
            "cityId": "630200",
            "spell": "hds",
            "city": "海东市"
        },
        {
            "parentId": "630200",
            "cityId": "630202",
            "spell": "ldq",
            "city": "乐都区"
        },
        {
            "parentId": "630200",
            "cityId": "630221",
            "spell": "pax",
            "city": "平安县"
        },
        {
            "parentId": "630200",
            "cityId": "630222",
            "spell": "mhhztzzzx",
            "city": "民和回族土族自治县"
        },
        {
            "parentId": "630200",
            "cityId": "630223",
            "spell": "hztzzzx",
            "city": "互助土族自治县"
        },
        {
            "parentId": "630200",
            "cityId": "630224",
            "spell": "hlhzzzx",
            "city": "化隆回族自治县"
        },
        {
            "parentId": "630200",
            "cityId": "630225",
            "spell": "xhslzzzx",
            "city": "循化撒拉族自治县"
        },
        {
            "parentId": "630000",
            "cityId": "632200",
            "spell": "hbczzzz",
            "city": "海北藏族自治州"
        },
        {
            "parentId": "632200",
            "cityId": "632221",
            "spell": "myhzzzx",
            "city": "门源回族自治县"
        },
        {
            "parentId": "632200",
            "cityId": "632222",
            "spell": "qlx",
            "city": "祁连县"
        },
        {
            "parentId": "632200",
            "cityId": "632223",
            "spell": "hyx",
            "city": "海晏县"
        },
        {
            "parentId": "632200",
            "cityId": "632224",
            "spell": "gcx",
            "city": "刚察县"
        },
        {
            "parentId": "630000",
            "cityId": "632300",
            "spell": "hnczzzz",
            "city": "黄南藏族自治州"
        },
        {
            "parentId": "632300",
            "cityId": "632321",
            "spell": "trx",
            "city": "同仁县"
        },
        {
            "parentId": "632300",
            "cityId": "632322",
            "spell": "jzx",
            "city": "尖扎县"
        },
        {
            "parentId": "632300",
            "cityId": "632323",
            "spell": "zkx",
            "city": "泽库县"
        },
        {
            "parentId": "632300",
            "cityId": "632324",
            "spell": "hnmgzzzx",
            "city": "河南蒙古族自治县"
        },
        {
            "parentId": "630000",
            "cityId": "632500",
            "spell": "hnczzzz",
            "city": "海南藏族自治州"
        },
        {
            "parentId": "632500",
            "cityId": "632521",
            "spell": "ghx",
            "city": "共和县"
        },
        {
            "parentId": "632500",
            "cityId": "632522",
            "spell": "tdx",
            "city": "同德县"
        },
        {
            "parentId": "632500",
            "cityId": "632523",
            "spell": "gdx",
            "city": "贵德县"
        },
        {
            "parentId": "632500",
            "cityId": "632524",
            "spell": "xhx",
            "city": "兴海县"
        },
        {
            "parentId": "632500",
            "cityId": "632525",
            "spell": "gnx",
            "city": "贵南县"
        },
        {
            "parentId": "630000",
            "cityId": "632600",
            "spell": "glczzzz",
            "city": "果洛藏族自治州"
        },
        {
            "parentId": "632600",
            "cityId": "632621",
            "spell": "mqx",
            "city": "玛沁县"
        },
        {
            "parentId": "632600",
            "cityId": "632622",
            "spell": "bmx",
            "city": "班玛县"
        },
        {
            "parentId": "632600",
            "cityId": "632623",
            "spell": "gdx",
            "city": "甘德县"
        },
        {
            "parentId": "632600",
            "cityId": "632624",
            "spell": "drx",
            "city": "达日县"
        },
        {
            "parentId": "632600",
            "cityId": "632625",
            "spell": "jzx",
            "city": "久治县"
        },
        {
            "parentId": "632600",
            "cityId": "632626",
            "spell": "mdx",
            "city": "玛多县"
        },
        {
            "parentId": "630000",
            "cityId": "632700",
            "spell": "ysczzzz",
            "city": "玉树藏族自治州"
        },
        {
            "parentId": "632700",
            "cityId": "632701",
            "spell": "yss",
            "city": "玉树市"
        },
        {
            "parentId": "632700",
            "cityId": "632722",
            "spell": "zdx",
            "city": "杂多县"
        },
        {
            "parentId": "632700",
            "cityId": "632723",
            "spell": "cdx",
            "city": "称多县"
        },
        {
            "parentId": "632700",
            "cityId": "632724",
            "spell": "zdx",
            "city": "治多县"
        },
        {
            "parentId": "632700",
            "cityId": "632725",
            "spell": "nqx",
            "city": "囊谦县"
        },
        {
            "parentId": "632700",
            "cityId": "632726",
            "spell": "qmlx",
            "city": "曲麻莱县"
        },
        {
            "parentId": "630000",
            "cityId": "632800",
            "spell": "hxmgzczzzz",
            "city": "海西蒙古族藏族自治州"
        },
        {
            "parentId": "632800",
            "cityId": "632801",
            "spell": "gems",
            "city": "格尔木市"
        },
        {
            "parentId": "632800",
            "cityId": "632802",
            "spell": "dlhs",
            "city": "德令哈市"
        },
        {
            "parentId": "632800",
            "cityId": "632821",
            "spell": "wlx",
            "city": "乌兰县"
        },
        {
            "parentId": "632800",
            "cityId": "632822",
            "spell": "dlx",
            "city": "都兰县"
        },
        {
            "parentId": "632800",
            "cityId": "632823",
            "spell": "tjx",
            "city": "天峻县"
        },
        {
            "parentId": "0",
            "cityId": "640000",
            "spell": "nxhzzzq",
            "city": "宁夏回族自治区"
        },
        {
            "parentId": "640000",
            "cityId": "640100",
            "spell": "ycs",
            "city": "银川市"
        },
        {
            "parentId": "640100",
            "cityId": "640101",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "640100",
            "cityId": "640104",
            "spell": "xqq",
            "city": "兴庆区"
        },
        {
            "parentId": "640100",
            "cityId": "640105",
            "spell": "xxq",
            "city": "西夏区"
        },
        {
            "parentId": "640100",
            "cityId": "640106",
            "spell": "jfq",
            "city": "金凤区"
        },
        {
            "parentId": "640100",
            "cityId": "640121",
            "spell": "ynx",
            "city": "永宁县"
        },
        {
            "parentId": "640100",
            "cityId": "640122",
            "spell": "hlx",
            "city": "贺兰县"
        },
        {
            "parentId": "640100",
            "cityId": "640181",
            "spell": "lws",
            "city": "灵武市"
        },
        {
            "parentId": "640000",
            "cityId": "640200",
            "spell": "szss",
            "city": "石嘴山市"
        },
        {
            "parentId": "640200",
            "cityId": "640201",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "640200",
            "cityId": "640202",
            "spell": "dwkq",
            "city": "大武口区"
        },
        {
            "parentId": "640200",
            "cityId": "640205",
            "spell": "hnq",
            "city": "惠农区"
        },
        {
            "parentId": "640200",
            "cityId": "640221",
            "spell": "plx",
            "city": "平罗县"
        },
        {
            "parentId": "640000",
            "cityId": "640300",
            "spell": "wzs",
            "city": "吴忠市"
        },
        {
            "parentId": "640300",
            "cityId": "640301",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "640300",
            "cityId": "640302",
            "spell": "ltq",
            "city": "利通区"
        },
        {
            "parentId": "640300",
            "cityId": "640303",
            "spell": "hsbq",
            "city": "红寺堡区"
        },
        {
            "parentId": "640300",
            "cityId": "640323",
            "spell": "ycx",
            "city": "盐池县"
        },
        {
            "parentId": "640300",
            "cityId": "640324",
            "spell": "txx",
            "city": "同心县"
        },
        {
            "parentId": "640300",
            "cityId": "640381",
            "spell": "qtxs",
            "city": "青铜峡市"
        },
        {
            "parentId": "640000",
            "cityId": "640400",
            "spell": "gys",
            "city": "固原市"
        },
        {
            "parentId": "640400",
            "cityId": "640401",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "640400",
            "cityId": "640402",
            "spell": "yzq",
            "city": "原州区"
        },
        {
            "parentId": "640400",
            "cityId": "640422",
            "spell": "xjx",
            "city": "西吉县"
        },
        {
            "parentId": "640400",
            "cityId": "640423",
            "spell": "ldx",
            "city": "隆德县"
        },
        {
            "parentId": "640400",
            "cityId": "640424",
            "spell": "jyx",
            "city": "泾源县"
        },
        {
            "parentId": "640400",
            "cityId": "640425",
            "spell": "pyx",
            "city": "彭阳县"
        },
        {
            "parentId": "640000",
            "cityId": "640500",
            "spell": "zws",
            "city": "中卫市"
        },
        {
            "parentId": "640500",
            "cityId": "640501",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "640500",
            "cityId": "640502",
            "spell": "sptq",
            "city": "沙坡头区"
        },
        {
            "parentId": "640500",
            "cityId": "640521",
            "spell": "znx",
            "city": "中宁县"
        },
        {
            "parentId": "640500",
            "cityId": "640522",
            "spell": "hyx",
            "city": "海原县"
        },
        {
            "parentId": "0",
            "cityId": "650000",
            "spell": "xjwwezzq",
            "city": "新疆维吾尔自治区"
        },
        {
            "parentId": "650000",
            "cityId": "650100",
            "spell": "wlmqs",
            "city": "乌鲁木齐市"
        },
        {
            "parentId": "650100",
            "cityId": "650101",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "650100",
            "cityId": "650102",
            "spell": "tsq",
            "city": "天山区"
        },
        {
            "parentId": "650100",
            "cityId": "650103",
            "spell": "sybkq",
            "city": "沙依巴克区"
        },
        {
            "parentId": "650100",
            "cityId": "650104",
            "spell": "xsq",
            "city": "新市区"
        },
        {
            "parentId": "650100",
            "cityId": "650105",
            "spell": "smgq",
            "city": "水磨沟区"
        },
        {
            "parentId": "650100",
            "cityId": "650106",
            "spell": "tthq",
            "city": "头屯河区"
        },
        {
            "parentId": "650100",
            "cityId": "650107",
            "spell": "dbcq",
            "city": "达坂城区"
        },
        {
            "parentId": "650100",
            "cityId": "650109",
            "spell": "mdq",
            "city": "米东区"
        },
        {
            "parentId": "650100",
            "cityId": "650121",
            "spell": "wlmqx",
            "city": "乌鲁木齐县"
        },
        {
            "parentId": "650000",
            "cityId": "650200",
            "spell": "klmys",
            "city": "克拉玛依市"
        },
        {
            "parentId": "650200",
            "cityId": "650201",
            "spell": "sxq",
            "city": "市辖区"
        },
        {
            "parentId": "650200",
            "cityId": "650202",
            "spell": "dszq",
            "city": "独山子区"
        },
        {
            "parentId": "650200",
            "cityId": "650203",
            "spell": "klmyq",
            "city": "克拉玛依区"
        },
        {
            "parentId": "650200",
            "cityId": "650204",
            "spell": "bjtq",
            "city": "白碱滩区"
        },
        {
            "parentId": "650200",
            "cityId": "650205",
            "spell": "wehq",
            "city": "乌尔禾区"
        },
        {
            "parentId": "650000",
            "cityId": "652100",
            "spell": "tlfdq",
            "city": "吐鲁番地区"
        },
        {
            "parentId": "652100",
            "cityId": "652101",
            "spell": "tlfs",
            "city": "吐鲁番市"
        },
        {
            "parentId": "652100",
            "cityId": "652122",
            "spell": "ssx",
            "city": "鄯善县"
        },
        {
            "parentId": "652100",
            "cityId": "652123",
            "spell": "tkxx",
            "city": "托克逊县"
        },
        {
            "parentId": "650000",
            "cityId": "652200",
            "spell": "hmdq",
            "city": "哈密地区"
        },
        {
            "parentId": "652200",
            "cityId": "652201",
            "spell": "hms",
            "city": "哈密市"
        },
        {
            "parentId": "652200",
            "cityId": "652222",
            "spell": "blkhskzzx",
            "city": "巴里坤哈萨克自治县"
        },
        {
            "parentId": "652200",
            "cityId": "652223",
            "spell": "ywx",
            "city": "伊吾县"
        },
        {
            "parentId": "650000",
            "cityId": "652300",
            "spell": "cjhzzzz",
            "city": "昌吉回族自治州"
        },
        {
            "parentId": "652300",
            "cityId": "652301",
            "spell": "cjs",
            "city": "昌吉市"
        },
        {
            "parentId": "652300",
            "cityId": "652302",
            "spell": "fks",
            "city": "阜康市"
        },
        {
            "parentId": "652300",
            "cityId": "652323",
            "spell": "htbx",
            "city": "呼图壁县"
        },
        {
            "parentId": "652300",
            "cityId": "652324",
            "spell": "mnsx",
            "city": "玛纳斯县"
        },
        {
            "parentId": "652300",
            "cityId": "652325",
            "spell": "qtx",
            "city": "奇台县"
        },
        {
            "parentId": "652300",
            "cityId": "652327",
            "spell": "jmsex",
            "city": "吉木萨尔县"
        },
        {
            "parentId": "652300",
            "cityId": "652328",
            "spell": "mlhskzzx",
            "city": "木垒哈萨克自治县"
        },
        {
            "parentId": "650000",
            "cityId": "652700",
            "spell": "betlmgzzz",
            "city": "博尔塔拉蒙古自治州"
        },
        {
            "parentId": "652700",
            "cityId": "652701",
            "spell": "bls",
            "city": "博乐市"
        },
        {
            "parentId": "652700",
            "cityId": "652702",
            "spell": "alsks",
            "city": "阿拉山口市"
        },
        {
            "parentId": "652700",
            "cityId": "652722",
            "spell": "jhx",
            "city": "精河县"
        },
        {
            "parentId": "652700",
            "cityId": "652723",
            "spell": "wqx",
            "city": "温泉县"
        },
        {
            "parentId": "650000",
            "cityId": "652800",
            "spell": "byglmgzzz",
            "city": "巴音郭楞蒙古自治州"
        },
        {
            "parentId": "652800",
            "cityId": "652801",
            "spell": "kels",
            "city": "库尔勒市"
        },
        {
            "parentId": "652800",
            "cityId": "652822",
            "spell": "ltx",
            "city": "轮台县"
        },
        {
            "parentId": "652800",
            "cityId": "652823",
            "spell": "ylx",
            "city": "尉犁县"
        },
        {
            "parentId": "652800",
            "cityId": "652824",
            "spell": "rqx",
            "city": "若羌县"
        },
        {
            "parentId": "652800",
            "cityId": "652825",
            "spell": "qmx",
            "city": "且末县"
        },
        {
            "parentId": "652800",
            "cityId": "652826",
            "spell": "yqhzzzx",
            "city": "焉耆回族自治县"
        },
        {
            "parentId": "652800",
            "cityId": "652827",
            "spell": "hjx",
            "city": "和静县"
        },
        {
            "parentId": "652800",
            "cityId": "652828",
            "spell": "hsx",
            "city": "和硕县"
        },
        {
            "parentId": "652800",
            "cityId": "652829",
            "spell": "bhx",
            "city": "博湖县"
        },
        {
            "parentId": "650000",
            "cityId": "652900",
            "spell": "aksdq",
            "city": "阿克苏地区"
        },
        {
            "parentId": "652900",
            "cityId": "652901",
            "spell": "akss",
            "city": "阿克苏市"
        },
        {
            "parentId": "652900",
            "cityId": "652922",
            "spell": "wsx",
            "city": "温宿县"
        },
        {
            "parentId": "652900",
            "cityId": "652923",
            "spell": "kcx",
            "city": "库车县"
        },
        {
            "parentId": "652900",
            "cityId": "652924",
            "spell": "syx",
            "city": "沙雅县"
        },
        {
            "parentId": "652900",
            "cityId": "652925",
            "spell": "xhx",
            "city": "新和县"
        },
        {
            "parentId": "652900",
            "cityId": "652926",
            "spell": "bcx",
            "city": "拜城县"
        },
        {
            "parentId": "652900",
            "cityId": "652927",
            "spell": "wsx",
            "city": "乌什县"
        },
        {
            "parentId": "652900",
            "cityId": "652928",
            "spell": "awtx",
            "city": "阿瓦提县"
        },
        {
            "parentId": "652900",
            "cityId": "652929",
            "spell": "kpx",
            "city": "柯坪县"
        },
        {
            "parentId": "650000",
            "cityId": "653000",
            "spell": "kzlskekzzzz",
            "city": "克孜勒苏柯尔克孜自治州"
        },
        {
            "parentId": "653000",
            "cityId": "653001",
            "spell": "atss",
            "city": "阿图什市"
        },
        {
            "parentId": "653000",
            "cityId": "653022",
            "spell": "aktx",
            "city": "阿克陶县"
        },
        {
            "parentId": "653000",
            "cityId": "653023",
            "spell": "ahqx",
            "city": "阿合奇县"
        },
        {
            "parentId": "653000",
            "cityId": "653024",
            "spell": "wqx",
            "city": "乌恰县"
        },
        {
            "parentId": "650000",
            "cityId": "653100",
            "spell": "ksdq",
            "city": "喀什地区"
        },
        {
            "parentId": "653100",
            "cityId": "653101",
            "spell": "kss",
            "city": "喀什市"
        },
        {
            "parentId": "653100",
            "cityId": "653121",
            "spell": "sfx",
            "city": "疏附县"
        },
        {
            "parentId": "653100",
            "cityId": "653122",
            "spell": "slx",
            "city": "疏勒县"
        },
        {
            "parentId": "653100",
            "cityId": "653123",
            "spell": "yjsx",
            "city": "英吉沙县"
        },
        {
            "parentId": "653100",
            "cityId": "653124",
            "spell": "zpx",
            "city": "泽普县"
        },
        {
            "parentId": "653100",
            "cityId": "653125",
            "spell": "scx",
            "city": "莎车县"
        },
        {
            "parentId": "653100",
            "cityId": "653126",
            "spell": "ycx",
            "city": "叶城县"
        },
        {
            "parentId": "653100",
            "cityId": "653127",
            "spell": "mgtx",
            "city": "麦盖提县"
        },
        {
            "parentId": "653100",
            "cityId": "653128",
            "spell": "yphx",
            "city": "岳普湖县"
        },
        {
            "parentId": "653100",
            "cityId": "653129",
            "spell": "jsx",
            "city": "伽师县"
        },
        {
            "parentId": "653100",
            "cityId": "653130",
            "spell": "bcx",
            "city": "巴楚县"
        },
        {
            "parentId": "653100",
            "cityId": "653131",
            "spell": "tskegtjkzzx",
            "city": "塔什库尔干塔吉克自治县"
        },
        {
            "parentId": "650000",
            "cityId": "653200",
            "spell": "htdq",
            "city": "和田地区"
        },
        {
            "parentId": "653200",
            "cityId": "653201",
            "spell": "hts",
            "city": "和田市"
        },
        {
            "parentId": "653200",
            "cityId": "653221",
            "spell": "htx",
            "city": "和田县"
        },
        {
            "parentId": "653200",
            "cityId": "653222",
            "spell": "myx",
            "city": "墨玉县"
        },
        {
            "parentId": "653200",
            "cityId": "653223",
            "spell": "psx",
            "city": "皮山县"
        },
        {
            "parentId": "653200",
            "cityId": "653224",
            "spell": "lpx",
            "city": "洛浦县"
        },
        {
            "parentId": "653200",
            "cityId": "653225",
            "spell": "clx",
            "city": "策勒县"
        },
        {
            "parentId": "653200",
            "cityId": "653226",
            "spell": "ytx",
            "city": "于田县"
        },
        {
            "parentId": "653200",
            "cityId": "653227",
            "spell": "mfx",
            "city": "民丰县"
        },
        {
            "parentId": "650000",
            "cityId": "654000",
            "spell": "ylhskzzz",
            "city": "伊犁哈萨克自治州"
        },
        {
            "parentId": "654000",
            "cityId": "654002",
            "spell": "yns",
            "city": "伊宁市"
        },
        {
            "parentId": "654000",
            "cityId": "654003",
            "spell": "kts",
            "city": "奎屯市"
        },
        {
            "parentId": "654000",
            "cityId": "654021",
            "spell": "ynx",
            "city": "伊宁县"
        },
        {
            "parentId": "654000",
            "cityId": "654022",
            "spell": "cbcexbzzx",
            "city": "察布查尔锡伯自治县"
        },
        {
            "parentId": "654000",
            "cityId": "654023",
            "spell": "hcx",
            "city": "霍城县"
        },
        {
            "parentId": "654000",
            "cityId": "654024",
            "spell": "glx",
            "city": "巩留县"
        },
        {
            "parentId": "654000",
            "cityId": "654025",
            "spell": "xyx",
            "city": "新源县"
        },
        {
            "parentId": "654000",
            "cityId": "654026",
            "spell": "zsx",
            "city": "昭苏县"
        },
        {
            "parentId": "654000",
            "cityId": "654027",
            "spell": "tksx",
            "city": "特克斯县"
        },
        {
            "parentId": "654000",
            "cityId": "654028",
            "spell": "nlkx",
            "city": "尼勒克县"
        },
        {
            "parentId": "650000",
            "cityId": "654200",
            "spell": "tcdq",
            "city": "塔城地区"
        },
        {
            "parentId": "654200",
            "cityId": "654201",
            "spell": "tcs",
            "city": "塔城市"
        },
        {
            "parentId": "654200",
            "cityId": "654202",
            "spell": "wss",
            "city": "乌苏市"
        },
        {
            "parentId": "654200",
            "cityId": "654221",
            "spell": "emx",
            "city": "额敏县"
        },
        {
            "parentId": "654200",
            "cityId": "654223",
            "spell": "swx",
            "city": "沙湾县"
        },
        {
            "parentId": "654200",
            "cityId": "654224",
            "spell": "tlx",
            "city": "托里县"
        },
        {
            "parentId": "654200",
            "cityId": "654225",
            "spell": "ymx",
            "city": "裕民县"
        },
        {
            "parentId": "654200",
            "cityId": "654226",
            "spell": "hbksemgzzx",
            "city": "和布克赛尔蒙古自治县"
        },
        {
            "parentId": "650000",
            "cityId": "654300",
            "spell": "altdq",
            "city": "阿勒泰地区"
        },
        {
            "parentId": "654300",
            "cityId": "654301",
            "spell": "alts",
            "city": "阿勒泰市"
        },
        {
            "parentId": "654300",
            "cityId": "654321",
            "spell": "bejx",
            "city": "布尔津县"
        },
        {
            "parentId": "654300",
            "cityId": "654322",
            "spell": "fyx",
            "city": "富蕴县"
        },
        {
            "parentId": "654300",
            "cityId": "654323",
            "spell": "fhx",
            "city": "福海县"
        },
        {
            "parentId": "654300",
            "cityId": "654324",
            "spell": "hbhx",
            "city": "哈巴河县"
        },
        {
            "parentId": "654300",
            "cityId": "654325",
            "spell": "qhx",
            "city": "青河县"
        },
        {
            "parentId": "654300",
            "cityId": "654326",
            "spell": "jmnx",
            "city": "吉木乃县"
        },
        {
            "parentId": "650000",
            "cityId": "659000",
            "spell": "zzqzxxjxzqh",
            "city": "自治区直辖县级行政区划"
        },
        {
            "parentId": "659000",
            "cityId": "659001",
            "spell": "shzs",
            "city": "石河子市"
        },
        {
            "parentId": "659000",
            "cityId": "659002",
            "spell": "ales",
            "city": "阿拉尔市"
        },
        {
            "parentId": "659000",
            "cityId": "659003",
            "spell": "tmsks",
            "city": "图木舒克市"
        },
        {
            "parentId": "659000",
            "cityId": "659004",
            "spell": "wjqs",
            "city": "五家渠市"
        },
        {
            "parentId": "0",
            "cityId": "710000",
            "spell": "tws",
            "city": "台湾省"
        },
        {
            "parentId": "0",
            "cityId": "810000",
            "spell": "xgtbxzq",
            "city": "香港特别行政区"
        },
        {
            "parentId": "0",
            "cityId": "820000",
            "spell": "amtbxzq",
            "city": "澳门特别行政区"
        }
    ],
    "header": {
        "verificationcode": "10001",
        "code": "S1003"
    }
};